Repository: neda-zal/vscode-language-pack-lt
Catalog: vscode-python.po
Languages: lt_lt

# python.command.python.sortImports.title
source: Sort Imports
lt_lt: Rikiuoti import sakinius

# python.command.python.startREPL.title
source: Start REPL
lt_lt: Paleisti REPL

# python.command.python.createTerminal.title
source: Create Terminal
lt_lt: Paleisti terminalą

# python.command.python.buildWorkspaceSymbols.title
source: Build Workspace Symbols
lt_lt: Kurti darbo srities simbolius

# python.command.python.runtests.title
source: Run All Tests
lt_lt: Vykdyti visus testus

# python.command.python.debugtests.title
source: Debug All Tests
lt_lt: Derinti visus testus

# python.command.python.execInTerminal.title
source: Run Python File in Terminal
lt_lt: Paleisti Python failą terminale

# python.command.python.setInterpreter.title
source: Select Interpreter
lt_lt: Pasirinkti interpretatorių

# python.command.python.switchOffInsidersChannel.title
source: Switch to Default Channel
lt_lt: Perjungti į numatytąjį kanalą

# python.command.python.switchToDailyChannel.title
source: Switch to Insiders Daily Channel
lt_lt: Persijungti į "Insider" kasdienį kanalą

# python.command.python.switchToWeeklyChannel.title
source: Switch to Insiders Weekly Channel
lt_lt: Persijungti į "Insider" savaitinį kanalą

# python.command.python.clearWorkspaceInterpreter.title
source: Clear Workspace Interpreter Setting
lt_lt: Valyti darbo srities interpretatoriaus parametrą

# python.command.python.refactorExtractVariable.title
source: Extract Variable
lt_lt: Išskirti kintamąjį

# python.command.python.refactorExtractMethod.title
source: Extract Method
lt_lt: Išskirti metodą

# python.command.python.viewOutput.title
source: Show Output
lt_lt: Rodyti išvestį

# python.command.python.viewTestOutput.title
source: Show Test Output
lt_lt: Rodyti testo išvestį

# python.command.python.viewLanguageServerOutput.title
source: Show Language Server Output
lt_lt: Rodyti kalbos serverio išvestį

# python.command.python.selectAndRunTestMethod.title
source: Run Test Method ...
lt_lt: Vykdyti testo metodą ...

# python.command.python.selectAndDebugTestMethod.title
source: Debug Test Method ...
lt_lt: Derinti testo metodą ...

# python.command.python.selectAndRunTestFile.title
source: Run Test File ...
lt_lt: Vykdyti testo failą ...

# python.command.python.runCurrentTestFile.title
source: Run Current Test File
lt_lt: Vykdyti dabartinį testo failą

# python.command.python.runFailedTests.title
source: Run Failed Tests
lt_lt: Paleisti nepavykusius testus

# python.command.python.discoverTests.title
source: Discover Tests
lt_lt: Rasti testus

# python.command.python.discoveringTests.title
source: Discovering...
lt_lt: Atrandama…

# python.command.python.stopTests.title
source: Stop
lt_lt: Stabdyti

# python.command.python.configureTests.title
source: Configure Tests
lt_lt: Konfigūruoti testus

# python.command.python.execSelectionInTerminal.title
source: Run Selection/Line in Python Terminal
lt_lt: Vykdyti pasirinkimą / eilutę "Python" terminale

# python.command.python.execSelectionInDjangoShell.title
source: Run Selection/Line in Django Shell
lt_lt: Vykdyti pasirinkimą / eilutę "Django Shell" programoje

# python.command.python.goToPythonObject.title
source: Go to Python Object
lt_lt: Eiti į Python objektą

# python.command.python.reportIssue.title
source: Report Issue
lt_lt: Pranešti problemą

# python.command.python.setLinter.title
source: Select Linter
lt_lt: Pasirinkite tikrintuvę

# python.command.python.enableLinting.title
source: Enable/Disable Linting
lt_lt: Įjungti / išjungti tikrinimą

# python.command.python.runLinting.title
source: Run Linting
lt_lt: Tikrinti

# python.command.python.enableSourceMapSupport.title
source: Enable Source Map Support For Extension Debugging
lt_lt: Įjungti šaltinio žemėlapio palaikymą plėtinio derinimui

# python.command.python.clearPersistentStorage.title
source: Clear Internal Extension Cache
lt_lt: Išvalyti vidinę plėtinių talpyklą

# python.command.python.startPage.open.title
source: Open Start Page
lt_lt: Atidaryti pradžios puslapį

# python.command.python.analysis.clearCache.title
source: Clear Module Analysis Cache
lt_lt: Išvalyti modulio analizės talpyklą

# python.command.python.analysis.restartLanguageServer.title
source: Restart Language Server
lt_lt: Iš naujo paleiskite kalbos serverį

# python.command.python.launchTensorBoard.title
source: Launch TensorBoard
lt_lt: Paleiskite TensorBoard

# python.command.python.refreshTensorBoard.title
source: Refresh TensorBoard
lt_lt: Atnaujinti TensorBoard

# python.snippet.launch.standard.label
source: Python: Current File
lt_lt: Python: Dabartinis failas

# python.snippet.launch.module.label
source: Python: Module
lt_lt: Python: Modulis

# python.snippet.launch.module.default
source: enter-your-module-name
lt_lt: įveskite-savo-modulio-vardą

# python.snippet.launch.attach.label
source: Python: Remote Attach
lt_lt: Python: Nuotolinis prijungimas

# python.snippet.launch.attachpid.label
source: Python: Attach using Process Id
lt_lt: Python: Prisijungti naudojant proceso ID

# Pylance.remindMeLater
source: Remind me later
lt_lt: Priminti vėliau

# Pylance.pylanceNotInstalledMessage
source: Pylance extension is not installed.
lt_lt: Plėtinys Pylance neįdiegtas.

# Pylance.pylanceInstalledReloadPromptMessage
source: Pylance extension is now installed. Reload window to activate?
lt_lt: Plėtinys Pylance dabar įdiegtas. Paleisti langą iš naujo, kad suaktyvintumėte?

# Pylance.pylanceRevertToJediPrompt
source: The Pylance extension is not installed but the python.languageServer value is set to "Pylance". Would you like to install the Pylance extension to use Pylance, or revert back to Jedi?
lt_lt: Plėtinys Pylance neįdiegtas, tačiau nustatyta python.languageServer reikšmė yra “Pylance”. Ar norėtumėte įdiegti plėtinį Pylance, kad galėtumėte jį naudoti, ar grįžti prie Jedi?

# Pylance.pylanceInstallPylance
source: Install Pylance
lt_lt: Įdiekite Pylance

# Pylance.pylanceRevertToJedi
source: Revert to Jedi
lt_lt: Grįžti prie Jedi

# Experiments.inGroup
source: User belongs to experiment group '{0}'
lt_lt: Naudotojas priklauso eksperimentų grupei '{0}'

# Experiments.optedOutOf
source: User opted out of experiment group '{0}'
lt_lt: Naudotojas atsisakė eksperimentinų grupės '{0}'

# Interpreters.RefreshingInterpreters
source: Refreshing Python Interpreters
lt_lt: Python interpretatorių atnaujinimas

# Interpreters.entireWorkspace
source: Entire workspace
lt_lt: Visa darbo erdvė

# Interpreters.pythonInterpreterPath
source: Python interpreter path: {0}
lt_lt: Kelias iki Python interpretatoriaus: {0}

# Interpreters.LoadingInterpreters
source: Loading Python Interpreters
lt_lt: Įkeliami Python interpretatoriai

# Interpreters.condaInheritEnvMessage
source: We noticed you're using a conda environment. If you are experiencing issues with this environment in the integrated terminal, we recommend that you let the Python extension change "terminal.integrated.inheritEnv" to false in your user settings.
lt_lt: Pastebėjome, kad naudojate aplinką conda. Jei integruotame terminale susiduriate su šios aplinkos problemomis, rekomenduojame leisti Python plėtiniui pakeisti „terminal.integrated.inheritEnv“ į false Jūsų naudotojo nustatymuose.

# InterpreterQuickPickList.quickPickListPlaceholder
source: Current: {0}
lt_lt: Dabartinis: {0}

# InterpreterQuickPickList.enterPath.detail
source: Enter path or find an existing interpreter
lt_lt: Įvesti kelią arba rasti interpretatorių

# InterpreterQuickPickList.enterPath.label
source: Enter interpreter path...
lt_lt: Įveskite interpretatoriaus kelią...

# InterpreterQuickPickList.enterPath.placeholder
source: Enter path to a Python interpreter.
lt_lt: Įveskite kelią iki Python interpretatoriaus.

# InterpreterQuickPickList.findPath.detail
source: Browse the file system to find a Python interpreter.
lt_lt: Parinkite Python interpretatorių naršydami po failų sistemą.

# InterpreterQuickPickList.findPath.label
source: I can't find the interpreter I want to select...
lt_lt: Nerandu norimo pasirinkti interpretatoriaus...

# InterpreterQuickPickList.refreshInterpreterList
source: Refresh Interpreter list
lt_lt: Atnaujinti interpretatorių sąrašą

# InterpreterQuickPickList.browsePath.label
source: Find...
lt_lt: Ieškoti...

# InterpreterQuickPickList.browsePath.detail
source: Browse your file system to find a Python interpreter.
lt_lt: Parinkite Python interpretatorių naršydami po failų sistemą.

# InterpreterQuickPickList.browsePath.title
source: Select Python interpreter
lt_lt: Pasirinkti interpretatorių

# InterpreterQuickPickList.defaultInterpreterPath.label
source: Use default Python interpreter path
lt_lt: Naudoti numatytąjį Python interpretatoriaus kelią

# diagnostics.upgradeCodeRunner
source: Please update the Code Runner extension for it to be compatible with the Python extension.
lt_lt: Atnaujinkite Code Runner plėtinį, kad jis būtų suderinamas su Python plėtiniu.

# Common.bannerLabelYes
source: Yes
lt_lt: Taip

# Common.bannerLabelNo
source: No
lt_lt: Ne

# Common.doNotShowAgain
source: Do not show again
lt_lt: Daugiau nerodyti

# Common.reload
source: Reload
lt_lt: Įkelti iš naujo

# Common.moreInfo
source: More Info
lt_lt: Daugiau informacijos

# Common.and
source: and
lt_lt: ir

# Common.ok
source: Ok
lt_lt: Gerai

# Common.install
source: Install
lt_lt: Įdiegti

# Common.learnMore
source: Learn more
lt_lt: Sužinoti daugiau

# Common.reportThisIssue
source: Report this issue
lt_lt: Pranešti apie šią problemą

# CommonSurvey.remindMeLaterLabel
source: Remind me later
lt_lt: Priminti vėliau

# CommonSurvey.yesLabel
source: Yes, take survey now
lt_lt: Taip, atlikite apklausą dabar

# CommonSurvey.noLabel
source: No, thanks
lt_lt: Ne, ačiū

# OutputChannelNames.languageServer
source: Python Language Server
lt_lt: Python kalbos serveris

# OutputChannelNames.pythonTest
source: Python Test Log
lt_lt: Python testų žurnalas

# ExtensionSurveyBanner.bannerMessage
source: Can you please take 2 minutes to tell us how the Python extension is working for you?
lt_lt: Ar galite skirti 2 minutes ir papasakoti, kaip jums veikia Python plėtinys?

# ExtensionSurveyBanner.bannerLabelYes
source: Yes, take survey now
lt_lt: Taip, atlikite apklausą dabar

# ExtensionSurveyBanner.bannerLabelNo
source: No, thanks
lt_lt: Ne, ačiū

# ExtensionSurveyBanner.maybeLater
source: Maybe later
lt_lt: Galbūt vėliau

# ExtensionSurveyBanner.mplsMessage
source: Can you please take 2 minutes to tell us about your experience using the Microsoft Python Language Server?
lt_lt: Ar galite skirti 2 minutes ir papasakoti apie savo patirtį naudojant Microsoft Python kalbos serverį?

# ExtensionChannels.installingInsidersMessage
source: Installing Insiders...
lt_lt: Diegiama versija „Insider“…

# ExtensionChannels.installingStableMessage
source: Installing Stable...
lt_lt: Diegiama versija „Stable“…

# ExtensionChannels.installationCompleteMessage
source: complete.
lt_lt: baigta.

# ExtensionChannels.downloadingInsidersMessage
source: Downloading Insiders Extension...
lt_lt: Atsiunčiama plėtinio „Insider“ versija...

# ExtensionChannels.yesWeekly
source: Yes, weekly
lt_lt: Taip, kas savaitę

# ExtensionChannels.yesDaily
source: Yes, daily
lt_lt: Taip, kasdien

# ExtensionChannels.promptMessage
source: We noticed you are using Visual Studio Code Insiders. Would you like to use the Insiders build of the Python extension?
lt_lt: Pastebėjome, kad naudojate “Visual Studio Code Insiders”. Ar norėtumėte naudoti Python plėtinio “Insiders” versiją?

# ExtensionChannels.reloadToUseInsidersMessage
source: Please reload Visual Studio Code to use the insiders build of the Python extension.
lt_lt: Paleiskite iš naujo "Visual Studio Code", kad galėtumėte naudoti Python plėtinio “Insiders” versiją.

# ExtensionChannels.downloadCompletedOutputMessage
source: Insiders build download complete.
lt_lt: “Insiders” versijos atsisiuntimas baigtas.

# ExtensionChannels.startingDownloadOutputMessage
source: Starting download for Insiders build.
lt_lt: Pradedamas “Insiders” versijos atsisiuntimas.

# Interpreters.environmentPromptMessage
source: We noticed a new virtual environment has been created. Do you want to select it for the workspace folder?
lt_lt: Pastebėjome, kad sukurta nauja virtuali aplinka. Ar norite ją pasirinkti kaip darbo vietos aplanką?

# Linter.enableLinter
source: Enable {0}
lt_lt: Įjungti {0}

# Linter.enablePylint
source: You have a pylintrc file in your workspace. Do you want to enable pylint?
lt_lt: Savo darbo aplinkoje turite pylintrc failą. Ar norite įjungti pylint?

# Linter.replaceWithSelectedLinter
source: Multiple linters are enabled in settings. Replace with '{0}'?
lt_lt: Nustatymuose įjungti keli tikrintojai. Pakeisti į '{0}'?

# Linter.install
source: Install a linter to get error reporting.
lt_lt: Įdiekite tikrintoją, kad gautumėte pranešimus apie klaidas.

# Linter.installPylint
source: Install pylint
lt_lt: Įdiegti pylint

# Linter.installFlake8
source: Install flake8
lt_lt: Įdiegti flake8

# Linter.selectLinter
source: Select Linter
lt_lt: Pasirinkite tikrintuvę

# Installer.noCondaOrPipInstaller
source: There is no Conda or Pip installer available in the selected environment.
lt_lt: Pasirinktoje aplinkoje nėra Conda arba Pip diegimo programos.

# Installer.noPipInstaller
source: There is no Pip installer available in the selected environment.
lt_lt: Pasirinktoje aplinkoje nėra Pip diegimo programos.

# Installer.searchForHelp
source: Search for help
lt_lt: Ieškoti pagalbos

# Installer.couldNotInstallLibrary
source: Could not install {0}. If pip is not available, please use the package manager of your choice to manually install this library into your Python environment.
lt_lt: Nepavyko įdiegti {0}. Jei nėra pip, naudokite savo pasirinktą paketų tvarkyklę, kad rankiniu būdu įdiegtumėte šią biblioteką į savo Python aplinką.

# Installer.dataScienceInstallPrompt
source: Data Science library {0} is not installed. Install?
lt_lt: Duomenų mokslo biblioteka {0} neįdiegta. Įdiegti?

# diagnostics.removedPythonPathFromSettings
source: The "python.pythonPath" setting in your settings.json is no longer used by the Python extension. If you want, you can use a new setting called "python.defaultInterpreterPath" instead. Keep in mind that you need to change the value of this setting manually as the Python extension doesn’t modify it when you change interpreters. [Learn more](https://aka.ms/AA7jfor).
lt_lt: Jūsų settings.json faile yra „Python.pythonPath“ nustatymas, kurio Python plėtinys nebenaudoja. Jei norite, vietoj jo galite naudoti naują nustatymą „python.defaultInterpreterPath“. Atminkite, kad šio nustatymo reikšmę reikia keisti rankiniu būdu, nes „Python“ plėtinys jo nekeičia, kai keičiate interpretatorius. [Sužinokite daugiau](https://aka.ms/AA7jfor).

# diagnostics.warnSourceMaps
source: Source map support is enabled in the Python Extension, this will adversely impact performance of the extension.
lt_lt: Šaltinio žemėlapio palaikymas yra įjungtas Python plėtinyje, tai turės neigiamos įtakos plėtinio našumui.

# diagnostics.disableSourceMaps
source: Disable Source Map Support
lt_lt: Išjungti šaltinio žemėlapio palaikymą

# diagnostics.warnBeforeEnablingSourceMaps
source: Enabling source map support in the Python Extension will adversely impact performance of the extension.
lt_lt: Šaltinio žemėlapio įjungimas turės neigiamos įtakos Python plėtinio našumui.

# diagnostics.enableSourceMapsAndReloadVSC
source: Enable and reload Window
lt_lt: Įjungti ir įkelti langą iš naujo

# diagnostics.lsNotSupported
source: Your operating system does not meet the minimum requirements of the Python Language Server. Reverting to the alternative autocompletion provider, Jedi.
lt_lt: Jūsų operacinė sistema neatitinka minimalių Python kalbos serverio reikalavimų. Grįžtama prie alternatyvaus automatinio užbaigimo teikėjo, Jedi.

# diagnostics.invalidPythonPathInDebuggerSettings
source: You need to select a Python interpreter before you start debugging
lt_lt: Prieš pradėdami derinti, turite pasirinkti Python interpretatorių

# diagnostics.invalidPythonPathInDebuggerLaunch
source: The Python path in your debug configuration is invalid.
lt_lt: Jūsų derinimo konfigūracijoje nurodytas Python kelias yra nevalidus.

# diagnostics.invalidDebuggerTypeDiagnostic
source: Your launch.json file needs to be updated to change the "pythonExperimental" debug configurations to use the "python" debugger type, otherwise Python debugging may not work. Would you like to automatically update your launch.json file now?
lt_lt: Jūsų launch.json failą reikia atnaujinti, kad būtų pakeistos „pythonExperimental“ derinimo konfigūracijos ir būtų naudojama Python derintuvė, kitaip Python derinimas gali neveikti. Ar norėtumėte dabar automatiškai atnaujinti savo launch.json failą?

# diagnostics.consoleTypeDiagnostic
source: Your launch.json file needs to be updated to change the console type string from "none" to "internalConsole", otherwise Python debugging may not work. Would you like to automatically update your launch.json file now?
lt_lt: Jūsų launch.json failą reikia atnaujinti ir pakeisti konsolės tipo eilutę iš „none“ į „internalConsole“, kitaip Python derinimas gali neveikti. Ar norėtumėte dabar automatiškai atnaujinti savo launch.json failą?

# diagnostics.justMyCodeDiagnostic
source: Configuration "debugStdLib" in launch.json is no longer supported. It's recommended to replace it with "justMyCode", which is the exact opposite of using "debugStdLib". Would you like to automatically update your launch.json file to do that?
lt_lt: Konfigūracija „debugStdLib“ launch.json nebėra palaikoma. Ją rekomenduojama pakeisti „justMyCode“, kuri yra visiškai priešinga „debugStdLib“. Ar norėtumėte automatiškai atnaujinti savo launch.json failą, kad tai būtų padaryta?

# diagnostics.checkIsort5UpgradeGuide
source: We found outdated configuration for sorting imports in this workspace. Check the [isort upgrade guide](https://aka.ms/AA9j5x4) to update your settings.
lt_lt: Šioje darbo aplinkoje radome pasenusią import sakinių rūšiavimo konfigūraciją. Norėdami atnaujinti nustatymus, peržiūrėkite [isort atnaujinimo vadovą] (https://aka.ms/AA9j5x4).

# diagnostics.yesUpdateLaunch
source: Yes, update launch.json
lt_lt: Taip, atnaujinkite launch.json

# diagnostics.invalidTestSettings
source: Your settings needs to be updated to change the setting "python.unitTest." to "python.testing.", otherwise testing Python code using the extension may not work. Would you like to automatically update your settings now?
lt_lt: Reikia atnaujinti nustatymus ir pakeisti nustatymą „python.unitTest.“ į „python.testing.“, kitaip Python kodo testavimas naudojant plėtinį gali neveikti. Ar norėtumėte dabar automatiškai atnaujinti nustatymus?

# diagnostics.pylanceDefaultMessage
source: The Python extension now includes Pylance to improve completions, code navigation, overall performance and much more! You can learn more about the update and learn how to change your language server [here](https://aka.ms/new-python-bundle)
lt_lt: Dabar Python plėtinys apima Pylance, kuris pagerina užbaigimą, kodo navigaciją, bendrą našumą ir dar daugiau! Galite sužinoti daugiau apie atnaujinimą ir sužinoti, kaip pakeisti kalbos serverį [čia](https://aka.ms/new-python-bundle)

# Common.canceled
source: Canceled
lt_lt: Atšauktas

# Common.cancel
source: Cancel
lt_lt: Atšaukti

# Common.yesPlease
source: Yes, please
lt_lt: Taip, prašau

# Common.loadingPythonExtension
source: Python extension loading...
lt_lt: Python plėtinys įkeliamas...

# debug.selectConfigurationTitle
source: Select a debug configuration
lt_lt: Pasirinkite derinimo konfigūraciją

# debug.selectConfigurationPlaceholder
source: Debug Configuration
lt_lt: Derinimo konfigūracija

# debug.launchJsonConfigurationsCompletionDescription
source: Select a Python debug configuration
lt_lt: Pasirinkite Python derinimo konfigūraciją

# debug.debugFileConfigurationLabel
source: Python File
lt_lt: Python failas

# debug.debugFileConfigurationDescription
source: Debug the currently active Python file
lt_lt: Derinti šiuo metu pasirinktą Python failą

# debug.debugModuleConfigurationLabel
source: Module
lt_lt: Modulis

# debug.debugModuleConfigurationDescription
source: Debug a Python module by invoking it with '-m'
lt_lt: Derinti Python modulį iškviečiant jį su '-m'

# debug.moduleEnterModuleTitle
source: Debug Module
lt_lt: Derinti modulį

# debug.moduleEnterModulePrompt
source: Enter a Python module/package name
lt_lt: Įveskite Python modulio/paketo pavadinimą

# debug.moduleEnterModuleDefault
source: enter-your-module-name
lt_lt: įveskite-savo-modulio-vardą

# debug.moduleEnterModuleInvalidNameError
source: Enter a valid module name
lt_lt: Įveskite validų modulio pavadinimą

# debug.remoteAttachConfigurationLabel
source: Remote Attach
lt_lt: Nuotolinis prijungimas

# debug.remoteAttachConfigurationDescription
source: Attach to a remote debug server
lt_lt: Prisijungti prie nuotolinio derinimo serverio

# debug.attachRemoteHostTitle
source: Remote Debugging
lt_lt: Nuotolinis derinimas

# debug.attachRemoteHostPrompt
source: Enter the host name
lt_lt: Įveskite kompiuterio pavadinimą

# debug.attachRemoteHostValidationError
source: Enter a valid host name or IP address
lt_lt: Įveskite galiojantį kompiuterio vardą arba IP adresą

# debug.attachRemotePortTitle
source: Remote Debugging
lt_lt: Nuotolinis derinimas

# debug.attachRemotePortPrompt
source: Enter the port number that the debug server is listening on
lt_lt: Įveskite prievado, kurio klausosi derinimo serveris, numerį

# debug.attachRemotePortValidationError
source: Enter a valid port number
lt_lt: Įveskite galiojantį prievado numerį

# debug.attachPidConfigurationLabel
source: Attach using Process ID
lt_lt: Prisijungti naudojant proceso ID

# debug.attachPidConfigurationDescription
source: Attach to a local process
lt_lt: Prisijungti prie vietinio proceso

# debug.debugDjangoConfigurationDescription
source: Launch and debug a Django web application
lt_lt: Paleisti ir derinti Django žiniatinklio programą

# debug.djangoEnterManagePyPathTitle
source: Debug Django
lt_lt: Derinti Django

# debug.djangoEnterManagePyPathPrompt
source: Enter the path to manage.py ('${workspaceFolderToken}' points to the root of the current workspace folder)
lt_lt: Įveskite kelią iki manage.py ('${workspaceFolderToken}' nurodo dabartinės darbo vietos aplanko šaknį)

# debug.djangoEnterManagePyPathInvalidFilePathError
source: Enter a valid Python file path
lt_lt: Įveskite galiojantį Python failo kelią

# debug.debugFastAPIConfigurationDescription
source: Launch and debug a FastAPI web application
lt_lt: Paleiskite ir derinkite FastAPI žiniatinklio programą

# debug.fastapiEnterAppPathOrNamePathTitle
source: Debug FastAPI
lt_lt: Derinti FastAPI

# debug.fastapiEnterAppPathOrNamePathPrompt
source: Enter the path to the application, e.g. 'main.py' or 'main'
lt_lt: Įveskite programos kelią, pavyzdžiui, "main.py" arba "main"

# debug.fastapiEnterAppPathOrNamePathInvalidNameError
source: Enter a valid name
lt_lt: Įveskite validų pavadinimą

# debug.debugFlaskConfigurationDescription
source: Launch and debug a Flask web application
lt_lt: Paleiskite ir derinkite Flask žiniatinklio programą

# debug.flaskEnterAppPathOrNamePathTitle
source: Debug Flask
lt_lt: Derinti Flask

# debug.flaskEnterAppPathOrNamePathPrompt
source: Enter the path to the application, e.g. 'app.py' or 'app'
lt_lt: Įveskite programos kelią, pavyzdžiui, 'app.py' arba 'app'

# debug.flaskEnterAppPathOrNamePathInvalidNameError
source: Enter a valid name
lt_lt: Įveskite validų pavadinimą

# debug.debugPyramidConfigurationDescription
source: Launch and debug a Pyramid web application
lt_lt: Paleiskite ir derinkite Pyramid žiniatinklio programą

# debug.pyramidEnterDevelopmentIniPathTitle
source: Debug Pyramid
lt_lt: Derinti Pyramid
