Repository: neda-zal/vscode-language-pack-lt
Catalog: vscode-python1_*.po
Languages: lt

# Testing.testErrorDiagnosticMessage
source: Error
lt: Klaida

# Testing.testFailDiagnosticMessage
source: Fail
lt: Nepavyko

# Testing.testSkippedDiagnosticMessage
source: Skipped
lt: Praleistas

# Testing.configureTests
source: Configure Test Framework
lt: Konfigūruokite testavimo sistemą

# Testing.disableTests
source: Disable Tests
lt: Išjungti testus

# Common.openOutputPanel
source: Show output
lt: Rodyti išvestį

# LanguageService.lsFailedToStart
source: We encountered an issue starting the language server. Reverting to Jedi language engine. Check the Python output panel for details.
lt: Paleidžiant kalbos serverį iškilo problema. Grįžimas prie Jedi kalbos variklio. Išsamesnės informacijos ieškokite Python išvesties skydelyje.

# LanguageService.lsFailedToDownload
source: We encountered an issue downloading the language server. Reverting to Jedi language engine. Check the Python output panel for details.
lt: Atsisiunčiant kalbos serverį iškilo problema. Grįžimas prie Jedi kalbos variklio. Išsamesnės informacijos ieškokite Python išvesties skydelyje.

# LanguageService.lsFailedToExtract
source: We encountered an issue extracting the language server. Reverting to Jedi language engine. Check the Python output panel for details.
lt: Išskleidžiant kalbos serverį iškilo problema. Grįžimas prie Jedi kalbos variklio. Išsamesnės informacijos ieškokite Python išvesties skydelyje.

# LanguageService.downloadFailedOutputMessage
source: Language server download failed
lt: Kalbos serverio atsisiuntimas nepavyko

# LanguageService.extractionFailedOutputMessage
source: Language server extraction failed
lt: Kalbos serverio išskleidimo nepavyko

# LanguageService.extractionCompletedOutputMessage
source: Language server download complete
lt: Kalbos serverio atsisiuntimas baigtas

# LanguageService.extractionDoneOutputMessage
source: done
lt: padaryta

# LanguageService.reloadVSCodeIfSeachPathHasChanged
source: Search paths have changed for this Python interpreter. Please reload the extension to ensure that the IntelliSense works correctly
lt: Šio Python interpretatoriaus paieškos keliai pasikeitė. Iš naujo įkelkite plėtinį, kad įsitikintumėte, jog „IntelliSense“ veikia tinkamai

# LanguageService.startingJedi
source: Starting Jedi Python language engine.
lt: Paleidžiamas Jedi Python kalbos variklis.

# LanguageService.startingMicrosoft
source: Starting Microsoft Python language server.
lt: „Microsoft Python“ kalbos serverio paleidimas.

# LanguageService.startingPylance
source: Starting Pylance language server.
lt: Paleidžiamas Pylance kalbos serveris.

# LanguageService.startingJediLSP
source: Starting Jedi language server.
lt: Paleidžiamas Jedi kalbos serveris.

# LanguageService.startingNone
source: Editor support is inactive since language server is set to None.
lt: Redagavimo priemonės palaikymas neaktyvus, nes kalbos serveris nustatytas kaip Nėra.

# LanguageService.reloadAfterLanguageServerChange
source: Please reload the window switching between language servers.
lt: Iš naujo įkelkite langą, perjungdami tarp kalbų serverių.

# AttachProcess.unsupportedOS
source: Operating system '{0}' not supported.
lt: Operacinė sistema „{0}“ nepalaikoma.

# AttachProcess.attachTitle
source: Attach to process
lt: Pritvirtinkite prie proceso

# AttachProcess.selectProcessPlaceholder
source: Select the process to attach to
lt: Pasirinkite procesą, prie kurio norite pridėti

# AttachProcess.noProcessSelected
source: No process selected
lt: Nepasirinktas joks procesas

# AttachProcess.refreshList
source: Refresh process list
lt: Atnaujinkite procesų sąrašą

# diagnostics.updateSettings
source: Yes, update settings
lt: Taip, atnaujinti nustatymus

# Common.noIWillDoItLater
source: No, I will do it later
lt: Ne, aš tai padarysiu vėliau

# Common.notNow
source: Not now
lt: Ne dabar

# Common.gotIt
source: Got it!
lt: Supratau!

# Interpreters.selectInterpreterTip
source: Tip: you can change the Python interpreter used by the Python extension by clicking on the Python version in the status bar
lt: Patarimas: Python plėtinio naudojamą Python interpretatorių galite pakeisti spustelėdami Python versiją būsenos juostoje

# downloading.file
source: Downloading {0}...
lt: Atsisiunčiama {0}...

# downloading.file.progress
source: {0}{1} of {2} KB ({3}%)
lt: {0}{1} iš {2} KB ({3}%)

# products.installingModule
source: Installing {0}
lt: Diegiama {0}

# OutdatedDebugger.updateDebuggerMessage
source: We noticed you are attaching to ptvsd (Python debugger), which was deprecated on May 1st, 2020. Please switch to [debugpy](https://aka.ms/migrateToDebugpy).
lt: Pastebėjome, kad prisijungiate prie „ptvsd“ („Python“ derintuvo), kuris buvo nebenaudojamas 2020 m. gegužės 1 d. Perjunkite į [debugpy](https://aka.ms/migrateToDebugpy).

# StartPage.getStarted
source: Python - Get Started
lt: Python – pradėkite

# StartPage.pythonExtensionTitle
source: Python Extension
lt: Python plėtinys

# StartPage.createJupyterNotebook
source: Create a Jupyter Notebook
lt: Sukurkite „Jupyter“ užrašų knygelę

# StartPage.notebookDescription
source: - Run "<div class="link italics" role="button" onclick={0}>Create New Blank Notebook</div>" in the Command Palette (<div class="italics">Shift + Command + P</div>)<br />- Explore our <div class="link" role="button" onclick={1}>sample notebook</div> to learn about notebook features
lt: - Komandų paletėje paleiskite <div class=link italics role=button onclick={0}>Sukurti naują tuščią bloknotą</div> (<div class=italics>Shift + Command + P< /div>)<br />– Naršykite mūsų <div class=link role=button onclick={1}>bloknoto pavyzdį</div>, kad sužinotumėte apie bloknoto funkcijas

# StartPage.createAPythonFile
source: Create a Python File
lt: Sukurkite Python failą

# StartPage.pythonFileDescription
source: - Create a <div class="link" role="button" onclick={0}>new file</div> with a .py extension
lt: – Sukurkite <div class=link role=button onclick={0}>naują failą</div> su plėtiniu .py

# StartPage.openInteractiveWindow
source: Use the Interactive Window to develop Python Scripts
lt: Naudokite interaktyvųjį langą Python scenarijų kūrimui

# StartPage.interactiveWindowDesc
source: - You can create cells on a Python file by typing "#%%". Make sure you have the Jupyter extension installed. <br /> - Use "<div class="italics">Shift + Enter</div> " to run a cell, the output will be shown in the interactive window
lt: - Python faile galite sukurti langelius įvesdami #%%. Įsitikinkite, kad įdiegėte Jupyter plėtinį. <br /> – naudokite <div class=italics>Shift + Enter</div> , kad paleistumėte langelį, išvestis bus rodoma interaktyviame lange

# StartPage.releaseNotes
source: Take a look at our <a class="link" href={0}>Release Notes</a> to learn more about the latest features.
lt: Peržiūrėkite mūsų <a class=link href={0}>išleidimo pastabas</a>, kad sužinotumėte daugiau apie naujausias funkcijas.

# StartPage.mailingList
source: <a class="link" href={0}>Sign up</a> for tips and tutorials through our mailing list.
lt: <a class=link href={0}>Prisiregistruokite</a>, kad gautumėte patarimų ir pamokų iš mūsų adresų sąrašo.

# StartPage.tutorialAndDoc
source: Explore more features in our <a class="link" href={0}>Tutorials</a> or check <a class="link" href={1}>Documentation</a> for tips and troubleshooting.
lt: Išbandykite daugiau funkcijų mūsų <a class=link href={0}>mokymo programose</a> arba žr. <a class=link href={1}>dokumentaciją</a>, kur rasite patarimų ir trikčių šalinimo.

# StartPage.dontShowAgain
source: Don't show this page again
lt: Daugiau nerodyti šio puslapio

# StartPage.helloWorld
source: Hello world
lt: Labas pasauli

# StartPage.sampleNotebook
source: Notebooks intro
lt: Užrašų knygelių įvadas

# StartPage.openFolder
source: Open a Folder or Workspace
lt: Atidarykite aplanką arba darbo sritį

# StartPage.folderDesc
source: - Open a <div class="link" role="button" onclick={0}>Folder</div><br /> - Open a <div class="link" role="button" onclick={1}>Workspace</div>
lt: – Atidarykite <div class=link role=button onclick={0}>aplanką</div><br /> – atidarykite <div class=link role=button onclick={1} >Darbo sritis</div>

# StartPage.badWebPanelFormatString
source: <html><body><h1>{0} is not a valid file name</h1></body></html>
lt: <html><body><h1>{0} nėra tinkamas failo pavadinimas</h1></body></html>

# Jupyter.extensionRequired
source: The Jupyter extension is required to perform that task. Click Yes to open the Jupyter extension installation page.
lt: Norint atlikti šią užduotį, reikalingas „Jupyter“ plėtinys. Spustelėkite Taip, kad atidarytumėte „Jupyter“ plėtinio diegimo puslapį.

# Jupyter.extensionNotInstalled
source: This feature is available in the Jupyter extension, which isn't currently installed.
lt: Ši funkcija pasiekiama Jupyter plėtinyje, kuris šiuo metu neįdiegtas.

# TensorBoard.missingSourceFile
source: We could not locate the requested source file on disk. Please manually specify the file.
lt: Nepavyko rasti prašomo šaltinio failo diske. Prašome rankiniu būdu nurodyti failą.

# TensorBoard.selectMissingSourceFile
source: Choose File
lt: Pasirinkti failą

# TensorBoard.selectMissingSourceFileDescription
source: The source file's contents may not match the original contents in the trace.
lt: Šaltinio failo turinys gali neatitikti pradinio pėdsakų turinio.

# TensorBoard.useCurrentWorkingDirectory
source: Use current working directory
lt: Naudokite dabartinį darbo katalogą

# TensorBoard.currentDirectory
source: Current: {0}
lt: Dabartinis: {0}

# TensorBoard.logDirectoryPrompt
source: Select a log directory to start TensorBoard with
lt: Pasirinkite žurnalo katalogą, kuriame norite paleisti „TensorBoard“.

# TensorBoard.progressMessage
source: Starting TensorBoard session...
lt: Pradedama TensorBoard sesija...

# TensorBoard.failedToStartSessionError
source: We failed to start a TensorBoard session due to the following error: {0}
lt: Mums nepavyko pradėti TensorBoard seanso dėl šios klaidos: {0}

# TensorBoard.nativeTensorBoardPrompt
source: VS Code now has integrated TensorBoard support. Would you like to launch TensorBoard? (Tip: Launch TensorBoard anytime by opening the command palette and searching for "Launch TensorBoard".)
lt: VS Code dabar turi integruotą TensorBoard palaikymą. Ar norėtumėte paleisti „TensorBoard“? (Patarimas: bet kuriuo metu paleiskite „TensorBoard“ atidarydami komandų paletę ir ieškodami Launch TensorBoard.)

# TensorBoard.selectAFolder
source: Select a folder
lt: Pasirinkite aplanką

# TensorBoard.selectAnotherFolder
source: Select another folder
lt: Pasirinkite kitą aplanką

# TensorBoard.selectAFolderDetail
source: Select a log directory containing tfevent files
lt: Pasirinkite žurnalo katalogą, kuriame yra tfevent failai

# TensorBoard.selectAnotherFolderDetail
source: Use the file explorer to select another folder
lt: Norėdami pasirinkti kitą aplanką, naudokite failų naršyklę

# TensorBoard.useCurrentWorkingDirectoryDetail
source: TensorBoard will search for tfevent files in all subdirectories of the current working directory
lt: TensorBoard ieškos tfevent failų visuose dabartinio darbo katalogo pakatalogiuose

# TensorBoard.installPrompt
source: The package TensorBoard is required to launch a TensorBoard session. Would you like to install it?
lt: Norint paleisti TensorBoard sesiją, reikalingas paketas TensorBoard. Ar norėtumėte jį įdiegti?

# TensorBoard.installTensorBoardAndProfilerPluginPrompt
source: TensorBoard >= 2.4.1 and the PyTorch Profiler TensorBoard Plugin are required. Would you like to install these packages?
lt: Reikalingas TensorBoard >= 2.4.1 ir PyTorch Profiler TensorBoard įskiepis. Ar norėtumėte įdiegti šiuos paketus?

# TensorBoard.installProfilerPluginPrompt
source: We recommend installing the PyTorch Profiler TensorBoard plugin. Would you like to install the package?
lt: Rekomenduojame įdiegti „PyTorch Profiler TensorBoard“ papildinį. Ar norėtumėte įdiegti paketą?

# TensorBoard.upgradePrompt
source: Integrated TensorBoard support is only available for TensorBoard >= 2.4.1. Would you like to upgrade your copy of TensorBoard?
lt: Integruotas „TensorBoard“ palaikymas galimas tik „TensorBoard“ >= 2.4.1. Ar norėtumėte atnaujinti savo TensorBoard kopiją?

# TensorBoard.launchNativeTensorBoardSessionCodeAction
source: Launch TensorBoard session
lt: Paleiskite TensorBoard sesiją

# TensorBoard.launchNativeTensorBoardSessionCodeLens
source: ▶ Launch TensorBoard Session
lt: ▶ Paleiskite TensorBoard Session

# TensorBoard.enterRemoteUrl
source: Enter remote URL
lt: Įveskite nuotolinį URL

# TensorBoard.enterRemoteUrlDetail
source: Enter a URL pointing to a remote directory containing your TensorBoard log files
lt: Įveskite URL, nukreipiantį į nuotolinį katalogą, kuriame yra jūsų TensorBoard žurnalo failai
