Repository: neda-zal/vscode-language-pack-lt
Catalog: vscode-python1_*.po
Languages: lt

# python.command.python.sortImports.title
source: Sort Imports
lt: Rūšiuoti importą

# python.command.python.startREPL.title
source: Start REPL
lt: Pradėti REPL

# python.command.python.createTerminal.title
source: Create Terminal
lt: Sukurti terminalą

# python.command.python.buildWorkspaceSymbols.title
source: Build Workspace Symbols
lt: Sukurkite darbo srities simbolius

# python.command.python.runtests.title
source: Run All Tests
lt: Vykdykite visus testus

# python.command.python.debugtests.title
source: Debug All Tests
lt: Derinti visus testus

# python.command.python.execInTerminal.title
source: Run Python File in Terminal
lt: Paleiskite Python failą terminale

# python.command.python.setInterpreter.title
source: Select Interpreter
lt: Pasirinkite Vertėjas

# python.command.python.switchOffInsidersChannel.title
source: Switch to Default Channel
lt: Perjunkite į numatytąjį kanalą

# python.command.python.switchToDailyChannel.title
source: Switch to Insiders Daily Channel
lt: Perjunkite į „Insiders Daily“ kanalą

# python.command.python.switchToWeeklyChannel.title
source: Switch to Insiders Weekly Channel
lt: Perjunkite į Insiders Weekly Channel

# python.command.python.clearWorkspaceInterpreter.title
source: Clear Workspace Interpreter Setting
lt: Išvalyti darbo srities vertėjo nustatymą

# python.command.python.refactorExtractVariable.title
source: Extract Variable
lt: Ištraukite kintamąjį

# python.command.python.refactorExtractMethod.title
source: Extract Method
lt: Ištraukimo metodas

# python.command.python.viewOutput.title
source: Show Output
lt: Rodyti išvestį

# python.command.python.viewTestOutput.title
source: Show Test Output
lt: Rodyti bandymo išvestį

# python.command.python.viewLanguageServerOutput.title
source: Show Language Server Output
lt: Rodyti kalbos serverio išvestį

# python.command.python.selectAndRunTestMethod.title
source: Run Test Method ...
lt: Paleisti bandymo metodą...

# python.command.python.selectAndDebugTestMethod.title
source: Debug Test Method ...
lt: Derinimo bandymo metodas...

# python.command.python.selectAndRunTestFile.title
source: Run Test File ...
lt: Paleisti bandomąjį failą...

# python.command.python.runCurrentTestFile.title
source: Run Current Test File
lt: Paleiskite dabartinį bandomąjį failą

# python.command.python.runFailedTests.title
source: Run Failed Tests
lt: Vykdykite nesėkmingus testus

# python.command.python.discoverTests.title
source: Discover Tests
lt: Atraskite testus

# python.command.python.discoveringTests.title
source: Discovering...
lt: Atrandama...

# python.command.python.stopTests.title
source: Stop
lt: Sustabdyti

# python.command.python.configureTests.title
source: Configure Tests
lt: Konfigūruoti testus

# python.command.python.execSelectionInTerminal.title
source: Run Selection/Line in Python Terminal
lt: Vykdykite pasirinkimą / eilutę Python terminale

# python.command.python.execSelectionInDjangoShell.title
source: Run Selection/Line in Django Shell
lt: Vykdykite pasirinkimą / eilutę „Django Shell“.

# python.command.python.goToPythonObject.title
source: Go to Python Object
lt: Eikite į Python Object

# python.command.python.reportIssue.title
source: Report Issue
lt: Pranešti apie problemą

# python.command.python.setLinter.title
source: Select Linter
lt: Pasirinkite Linter

# python.command.python.enableLinting.title
source: Enable/Disable Linting
lt: Įjungti / išjungti lintingumą

# python.command.python.runLinting.title
source: Run Linting
lt: Vykdykite Linting

# python.command.python.enableSourceMapSupport.title
source: Enable Source Map Support For Extension Debugging
lt: Įgalinkite šaltinio žemėlapio palaikymą plėtinio derinimui

# python.command.python.clearPersistentStorage.title
source: Clear Internal Extension Cache
lt: Išvalykite vidinio plėtinio talpyklą

# python.command.python.startPage.open.title
source: Open Start Page
lt: Atidarykite pradžios puslapį

# python.command.python.analysis.clearCache.title
source: Clear Module Analysis Cache
lt: Išvalykite modulio analizės talpyklą

# python.command.python.analysis.restartLanguageServer.title
source: Restart Language Server
lt: Iš naujo paleiskite kalbos serverį

# python.command.python.launchTensorBoard.title
source: Launch TensorBoard
lt: Paleiskite TensorBoard

# python.command.python.refreshTensorBoard.title
source: Refresh TensorBoard
lt: Atnaujinkite TensorBoard

# python.snippet.launch.standard.label
source: Python: Current File
lt: Python: dabartinis failas

# python.snippet.launch.module.label
source: Python: Module
lt: Python: modulis

# python.snippet.launch.module.default
source: enter-your-module-name
lt: įveskite savo modulio pavadinimą

# python.snippet.launch.attach.label
source: Python: Remote Attach
lt: Python: nuotolinis prijungimas

# python.snippet.launch.attachpid.label
source: Python: Attach using Process Id
lt: Python: prijunkite naudodami proceso ID

# python.snippet.launch.flask.label
source: Python: Flask
lt: Python: Kolba

# python.snippet.launch.pyramid.label
source: Python: Pyramid Application
lt: Python: piramidės programa

# Pylance.remindMeLater
source: Remind me later
lt: Primink man vėliau

# Pylance.pylanceNotInstalledMessage
source: Pylance extension is not installed.
lt: Pylance plėtinys neįdiegtas.

# Pylance.pylanceInstalledReloadPromptMessage
source: Pylance extension is now installed. Reload window to activate?
lt: Pylance plėtinys dabar įdiegtas. Iš naujo įkelti langą, kad suaktyvintumėte?

# Pylance.pylanceRevertToJediPrompt
source: The Pylance extension is not installed but the python.languageServer value is set to "Pylance". Would you like to install the Pylance extension to use Pylance, or revert back to Jedi?
lt: Pylance plėtinys neįdiegtas, bet python.languageServer reikšmė nustatyta į Pylance. Ar norėtumėte įdiegti „Pylance“ plėtinį, kad galėtumėte naudoti „Pylance“, ar grįžti prie „Jedi“?

# Pylance.pylanceInstallPylance
source: Install Pylance
lt: Įdiekite Pylance

# Pylance.pylanceRevertToJedi
source: Revert to Jedi
lt: Grįžkite į Jedi

# Experiments.inGroup
source: User belongs to experiment group '{0}'
lt: Naudotojas priklauso eksperimentų grupei „{0}“

# Experiments.optedOutOf
source: User opted out of experiment group '{0}'
lt: Naudotojas atsisakė eksperimento grupės „{0}“

# Interpreters.RefreshingInterpreters
source: Refreshing Python Interpreters
lt: Atnaujinantys Python vertėjai

# Interpreters.entireWorkspace
source: Entire workspace
lt: Visa darbo vieta

# Interpreters.pythonInterpreterPath
source: Python interpreter path: {0}
lt: Python interpretatoriaus kelias: {0}

# Interpreters.LoadingInterpreters
source: Loading Python Interpreters
lt: Įkeliami Python interpretatoriai

# Interpreters.condaInheritEnvMessage
source: We noticed you're using a conda environment. If you are experiencing issues with this environment in the integrated terminal, we recommend that you let the Python extension change "terminal.integrated.inheritEnv" to false in your user settings.
lt: Pastebėjome, kad naudojate Conda aplinką. Jei kyla problemų dėl šios aplinkos integruotame terminale, rekomenduojame vartotojo nustatymuose leisti Python plėtiniui pakeisti erminal.integrated.inheritEnv į false.

# InterpreterQuickPickList.quickPickListPlaceholder
source: Current: {0}
lt: Dabartinis: {0}

# InterpreterQuickPickList.enterPath.detail
source: Enter path or find an existing interpreter
lt: Įveskite kelią arba suraskite esamą vertėją

# InterpreterQuickPickList.enterPath.label
source: Enter interpreter path...
lt: Įveskite vertėjo kelią...

# InterpreterQuickPickList.enterPath.placeholder
source: Enter path to a Python interpreter.
lt: Įveskite kelią į Python interpretatorių.

# InterpreterQuickPickList.findPath.detail
source: Browse the file system to find a Python interpreter.
lt: Naršykite failų sistemoje, kad surastumėte Python interpretatorių.

# InterpreterQuickPickList.findPath.label
source: I can't find the interpreter I want to select...
lt: Nerandu vertėjo, kurį noriu pasirinkti...

# InterpreterQuickPickList.refreshInterpreterList
source: Refresh Interpreter list
lt: Atnaujinti vertėjų sąrašą

# InterpreterQuickPickList.browsePath.label
source: Find...
lt: Rasti...

# InterpreterQuickPickList.browsePath.detail
source: Browse your file system to find a Python interpreter.
lt: Naršykite savo failų sistemą, kad rastumėte Python interpretatorių.

# InterpreterQuickPickList.browsePath.title
source: Select Python interpreter
lt: Pasirinkite Python interpreterį

# InterpreterQuickPickList.defaultInterpreterPath.label
source: Use default Python interpreter path
lt: Naudokite numatytąjį Python interpretatoriaus kelią

# diagnostics.upgradeCodeRunner
source: Please update the Code Runner extension for it to be compatible with the Python extension.
lt: Atnaujinkite Code Runner plėtinį, kad jis būtų suderinamas su Python plėtiniu.

# Common.bannerLabelYes
source: Yes
lt: Taip

# Common.bannerLabelNo
source: No
lt: Nr

# Common.doNotShowAgain
source: Do not show again
lt: Daugiau neberodyti

# Common.reload
source: Reload
lt: Įkelti iš naujo

# Common.moreInfo
source: More Info
lt: Daugiau informacijos

# Common.and
source: and
lt: ir

# Common.ok
source: Ok
lt: Gerai

# Common.install
source: Install
lt: Diegti

# Common.learnMore
source: Learn more
lt: Sužinokite daugiau

# Common.reportThisIssue
source: Report this issue
lt: Praneškite apie šią problemą

# CommonSurvey.remindMeLaterLabel
source: Remind me later
lt: Primink man vėliau

# CommonSurvey.yesLabel
source: Yes, take survey now
lt: Taip, dabar atlikite apklausą

# CommonSurvey.noLabel
source: No, thanks
lt: Ne, ačiū

# OutputChannelNames.languageServer
source: Python Language Server
lt: Python kalbos serveris

# OutputChannelNames.pythonTest
source: Python Test Log
lt: Python testų žurnalas

# ExtensionSurveyBanner.bannerMessage
source: Can you please take 2 minutes to tell us how the Python extension is working for you?
lt: Ar galite skirti 2 minutes ir papasakoti, kaip jums veikia Python plėtinys?

# ExtensionSurveyBanner.bannerLabelYes
source: Yes, take survey now
lt: Taip, dabar atlikite apklausą

# ExtensionSurveyBanner.bannerLabelNo
source: No, thanks
lt: Ne, ačiū

# ExtensionSurveyBanner.maybeLater
source: Maybe later
lt: Galbūt vėliau

# ExtensionSurveyBanner.mplsMessage
source: Can you please take 2 minutes to tell us about your experience using the Microsoft Python Language Server?
lt: Ar galėtumėte skirti 2 minutes ir papasakoti apie savo patirtį naudojant „Microsoft Python“ kalbos serverį?

# ExtensionChannels.installingInsidersMessage
source: Installing Insiders...
lt: Diegiama Insiders...

# ExtensionChannels.installingStableMessage
source: Installing Stable...
lt: Diegiama stabili...

# ExtensionChannels.installationCompleteMessage
source: complete.
lt: užbaigti.

# ExtensionChannels.downloadingInsidersMessage
source: Downloading Insiders Extension...
lt: Atsisiunčiamas Insiders plėtinys...

# ExtensionChannels.yesWeekly
source: Yes, weekly
lt: Taip, kas savaitę

# ExtensionChannels.yesDaily
source: Yes, daily
lt: Taip, kasdien

# ExtensionChannels.promptMessage
source: We noticed you are using Visual Studio Code Insiders. Would you like to use the Insiders build of the Python extension?
lt: Pastebėjome, kad naudojate „Visual Studio Code Insiders“. Ar norėtumėte naudoti „Python“ plėtinio „Insiders“ versiją?

# ExtensionChannels.reloadToUseInsidersMessage
source: Please reload Visual Studio Code to use the insiders build of the Python extension.
lt: Iš naujo įkelkite „Visual Studio“ kodą, kad galėtumėte naudoti „Python“ plėtinio vidinę versiją.

# ExtensionChannels.downloadCompletedOutputMessage
source: Insiders build download complete.
lt: „Insiders“ versijos atsisiuntimas baigtas.

# ExtensionChannels.startingDownloadOutputMessage
source: Starting download for Insiders build.
lt: Pradedamas „Insiders“ versijos atsisiuntimas.

# Interpreters.environmentPromptMessage
source: We noticed a new virtual environment has been created. Do you want to select it for the workspace folder?
lt: Pastebėjome, kad sukurta nauja virtuali aplinka. Ar norite jį pasirinkti darbo srities aplankui?

# Linter.enableLinter
source: Enable {0}
lt: Įgalinti {0}

# Linter.enablePylint
source: You have a pylintrc file in your workspace. Do you want to enable pylint?
lt: Darbo srityje turite pylintrc failą. Ar norite įgalinti pylintą?

# Linter.replaceWithSelectedLinter
source: Multiple linters are enabled in settings. Replace with '{0}'?
lt: Nustatymuose įjungti keli linteriai. Pakeisti į „{0}“?

# Linter.install
source: Install a linter to get error reporting.
lt: Įdiekite liniją, kad gautumėte pranešimų apie klaidas.

# Linter.installPylint
source: Install pylint
lt: Įdiekite pylintą

# Linter.installFlake8
source: Install flake8
lt: Įdiekite flake8

# Linter.selectLinter
source: Select Linter
lt: Pasirinkite Linter

# Installer.noCondaOrPipInstaller
source: There is no Conda or Pip installer available in the selected environment.
lt: Pasirinktoje aplinkoje nėra Conda ar Pip diegimo programos.

# Installer.noPipInstaller
source: There is no Pip installer available in the selected environment.
lt: Pasirinktoje aplinkoje nėra Pip diegimo programos.

# Installer.searchForHelp
source: Search for help
lt: Ieškokite pagalbos

# Installer.couldNotInstallLibrary
source: Could not install {0}. If pip is not available, please use the package manager of your choice to manually install this library into your Python environment.
lt: Nepavyko įdiegti {0}. Jei pip nepasiekiamas, naudokite pasirinktą paketų tvarkyklę, kad rankiniu būdu įdiegtumėte šią biblioteką savo Python aplinkoje.

# Installer.dataScienceInstallPrompt
source: Data Science library {0} is not installed. Install?
lt: Data Science biblioteka {0} neįdiegta. Diegti?

# diagnostics.removedPythonPathFromSettings
source: The "python.pythonPath" setting in your settings.json is no longer used by the Python extension. If you want, you can use a new setting called "python.defaultInterpreterPath" instead. Keep in mind that you need to change the value of this setting manually as the Python extension doesn’t modify it when you change interpreters. [Learn more](https://aka.ms/AA7jfor).
lt: python.pythonPath parametro jūsų settings.json nebenaudoja Python plėtinys. Jei norite, galite naudoti naują nustatymą python.defaultInterpreterPath. Atminkite, kad šio nustatymo reikšmę turite pakeisti rankiniu būdu, nes „Python“ plėtinys jo nekeičia, kai keičiate vertėjus. [Sužinokite daugiau](https://aka.ms/AA7jfor).

# diagnostics.warnSourceMaps
source: Source map support is enabled in the Python Extension, this will adversely impact performance of the extension.
lt: Šaltinio žemėlapio palaikymas įgalintas Python plėtinyje, todėl tai neigiamai paveiks plėtinio veikimą.

# diagnostics.disableSourceMaps
source: Disable Source Map Support
lt: Išjungti šaltinio žemėlapio palaikymą

# diagnostics.warnBeforeEnablingSourceMaps
source: Enabling source map support in the Python Extension will adversely impact performance of the extension.
lt: Įjungus šaltinio žemėlapio palaikymą „Python“ plėtinyje, pablogės plėtinio veikimas.

# diagnostics.enableSourceMapsAndReloadVSC
source: Enable and reload Window
lt: Įjungti ir iš naujo įkelti langą

# diagnostics.lsNotSupported
source: Your operating system does not meet the minimum requirements of the Python Language Server. Reverting to the alternative autocompletion provider, Jedi.
lt: Jūsų operacinė sistema neatitinka minimalių Python kalbos serverio reikalavimų. Grįžtama prie alternatyvaus automatinio užbaigimo teikėjo „Jedi“.

# diagnostics.invalidPythonPathInDebuggerSettings
source: You need to select a Python interpreter before you start debugging.
lt: Prieš pradėdami derinti, turite pasirinkti Python interpretatorių.

# diagnostics.invalidPythonPathInDebuggerLaunch
source: The Python path in your debug configuration is invalid.
lt: „Python“ kelias jūsų derinimo konfigūracijoje yra netinkamas.

# diagnostics.invalidDebuggerTypeDiagnostic
source: Your launch.json file needs to be updated to change the "pythonExperimental" debug configurations to use the "python" debugger type, otherwise Python debugging may not work. Would you like to automatically update your launch.json file now?
lt: Failą launch.json reikia atnaujinti, kad būtų pakeistos pythonExperimental derinimo konfigūracijos ir būtų naudojamas python derinimo tipas, kitaip Python derinimas gali neveikti. Ar norėtumėte automatiškai atnaujinti failą launch.json dabar?

# diagnostics.consoleTypeDiagnostic
source: Your launch.json file needs to be updated to change the console type string from "none" to "internalConsole", otherwise Python debugging may not work. Would you like to automatically update your launch.json file now?
lt: Failą launch.json reikia atnaujinti, kad konsolės tipo eilutė būtų pakeista iš one į internalConsole, kitaip Python derinimas gali neveikti. Ar norėtumėte automatiškai atnaujinti failą launch.json dabar?

# diagnostics.justMyCodeDiagnostic
source: Configuration "debugStdLib" in launch.json is no longer supported. It's recommended to replace it with "justMyCode", which is the exact opposite of using "debugStdLib". Would you like to automatically update your launch.json file to do that?
lt: Konfigūracija debugStdLib faile launch.json nebepalaikoma. Rekomenduojama jį pakeisti justMyCode, kuris yra visiškai priešingas debugStdLib naudojimui. Ar norite automatiškai atnaujinti failą launch.json, kad tai padarytumėte?

# diagnostics.checkIsort5UpgradeGuide
source: We found outdated configuration for sorting imports in this workspace. Check the [isort upgrade guide](https://aka.ms/AA9j5x4) to update your settings.
lt: Aptikome pasenusią importo rūšiavimo konfigūraciją šioje darbo srityje. Norėdami atnaujinti nustatymus, žr. [isort atnaujinimo vadovą] (https://aka.ms/AA9j5x4).

# diagnostics.yesUpdateLaunch
source: Yes, update launch.json
lt: Taip, atnaujinkite launch.json

# diagnostics.invalidTestSettings
source: Your settings needs to be updated to change the setting "python.unitTest." to "python.testing.", otherwise testing Python code using the extension may not work. Would you like to automatically update your settings now?
lt: Nustatymus reikia atnaujinti, kad parametras python.unitTest. būtų pakeistas į python.testing., kitaip Python kodo testavimas naudojant plėtinį gali nepavykti. Ar norėtumėte automatiškai atnaujinti nustatymus dabar?

# diagnostics.pylanceDefaultMessage
source: The Python extension now includes Pylance to improve completions, code navigation, overall performance and much more! You can learn more about the update and learn how to change your language server [here](https://aka.ms/new-python-bundle).
lt: „Python“ plėtinys dabar apima „Pylance“, kad pagerintų užbaigimus, kodo naršymą, bendrą našumą ir dar daugiau! Galite sužinoti daugiau apie naujinį ir sužinoti, kaip pakeisti kalbos serverį [čia](https://aka.ms/new-python-bundle).

# Common.canceled
source: Canceled
lt: Atšauktas

# Common.cancel
source: Cancel
lt: Atšaukti

# Common.yesPlease
source: Yes, please
lt: Taip prašau

# Common.loadingPythonExtension
source: Python extension loading...
lt: Python plėtinys įkeliamas...

# debug.selectConfigurationTitle
source: Select a debug configuration
lt: Pasirinkite derinimo konfigūraciją

# debug.selectConfigurationPlaceholder
source: Debug Configuration
lt: Derinimo konfigūracija

# debug.launchJsonConfigurationsCompletionDescription
source: Select a Python debug configuration
lt: Pasirinkite Python derinimo konfigūraciją

# debug.debugFileConfigurationLabel
source: Python File
lt: Python failas

# debug.debugFileConfigurationDescription
source: Debug the currently active Python file
lt: Suderinkite šiuo metu aktyvų Python failą

# debug.debugModuleConfigurationLabel
source: Module
lt: Modulis

# debug.debugModuleConfigurationDescription
source: Debug a Python module by invoking it with '-m'
lt: Suderinkite Python modulį iškviesdami jį naudodami „-m“

# debug.moduleEnterModuleTitle
source: Debug Module
lt: Derinimo modulis

# debug.moduleEnterModulePrompt
source: Enter a Python module/package name
lt: Įveskite Python modulio / paketo pavadinimą

# debug.moduleEnterModuleDefault
source: enter-your-module-name
lt: įveskite savo modulio pavadinimą

# debug.moduleEnterModuleInvalidNameError
source: Enter a valid module name
lt: Įveskite tinkamą modulio pavadinimą

# debug.remoteAttachConfigurationLabel
source: Remote Attach
lt: Nuotolinis prijungimas

# debug.remoteAttachConfigurationDescription
source: Attach to a remote debug server
lt: Prijunkite prie nuotolinio derinimo serverio

# debug.attachRemoteHostTitle
source: Remote Debugging
lt: Nuotolinis derinimas

# debug.attachRemoteHostPrompt
source: Enter the host name
lt: Įveskite pagrindinio kompiuterio pavadinimą

# debug.attachRemoteHostValidationError
source: Enter a valid host name or IP address
lt: Įveskite galiojantį pagrindinio kompiuterio pavadinimą arba IP adresą

# debug.attachRemotePortTitle
source: Remote Debugging
lt: Nuotolinis derinimas

# debug.attachRemotePortPrompt
source: Enter the port number that the debug server is listening on
lt: Įveskite prievado numerį, kurio klausosi derinimo serveris

# debug.attachRemotePortValidationError
source: Enter a valid port number
lt: Įveskite galiojantį prievado numerį

# debug.attachPidConfigurationLabel
source: Attach using Process ID
lt: Pridėkite naudodami proceso ID

# debug.attachPidConfigurationDescription
source: Attach to a local process
lt: Prijunkite prie vietinio proceso

# debug.debugDjangoConfigurationDescription
source: Launch and debug a Django web application
lt: Paleiskite ir derinkite „Django“ žiniatinklio programą

# debug.djangoEnterManagePyPathPrompt
source: Enter the path to manage.py ('${workspaceFolderToken}' points to the root of the current workspace folder)
lt: Įveskite kelią į manage.py („${workspaceFolderToken}“ nukreipia į dabartinės darbo srities aplanko šaknį)

# debug.djangoEnterManagePyPathInvalidFilePathError
source: Enter a valid Python file path
lt: Įveskite tinkamą Python failo kelią

# debug.debugFastAPIConfigurationDescription
source: Launch and debug a FastAPI web application
lt: Paleiskite ir derinkite FastAPI žiniatinklio programą

# debug.fastapiEnterAppPathOrNamePathPrompt
source: Enter the path to the application, e.g. 'main.py' or 'main'
lt: Įveskite programos kelią, pvz. „main.py“ arba „main“

# debug.fastapiEnterAppPathOrNamePathInvalidNameError
source: Enter a valid name
lt: Įveskite tinkamą vardą

# debug.debugFlaskConfigurationLabel
source: Flask
lt: Kolba

# debug.debugFlaskConfigurationDescription
source: Launch and debug a Flask web application
lt: Paleiskite ir derinkite „Flask“ žiniatinklio programą

# debug.flaskEnterAppPathOrNamePathTitle
source: Debug Flask
lt: Derinimo kolba

# debug.flaskEnterAppPathOrNamePathPrompt
source: Enter the path to the application, e.g. 'app.py' or 'app'
lt: Įveskite programos kelią, pvz. „app.py“ arba „programa“

# debug.flaskEnterAppPathOrNamePathInvalidNameError
source: Enter a valid name
lt: Įveskite tinkamą vardą

# debug.debugPyramidConfigurationLabel
source: Pyramid
lt: Piramidė

# debug.debugPyramidConfigurationDescription
source: Launch and debug a Pyramid web application
lt: Paleiskite ir derinkite piramidės žiniatinklio programą

# debug.pyramidEnterDevelopmentIniPathTitle
source: Debug Pyramid
lt: Derinimo piramidė

# debug.pyramidEnterDevelopmentIniPathPrompt
source: `Enter the path to development.ini ('${workspaceFolderToken}' points to the root of the current workspace folder)`
lt: `Įveskite kelią į development.ini ('${workspaceFolderToken}' nurodo dabartinio darbo srities aplanko šaknį)'

# debug.pyramidEnterDevelopmentIniPathInvalidFilePathError
source: Enter a valid file path
lt: Įveskite tinkamą failo kelią
