Repository: neda-zal/vscode-language-pack-lt
Catalog: vscode-python.po
Languages: lt_lt

# debug.pyramidEnterDevelopmentIniPathPrompt
source: `Enter the path to development.ini ('${workspaceFolderToken}' points to the root of the current workspace folder)`
lt_lt: `Įveskite kelią iki development.ini ("${workspaceFolderToken}" nurodo dabartinės darbo vietos aplanko šaknį)`

# debug.pyramidEnterDevelopmentIniPathInvalidFilePathError
source: Enter a valid file path
lt_lt: Įveskite galiojantį failo kelią

# Testing.testErrorDiagnosticMessage
source: Error
lt_lt: Klaida

# Testing.testFailDiagnosticMessage
source: Fail
lt_lt: Nepavyko

# Testing.testSkippedDiagnosticMessage
source: Skipped
lt_lt: Praleista

# Testing.configureTests
source: Configure Test Framework
lt_lt: Konfigūruoti testavimo sistemą

# Testing.disableTests
source: Disable Tests
lt_lt: Išjungti testus

# Common.openOutputPanel
source: Show output
lt_lt: Rodyti išvestį

# LanguageService.lsFailedToStart
source: We encountered an issue starting the language server. Reverting to Jedi language engine. Check the Python output panel for details.
lt_lt: Susidūrėme su problema paleidžiant kalbos serverį. Grįžtama prie Jedi kalbos variklio. Išsamesnės informacijos ieškokite Python išvesties skydelyje.

# LanguageService.lsFailedToDownload
source: We encountered an issue downloading the language server. Reverting to Jedi language engine. Check the Python output panel for details.
lt_lt: Susidūrėme su kalbos serverio atsisiuntimo problema. Grįžtama prie Jedi kalbos variklio. Išsamesnės informacijos ieškokite Python išvesties skydelyje.

# LanguageService.lsFailedToExtract
source: We encountered an issue extracting the language server. Reverting to Jedi language engine. Check the Python output panel for details.
lt_lt: Susidūrėme su kalbos serverio išgavimo problema. Grįžtama prie Jedi kalbos variklio. Išsamesnės informacijos ieškokite Python išvesties skydelyje.

# LanguageService.downloadFailedOutputMessage
source: Language server download failed
lt_lt: Kalbos serverio atsisiuntimas nepavyko

# LanguageService.extractionFailedOutputMessage
source: Language server extraction failed
lt_lt: Kalbos serverio išskyrimas nepavyko

# LanguageService.extractionCompletedOutputMessage
source: Language server download complete
lt_lt: Kalbos serverio atsisiuntimas baigtas

# LanguageService.extractionDoneOutputMessage
source: done
lt_lt: atlikta

# LanguageService.reloadVSCodeIfSeachPathHasChanged
source: Search paths have changed for this Python interpreter. Please reload the extension to ensure that the IntelliSense works correctly
lt_lt: Pasikeitė šio Python interpretatoriaus paieškos keliai. Paleiskite plėtinį iš naujo, kad įsitikintumėte, jog IntelliSense veikia teisingai

# LanguageService.startingJedi
source: Starting Jedi Python language engine.
lt_lt: Paleidžiamas Jedi Python kalbos variklis.

# LanguageService.startingMicrosoft
source: Starting Microsoft Python language server.
lt_lt: Paleidžiamas "Microsoft Python" kalbos serveris.

# LanguageService.startingPylance
source: Starting Pylance language server.
lt_lt: Paleidžiamas Pylance kalbos serveris.

# LanguageService.startingJediLSP
source: Starting Jedi language server.
lt_lt: Paleidžiamas Jedi kalbos serveris.

# LanguageService.startingNone
source: Editor support is inactive since language server is set to None.
lt_lt: Redaktoriaus palaikymas neaktyvus, nes kalbos serveris nustatytas į None (nėra).

# LanguageService.reloadAfterLanguageServerChange
source: Please reload the window switching between language servers.
lt_lt: Paleiskite langą iš naujo perjungdami kalbos serverius.

# AttachProcess.unsupportedOS
source: Operating system '{0}' not supported.
lt_lt: Operacinė sistema "{0}" nepalaikoma.

# AttachProcess.attachTitle
source: Attach to process
lt_lt: Prisijungti prie proceso

# AttachProcess.selectProcessPlaceholder
source: Select the process to attach to
lt_lt: Pasirinkite procesą, prie kurio norite prisijungti

# AttachProcess.noProcessSelected
source: No process selected
lt_lt: Procesas nepasirinktas

# AttachProcess.refreshList
source: Refresh process list
lt_lt: Atnaujinti procesų sąrašą

# diagnostics.updateSettings
source: Yes, update settings
lt_lt: Taip, atnaujinkite nustatymus

# Common.noIWillDoItLater
source: No, I will do it later
lt_lt: Ne, tai padarysiu vėliau

# Common.notNow
source: Not now
lt_lt: Ne dabar

# Common.gotIt
source: Got it!
lt_lt: Supratau!

# Interpreters.selectInterpreterTip
source: Tip: you can change the Python interpreter used by the Python extension by clicking on the Python version in the status bar
lt_lt: Patarimas: Python plėtinio naudojamą Python interpretatorių galite pakeisti spustelėję būsenos juostoje esančią "Python" versiją

# downloading.file
source: Downloading {0}...
lt_lt: Atsiunčiama {0}...

# downloading.file.progress
source: {0}{1} of {2} KB ({3}%)
lt_lt: {0}{1} iš {2} KB ({3}%)

# products.installingModule
source: Installing {0}
lt_lt: Diegiama {0}

# OutdatedDebugger.updateDebuggerMessage
source: We noticed you are attaching to ptvsd (Python debugger), which was deprecated on May 1st, 2020. Please switch to [debugpy](https://aka.ms/migrateToDebugpy).
lt_lt: Pastebėjome, kad prisijungėte prie ptvsd (Python derintuvės), kuriai palaikymas buvo nutrauktas 2020 m. gegužės 1 d. Prašome pereiti prie [debugpy](https://aka.ms/migrateToDebugpy).

# StartPage.getStarted
source: Python - Get Started
lt_lt: Python – Pradžia

# StartPage.pythonExtensionTitle
source: Python Extension
lt_lt: Python plėtinys

# StartPage.createJupyterNotebook
source: Create a Jupyter Notebook
lt_lt: Sukurti Jupyter sąsiuvinį

# StartPage.notebookDescription
source: - Run "<div class="link italics" role="button" onclick={0}>Create New Blank Notebook</div>" in the Command Palette (<div class="italics">Shift + Command + P</div>)<br />- Explore our <div class="link" role="button" onclick={1}>sample notebook</div> to learn about notebook features
lt_lt: - Vykdykite „<div class="link italics" role="button" onclick={0}>Sukurti naują tuščią sąsiuvinį</div>“ komandų paletėje (<div class="italics">Shift + Command + P</div>)<br />- Išbandykite mūsų <div class="link" role="button" onclick={1}>pavyzdinį sąsiuvinį</div> ir sužinokite apie užrašų knygučių savybes

# StartPage.createAPythonFile
source: Create a Python File
lt_lt: Sukurti Python failą

# StartPage.pythonFileDescription
source: - Create a <div class="link" role="button" onclick={0}>new file</div> with a .py extension
lt_lt: - Sukurti <div class="link" role="button" onclick={0}>naują failą</div> su .py plėtiniu

# StartPage.openInteractiveWindow
source: Use the Interactive Window to develop Python Scripts
lt_lt: Naudokite interaktyvųjį langą Python scenarijams kurti

# StartPage.interactiveWindowDesc
source: - You can create cells on a Python file by typing "#%%". Make sure you have the Jupyter extension installed. <br /> - Use "<div class="italics">Shift + Enter</div> " to run a cell, the output will be shown in the interactive window
lt_lt: - Galite sukurti Python failo langelius įvesdami „#%%“. Įsitikinkite, kad turite įdiegtą Jupyter plėtinį. <br /> - Naudokite <div class="italics">"Shift + Enter</div> norėdami vykdyti ląstelę, išvestis bus rodoma interaktyviajame lange

# StartPage.releaseNotes
source: Take a look at our <a class="link" href={0}>Release Notes</a> to learn more about the latest features.
lt_lt: Peržiūrėkite mūsų <a class="link" href={0}>Laidos pastabas</a> tam, kad sužinotumėte daugiau apie naujausias funkcijas.

# StartPage.mailingList
source: <a class="link" href={0}>Sign up</a> for tips and tutorials through our mailing list.
lt_lt: <a class="link" href={0}>Užsiregistruokite</a> į mūsų pašto grupę jei norite gauti patarimų ir pamokų.

# StartPage.tutorialAndDoc
source: Explore more features in our <a class="link" href={0}>Tutorials</a> or check <a class="link" href={1}>Documentation</a> for tips and troubleshooting.
lt_lt: Išmokite daugiau funkcijų mūsų <a class="link" href={0}>Pamokose</a> arba apsilankytite <a class="link" href={1}>Dokumentacijoje</a>, kur rasite patarimų ir trikčių šalinimo būdų.

# StartPage.dontShowAgain
source: Don't show this page again
lt_lt: Daugiau nerodyti šio puslapio

# StartPage.helloWorld
source: Hello world
lt_lt: Sveikas pasauli

# StartPage.sampleNotebook
source: Notebooks intro
lt_lt: Sąsiuvinių įvadas

# StartPage.openFolder
source: Open a Folder or Workspace
lt_lt: Kurti aplanką arba darbo erdvę

# StartPage.folderDesc
source: - Open a <div class="link" role="button" onclick={0}>Folder</div><br /> - Open a <div class="link" role="button" onclick={1}>Workspace</div>
lt_lt: - Atverti <div class="link" role="button" onclick={0}>aplanką</div><br /> - Atverti <div class="link" role="button" onclick={1}>darbo aplinką</div>

# StartPage.badWebPanelFormatString
source: <html><body><h1>{0} is not a valid file name</h1></body></html>
lt_lt: <html><body><h1>{0} nėra validus failo vardas</h1></body></html>

# Jupyter.extensionRequired
source: The Jupyter extension is required to perform that task. Click Yes to open the Jupyter extension installation page.
lt_lt: Šiai užduočiai atlikti reikalingas Jupyter plėtinys. Spustelėkite Taip norėdami atidaryti Jupyter plėtinio diegimo puslapį.

# Jupyter.extensionNotInstalled
source: This feature is available in the Jupyter extension, which isn't currently installed.
lt_lt: Šiai funkcijai yra reikalingas Jupyter plėtinys, kuris šiuo metu nėra įdiegtas.

# TensorBoard.missingSourceFile
source: We could not locate the requested source file on disk. Please manually specify the file.
lt_lt: Nepavyko rasti prašomo šaltinio failo diske. Prašome nurodyti failą rankiniu būdu.

# TensorBoard.selectMissingSourceFile
source: Choose File
lt_lt: Pasirinkite failą

# TensorBoard.useCurrentWorkingDirectory
source: Use current working directory
lt_lt: Naudoti dabartinį darbinį katalogą

# TensorBoard.currentDirectory
source: Current: {0}
lt_lt: Dabartinis: {0}

# TensorBoard.logDirectoryPrompt
source: Select a log directory to start TensorBoard with
lt_lt: Pasirinkite žurnalo katalogą su kuriuo norėtume paleisti TensorBoard

# TensorBoard.progressMessage
source: Starting TensorBoard session...
lt_lt: Pradedama TensorBoard sesija...

# TensorBoard.failedToStartSessionError
source: We failed to start a TensorBoard session due to the following error: {0}
lt_lt: Nepavyko paleisti TensorBoard sesijos dėl šios klaidos: {0}

# TensorBoard.nativeTensorBoardPrompt
source: VS Code now has integrated TensorBoard support. Would you like to launch TensorBoard? (Tip: Launch TensorBoard anytime by opening the command palette and searching for "Launch TensorBoard".)
lt_lt: "VS Code" dabar turi integruotą TensorBoard palaikymą. Ar norėtumėte paleisti TensorBoard? (Patarimas: bet kada paleiskite TensorBoard atidarydami komandų paletę ir ieškodami „Paleisti TensorBoard“.)

# TensorBoard.selectAFolder
source: Select a folder
lt_lt: Parinkti aplanką

# TensorBoard.selectAnotherFolder
source: Select another folder
lt_lt: Pasirinkite kitą aplanką

# TensorBoard.selectAFolderDetail
source: Select a log directory containing tfevent files
lt_lt: Pasirinkite žurnalų katalogą, kuriame yra tfevent failai

# TensorBoard.selectAnotherFolderDetail
source: Use the file explorer to select another folder
lt_lt: Naudodamiesi failų naršykle pasirinkite kitą aplanką

# TensorBoard.useCurrentWorkingDirectoryDetail
source: TensorBoard will search for tfevent files in all subdirectories of the current working directory
lt_lt: TensorBoard ieškos tfevent failų visuose dabartinio darbinio katalogo pakatalogiuose

# TensorBoard.installPrompt
source: The package TensorBoard is required to launch a TensorBoard session. Would you like to install it?
lt_lt: Norint paleisti TensorBoard sesiją, reikia paketo TensorBoard. Ar norėtumėte jį įdiegti?

# TensorBoard.installTensorBoardAndProfilerPluginPrompt
source: TensorBoard >= 2.4.1 and the PyTorch Profiler TensorBoard Plugin are required. Would you like to install these packages?
lt_lt: Reikalingas TensorBoard >= 2.4.1 ir PyTorch Profiler TensorBoard įskiepis. Ar norite įdiegti šiuos paketus?

# TensorBoard.installProfilerPluginPrompt
source: We recommend installing the PyTorch Profiler TensorBoard plugin. Would you like to install the package?
lt_lt: Rekomenduojame įdiegti PyTorch Profiler TensorBoard įskiepį. Ar norite įdiegti paketą?

# TensorBoard.upgradePrompt
source: Integrated TensorBoard support is only available for TensorBoard >= 2.4.1. Would you like to upgrade your copy of TensorBoard?
lt_lt: Integruotas TensorBoard palaikymas galimas tik TensorBoard >= 2.4.1. Ar norėtumėte atnaujinti savo TensorBoard kopiją?

# TensorBoard.launchNativeTensorBoardSessionCodeAction
source: Launch TensorBoard session
lt_lt: Paleisti TensorBoard sesiją

# TensorBoard.launchNativeTensorBoardSessionCodeLens
source: ▶ Launch TensorBoard Session
lt_lt: ▶ Paleisti TensorBoard sesiją

# TensorBoard.enterRemoteUrl
source: Enter remote URL
lt_lt: Įveskite nuotolinį URL adresą

# TensorBoard.enterRemoteUrlDetail
source: Enter a URL pointing to a remote directory containing your TensorBoard log files
lt_lt: Įveskite URL adresą, nukreipiantį į nuotolinį katalogą, kuriame yra jūsų TensorBoard žurnalo failai
