Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-workbench/vs_workbench_contrib_files.xlf
Languages: lt_lt

# binaryFileEditor
source: Binary File Viewer
lt_lt: Dvejetainių failų žiūryklė

source: Create File
lt_lt: Sukurti failą

# openFolderError
source: File is a directory
lt_lt: Failas yra katalogas

source: Text File Editor
lt_lt: Tekstinių failų redaktorius

# compareChanges
source: Compare
lt_lt: Palyginti

source: Configure
lt_lt: Konfigūruoti

source: Discard
lt_lt: Atmesti

source: Don't Show Again
lt_lt: Daugiau nerodyti

# genericSaveError
source: Failed to save '{0}': {1}
lt_lt: Nepavyko išsaugoti '{0}': {1}

source: Learn More
lt_lt: Sužinoti daugiau

source: Overwrite
lt_lt: Perrašyti

# overwriteElevated
source: Overwrite as Admin...
lt_lt: Perrašyti kaip administratorius...

# overwriteElevatedSudo
source: Overwrite as Sudo...
lt_lt: Perrašyti kaip Sudo...

# permissionDeniedSaveError
source: Failed to save '{0}': Insufficient permissions. Select 'Retry as Admin' to retry as administrator.
lt_lt: Nepavyko išsaugoti '{0}': Nepakankami leidimai. Pasirinkite „Bandyti kaip administratorius“, kad bandytumėte iš naujo kaip administratorius.

# permissionDeniedSaveErrorSudo
source: Failed to save '{0}': Insufficient permissions. Select 'Retry as Sudo' to retry as superuser.
lt_lt: Nepavyko išsaugoti '{0}': Nepakankami leidimai. Pasirinkite „Pakartoti kaip Sudo“, kad bandytumėte iš naujo kaip administratorius.

# readonlySaveError
source: Failed to save '{0}': File is read-only. Select 'Overwrite' to attempt to make it writeable.
lt_lt: Nepavyko išsaugoti '{0}': Failas skirtas tik skaitymui. Pasirinkite "Perrašyti", kad būtų bandoma jį įrašyti.

# readonlySaveErrorAdmin
source: Failed to save '{0}': File is read-only. Select 'Overwrite as Admin' to retry as administrator.
lt_lt: Nepavyko išsaugoti '{0}': Failas skirtas tik skaitymui. Pasirinkite "Perrašyti kaip administratorius", kad pakartotinai bandytumėte įrašyti kaip administratorius.

# readonlySaveErrorSudo
source: Failed to save '{0}': File is read-only. Select 'Overwrite as Sudo' to retry as superuser.
lt_lt: Nepavyko išsaugoti '{0}': Failas skirtas tik skaitymui. Pasirinkite "Perrašyti kaip Sudo", kad pakartotinai bandytumėte įrašyti kaip administratorius.

source: Retry
lt_lt: Bandyti vėl

# saveConflictDiffLabel
source: {0} (in file) ↔ {1} (in {2}) - Resolve save conflict
lt_lt: {0} (byloje) ↔ {1} (in {2}) - Išspręsti išsaugojimo konfliktą

# saveElevated
source: Retry as Admin...
lt_lt: Bandyti kaip administratorius...

# saveElevatedSudo
source: Retry as Sudo...
lt_lt: Bandyti kaip Sudo...

# staleSaveError
source: Failed to save '{0}': The content of the file is newer. Please compare your version with the file contents or overwrite the content of the file with your changes.
lt_lt: Nepavyko išsaugoti '{0}': Failo turinys yra naujesnis. Palyginkite savo versiją su dabartiniu failo turiniu arba perrašykite failo turinį savo pakeitimais.

# userGuide
source: Use the actions in the editor tool bar to either undo your changes or overwrite the content of the file with your changes.
lt_lt: Redaktoriaus įrankių juostoje esančiais veiksmais atšaukite pakeitimus arba perrašykite failo turinį savo pakeitimais.

# explore
source: Explorer
lt_lt: Naršyklė

# explorerViewIcon
source: View icon of the explorer view.
lt_lt: Naršyklės rodinio piktograma.

source: Folders
lt_lt: Aplankai

# miViewExplorer
source: &&Explorer
lt_lt: &&Naršyklė

# noFolderHelp
source: You have not yet opened a folder. [Open Folder](command:{0})
lt_lt: Dar neatidarėte aplanko. [Atidaryti aplanką](komanda:{0})

# noWorkspaceHelp
source: You have not yet added a folder to the workspace. [Add Folder](command:{0})
lt_lt: Dar nepridėjote aplanko į darbo erdvę. [Pridėti aplanką](komanda:{0})

# openEditorsIcon
source: View icon of the open editors view.
lt_lt: Atidarytų redaktorių rodinio piktograma.

# remoteNoFolderHelp
source: Connected to remote. [Open Folder](command:{0})
lt_lt: Prijungta prie nuotolinio valdymo pulto. [Atverti aplanką] (komanda:{0})

# binFailed
source: Failed to delete using the Recycle Bin. Do you want to permanently delete instead?
lt_lt: Nepavyko perkelti į šiukšliadėžę. Ar norite ištrinti visam laikui?

# clipboardComparisonLabel
source: Clipboard ↔ {0}
lt_lt: Iškarpinė ↔ {0}

source: Close Group
lt_lt: Užverti grupę

# compareWithClipboard
source: Compare Active File with Clipboard
lt_lt: Palyginti aktyvųjį failą su iškarpine

# confirmDeleteMessageFile
source: Are you sure you want to permanently delete '{0}'?
lt_lt: Ar tikrai norite visam laikui ištrinti '{0}'?

# confirmDeleteMessageFilesAndDirectories
source: Are you sure you want to permanently delete the following {0} files/directories and their contents?
lt_lt: Ar tikrai norite visam laikui ištrinti šiuos {0} failus / katalogus ir jų turinį?

# confirmDeleteMessageFolder
source: Are you sure you want to permanently delete '{0}' and its contents?
lt_lt: Ar tikrai norite visam laikui ištrinti '{0}' ir jo turinį?

# confirmDeleteMessageMultiple
source: Are you sure you want to permanently delete the following {0} files?
lt_lt: Ar tikrai norite visam laikui ištrinti šiuos {0} failus?

# confirmDeleteMessageMultipleDirectories
source: Are you sure you want to permanently delete the following {0} directories and their contents?
lt_lt: Ar tikrai norite visam laikui ištrinti šiuos {0} katalogus ir jų turinį?

# confirmMoveTrashMessageFile
source: Are you sure you want to delete '{0}'?
lt_lt: Ar tikrai norite ištrinti '{0}'?

# confirmMoveTrashMessageFilesAndDirectories
source: Are you sure you want to delete the following {0} files/directories and their contents?
lt_lt: Ar tikrai norite ištrinti šiuos {0} failus / katalogus ir jų turinį?

# confirmMoveTrashMessageFolder
source: Are you sure you want to delete '{0}' and its contents?
lt_lt: Ar tikrai norite ištrinti '{0}' ir jo turinį?

# confirmMoveTrashMessageMultiple
source: Are you sure you want to delete the following {0} files?
lt_lt: Ar tikrai norite ištrinti šiuos {0} failus?

# confirmMoveTrashMessageMultipleDirectories
source: Are you sure you want to delete the following {0} directories and their contents?
lt_lt: Ar tikrai norite ištrinti šiuos {0} katalogus ir jų turinį?

# copyBulkEdit
source: Copy {0} files
lt_lt: Kopijuoti {0} failus

# copyFile
source: Copy
lt_lt: Kopijuoti

# copyFileBulkEdit
source: Copy {0}
lt_lt: Kopijuoti {0}

# copyingBulkEdit
source: Copying {0} files
lt_lt: Kopijuojami {0} failai

# copyingFileBulkEdit
source: Copying {0}
lt_lt: Kopijuojami {0}

# createBulkEdit
source: Create {0}
lt_lt: Sukurti {0}

# creatingBulkEdit
source: Creating {0}
lt_lt: Sukuriama {0}

source: Delete
lt_lt: Ištrinti

# deleteBulkEdit
source: Delete {0} files
lt_lt: Ištrinti {0} failus

# deleteButtonLabel
source: &&Delete
lt_lt: &&Ištrinti

# deleteButtonLabelRecycleBin
source: &&Move to Recycle Bin
lt_lt: &&Perkelti į šiukšliadėžę

# deleteButtonLabelTrash
source: &&Move to Trash
lt_lt: &&Perkelti į šiukšliadėžę

# deleteFileBulkEdit
source: Delete {0}
lt_lt: Ištrinti {0}

# deletePermanentlyButtonLabel
source: &&Delete Permanently
lt_lt: &&Ištrinti neatstatomai

# deletingBulkEdit
source: Deleting {0} files
lt_lt: Ištrinami {0} failai

# deletingFileBulkEdit
source: Deleting {0}
lt_lt: Išrinama {0}

# dirtyMessageFileDelete
source: You are deleting {0} with unsaved changes. Do you want to continue?
lt_lt: Jūs ketinate ištrinti {0} su neišsaugotais pakeitimais. Ar norite tęsti?

# dirtyMessageFilesDelete
source: You are deleting files with unsaved changes. Do you want to continue?
lt_lt: Jūs ketinate ištrinti failus su neišsaugotais pakeitimais. Ar norite tęsti?

# dirtyMessageFolderDelete
source: You are deleting a folder {0} with unsaved changes in {1} files. Do you want to continue?
lt_lt: Jūs ketinate ištrinti aplanką {0} su neišsaugotais pakeitimais {1} failuose. Ar norite tęsti?

# dirtyMessageFolderOneDelete
source: You are deleting a folder {0} with unsaved changes in 1 file. Do you want to continue?
lt_lt: Jūs ketinate ištrinti aplanką {0} su neišsaugotais 1 failo pakeitimais. Ar norite tęsti?

# dirtyWarning
source: Your changes will be lost if you don't save them.
lt_lt: Pakeitimai bus prarasti, jei jų neišsaugosite.

# doNotAskAgain
source: Do not ask me again
lt_lt: Neklauskite manęs dar kartą

source: Download...
lt_lt: Atsisiųsti...

# emptyFileNameError
source: A file or folder name must be provided.
lt_lt: Turi būti nurodytas failo arba aplanko pavadinimas.

# fileDeleted
source: The file(s) to paste have been deleted or moved since you copied them. {0}
lt_lt: Nuo tada, kai kopijavote failą (-us), kurį (-iuos) norite įklijuoti, jis (jie) buvo ištrintas (-i) arba perkeltas (-i). {0}

# fileIsAncestor
source: File to paste is an ancestor of the destination folder
lt_lt: Klijuojamas failas yra paskirtie aplanke

# fileNameExistsError
source: A file or folder **{0}** already exists at this location. Please choose a different name.
lt_lt: Šioje vietoje jau yra failas arba aplankas **{0}**. Pasirinkite kitą pavadinimą.

# fileNameStartsWithSlashError
source: A file or folder name cannot start with a slash.
lt_lt: Failo ar aplanko pavadinimas negali prasidėti pasviruoju brūkšniu.

# fileNameWhitespaceWarning
source: Leading or trailing whitespace detected in file or folder name.
lt_lt: Aptikta, kad failo ar aplanko pavadinimas prasideda matomuoju tarpu.

# focusFilesExplorer
source: Focus on Files Explorer
lt_lt: Fokusuoti failų naršyklę

# globalCompareFile
source: Compare Active File With...
lt_lt: Palyginti aktyvųjį failą su...

# invalidFileNameError
source: The name **{0}** is not valid as a file or folder name. Please choose a different name.
lt_lt: Pavadinimas **{0}** negalioja kaip failo ar aplanko pavadinimas. Pasirinkite kitą pavadinimą.

# irreversible
source: This action is irreversible!
lt_lt: Šis veiksmas yra negrįžtamas!

# moveBulkEdit
source: Move {0} files
lt_lt: Perkelti {0} failus

# moveFileBulkEdit
source: Move {0}
lt_lt: Perkelti {0}

# movingBulkEdit
source: Moving {0} files
lt_lt: Perkeliami {0} failai

# movingFileBulkEdit
source: Moving {0}
lt_lt: Perkeliama {0}

source: New File
lt_lt: Naujas failas

source: New Folder
lt_lt: Naujas aplankas

# openFileInNewWindow
source: Open Active File in New Window
lt_lt: Atidaryti aktyvųjį failą naujame lange

# openFileToShowInNewWindow.unsupportedschema
source: The active editor must contain an openable resource.
lt_lt: Aktyviame redaktoriaus langelyje turi būti atveriamas išteklius.

# pasteFile
source: Paste
lt_lt: Įdėti

source: Rename
lt_lt: Pervadinti

# renameBulkEdit
source: Rename {0} to {1}
lt_lt: Pervadinti {0} į {1}

# renamingBulkEdit
source: Renaming {0} to {1}
lt_lt: Parvadinama iš {0} į {1}

# restore
source: You can restore this file using the Undo command
lt_lt: Šį failą galite atkurti naudodami komandą Atšaukti

# restorePlural
source: You can restore these files using the Undo command
lt_lt: Šiuos failus galite atkurti naudodami komandą Atšaukti

# retryButtonLabel
source: &&Retry
lt_lt: &&Bandyti vėl

source: Save All in Group
lt_lt: Išsaugoti visus grupės failus

# showInExplorer
source: Reveal Active File in Side Bar
lt_lt: Aktyvaus failo atskleidimas šoninėje juostoje

source: Toggle Auto Save
lt_lt: Perjungti automatinį išsaugojimą

# trashFailed
source: Failed to delete using the Trash. Do you want to permanently delete instead?
lt_lt: Nepavyko perkelti į šiukšliadėžę. Ar norite ištrinti visam laikui?

# undoBin
source: You can restore this file from the Recycle Bin.
lt_lt: Šį failą galite atkurti iš šiukšliadėžės.

# undoBinFiles
source: You can restore these files from the Recycle Bin.
lt_lt: Šiuos failus galite atkurti iš šiukšliadėžės.

# undoTrash
source: You can restore this file from the Trash.
lt_lt: Šį failą galite atkurti iš šiukšliadėžės.

# undoTrashFiles
source: You can restore these files from the Trash.
lt_lt: Šiuos failus galite atkurti iš šiukšliadėžės.

source: Upload...
lt_lt: Įkelti...

# acceptLocalChanges
source: Use your changes and overwrite file contents
lt_lt: Naudokite savo pakeitimus ir perrašykite failo turinį

source: Close
lt_lt: Užverti

source: Close All
lt_lt: Užverti viską

source: Close Others
lt_lt: Užverti kitus

source: Close Saved
lt_lt: Užverti išsaugotus

# compareActiveWithSaved
source: Compare Active File with Saved
lt_lt: Palyginti aktyvųjį failą su išsaugotuoju

source: Compare Selected
lt_lt: Palyginti pasirinktus

# compareSource
source: Select for Compare
lt_lt: Pažymėti palyginimui

source: Compare with Saved
lt_lt: Palyginti su išsaugotu

source: Compare with Selected
lt_lt: Palyginti su pasirinktu

source: Copy Path
lt_lt: Kopijuoti kelią

# copyPathOfActive
source: Copy Path of Active File
lt_lt: Kopijuoti aktyvaus failo kelią

source: Copy Relative Path
lt_lt: Kopijuoti santykinį kelią

# copyRelativePathOfActive
source: Copy Relative Path of Active File
lt_lt: Kopijuoti santykinį aktyvaus failo kelią

source: Cut
lt_lt: Iškirpti

# deleteFile
source: Delete Permanently
lt_lt: Ištrinti neatstatomai

# explorerOpenWith
source: Open With...
lt_lt: Atverti su...

source: File
lt_lt: Failas

# filesCategory
source: File
lt_lt: Failas

# miAutoSave
source: A&&uto Save
lt_lt: A&&utomatinis išsaugojimas

# miCloseEditor
source: &&Close Editor
lt_lt: &&Užverti redaktorių

# miGotoFile
source: Go to &&File...
lt_lt: Eiti į &&failą...

# miNewFile
source: &&New File
lt_lt: &&Naujas failas

# miOpen
source: &&Open...
lt_lt: &&Atverti...

# miOpenFile
source: &&Open File...
lt_lt: &&Atverti failą...

# miOpenFolder
source: Open &&Folder...
lt_lt: Atverti &&aplanką...

# miOpenWorkspace
source: Open Wor&&kspace...
lt_lt: Atverti &&darbo erdvę...

# miRevert
source: Re&&vert File
lt_lt: At&&statyti failą

# miSave
source: &&Save
lt_lt: &&Išsaugoti

# miSaveAll
source: Save A&&ll
lt_lt: Išsaugoti v&&isus

# miSaveAs
source: Save &&As...
lt_lt: Išsaugoti &&kaip...

source: Open File...
lt_lt: Atverti failą...

# openToSide
source: Open to the Side
lt_lt: Atverti šone

source: Reveal in Side Bar
lt_lt: Atskleisti šoninėje juostoje

# revert
source: Revert File
lt_lt: Atstatyti failą

# revertLocalChanges
source: Discard your changes and revert to file contents
lt_lt: Atmesti Jūsų pakeitimus ir atstatyti failo turinį

source: Save All
lt_lt: Išsaugoti viską

# saveFiles
source: Save All Files
lt_lt: Išsaugoti visus failus

source: Workspaces
lt_lt: Darbo sritys

# genericRevertError
source: Failed to revert '{0}': {1}
lt_lt: Nepavyko atstatyti '{0}': {1}

# modifiedLabel
source: {0} (in file) ↔ {1}
lt_lt: {0} (byloje) ↔ {1}

source: New Untitled File
lt_lt: Naujas failas be pavadinimo

source: Remove Folder from Workspace
lt_lt: Pašalinti aplanką iš darbo erdvės

source: Save
lt_lt: Išsaugoti

source: Save As...
lt_lt: Išsaugoti kaip...

source: Save without Formatting
lt_lt: Išsaugoti be formatavimo

# addFolder
source: &&Add Folder to Workspace
lt_lt: &&Pridėti aplanką į darbo sritį

# addFolders
source: &&Add Folders to Workspace
lt_lt: && Pridėti aplankus į darbo sritį

source: Cancel
lt_lt: Atšaukti

source: Choose Where to Download
lt_lt: Pasirinkti, kur atsisiųsti

# confirmManyOverwrites
source: The following {0} files and/or folders already exist in the destination folder. Do you want to replace them?
lt_lt: Paskirties aplanke jau yra šie {0} failai ir (arba) aplankai. Ar norite juos pakeisti?

# confirmOverwrite
source: A file or folder with the name '{0}' already exists in the destination folder. Do you want to replace it?
lt_lt: Paskirties aplanke jau yra failas arba aplankas pavadinimu "{0}". Ar norite jį pakeisti?

# copyFile
source: Copy {0}
lt_lt: Kopijuoti {0}

source: &&Copy Folder
lt_lt: &&Kopijuoti aplanką

source: &&Copy Folders
lt_lt: &&Kopijuoti aplankus

# copyfolder
source: Are you sure to want to copy '{0}'?
lt_lt: Ar tikrai norite nukopijuoti '{0}'?

# copyfolders
source: Are you sure to want to copy folders?
lt_lt: Ar tikrai norite kopijuoti aplankus?

# copyingFile
source: Copying {0}
lt_lt: Kopijuojama {0}

# copyingFiles
source: Copying...
lt_lt: Kopijuojama...

# copyingnFile
source: Copying {0} resources
lt_lt: Kopijuojami {0} ištekliai

# copynFile
source: Copy {0} resources
lt_lt: Kopijuoti {0} išteklius

# downloadBulkEdit
source: Download {0}
lt_lt: Atsisiųsti {0}

# downloadButton
source: Download
lt_lt: Atsisiųsti

# downloadProgressLarge
source: {0} ({1} of {2}, {3}/s)
lt_lt: {0} ({1} iš {2}, {3}/s)

# downloadProgressSmallMany
source: {0} of {1} files ({2}/s)
lt_lt: {0} iš {1} failų ({2}/s)

# downloadingBulkEdit
source: Downloading {0}
lt_lt: Atsiunčiama {0}...

# downloadingFiles
source: Downloading
lt_lt: Atsiunčiama

# dropFolder
source: Do you want to copy '{0}' or add '{0}' as a folder to the workspace?
lt_lt: Ar norite nukopijuoti "{0}", ar įtraukti "{0}" kaip aplanką į darbo erdvę?

# dropFolders
source: Do you want to copy the folders or add the folders to the workspace?
lt_lt: Ar norite nukopijuoti aplankus, ar įtraukti aplankus į darbo erdvę?

# overwrite
source: Overwrite {0}
lt_lt: Perrašyti {0}

# overwriting
source: Overwriting {0}
lt_lt: Perrašoma {0}

# replaceButtonLabel
source: &&Replace
lt_lt: &&Pakeisti

# uploadProgressLarge
source: {0} ({1} of {2}, {3}/s)
lt_lt: {0} ({1} iš {2}, {3}/s)

# uploadProgressSmallMany
source: {0} of {1} files ({2}/s)
lt_lt: {0} iš {1} failų ({2}/s)

# uploadingFiles
source: Uploading
lt_lt: Įkeliama

# askUser
source: Will refuse to save and ask for resolving the save conflict manually.
lt_lt: Atsisakys išsaugoti ir paprašys rankiniu būdu išspręsti išsaugojimo konfliktą.

# associations
source: Configure file associations to languages (e.g. `"*.extension": "html"`). These have precedence over the default associations of the languages installed.
lt_lt: Sukonfigūruoti failų asociacijas su kalbomis (pvz., `"*.extension": "html"`). Jos turi pirmenybę prieš įdiegtų kalbų numatytąsias asociacijas.

# autoGuessEncoding
source: When enabled, the editor will attempt to guess the character set encoding when opening files. This setting can also be configured per language. Note, this setting is not respected by text search. Only `#files.encoding#` is respected.
lt_lt: Kai ši funkcija įjungta, atidarant failus redaktorius bandys atspėti simbolių rinkinio koduotę. Šį nustatymą taip pat galima konfigūruoti kiekvienai kalbai. Atkreipkite dėmesį, kad šis nustatymas neatsižvelgia į teksto paiešką. Atsižvelgiama tik į `#files.encoding#`.

# autoReveal
source: Controls whether the explorer should automatically reveal and select files when opening them.
lt_lt: Nustato, ar naršyklė turėtų automatiškai atskleisti ir pasirinkti failus juos atidarant.

# autoReveal.focusNoScroll
source: Files will not be scrolled into view, but will still be focused.
lt_lt: Failai nebus rodomi, bet vis tiek bus sufokusuoti.

# autoReveal.off
source: Files will not be revealed and selected.
lt_lt: Failai nebus atskleisti ir pažymėti.

# autoReveal.on
source: Files will be revealed and selected.
lt_lt: Failai bus atskleisti ir pažymėti.

# autoSave
source: Controls auto save of dirty editors. Read more about autosave [here](https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save).
lt_lt: Valdo automatinį nešvarių redaktorių išsaugojimą. Daugiau apie automatinį išsaugojimą [čia] (https://code.visualstudio.com/docs/editor/codebasics#_save-auto-save).

# autoSaveDelay
source: Controls the delay in ms after which a dirty editor is saved automatically. Only applies when `#files.autoSave#` is set to `{0}`.
lt_lt: Valdo uždelsimą milisekundėmis, po kurio nešvarus redaktorius išsaugomas automatiškai. Taikoma tik tada, kai `#files.autoSave#` nustatyta į `{0}`.

source: Binary File Editor
lt_lt: Dvejetainių failų redaktorius

# compressSingleChildFolders
source: Controls whether the explorer should render folders in a compact form. In such a form, single child folders will be compressed in a combined tree element. Useful for Java package structures, for example.
lt_lt: Nustato, ar naršyklė turi atvaizduoti aplankus kompaktiška forma. Tokioje formoje pavieniai pavaldūs aplankai bus suspausti į jungtinį medžio elementą. Naudinga, pavyzdžiui, Java paketų struktūroms.

# confirmDelete
source: Controls whether the explorer should ask for confirmation when deleting a file via the trash.
lt_lt: Nustato, ar naršyklė turi prašyti patvirtinimo, kai failas trinamas per šiukšliadėžę.

# confirmDragAndDrop
source: Controls whether the explorer should ask for confirmation to move files and folders via drag and drop.
lt_lt: Nustato, ar naršyklė turi prašyti patvirtinimo, kad failus ir aplankus perkeltumėte vilkdami.

# defaultLanguage
source: The default language mode that is assigned to new files. If configured to `${activeEditorLanguage}`, will use the language mode of the currently active text editor if any.
lt_lt: Numatytasis kalbos režimas, priskiriamas naujiems failams. Jei nustatyta `${activeEditorLanguage}`, bus naudojamas šiuo metu aktyvaus teksto redaktoriaus kalbos režimas, jei toks yra.

# enableDragAndDrop
source: Controls whether the explorer should allow to move files and folders via drag and drop. This setting only effects drag and drop from inside the explorer.
lt_lt: Nustato, ar naršyklė leidžia perkelti failus ir aplankus vilkimo būdu. Šis nustatymas turi įtakos tik vilkimui iš naršyklės vidaus.

# encoding
source: The default character set encoding to use when reading and writing files. This setting can also be configured per language.
lt_lt: Numatytoji simbolių rinkinio koduotė, naudojama skaitant ir rašant failus. Šį nustatymą taip pat galima nustatyti kiekvienai kalbai.

# eol
source: The default end of line character.
lt_lt: Numatytasis eilutės pabaigos simbolis.

# eol.auto
source: Uses operating system specific end of line character.
lt_lt: Naudojamas operacinei sistemai būdingas eilutės pabaigos simbolis.

# everything
source: Format the whole file.
lt_lt: Suformatuokite visą failą.

# exclude
source: Configure glob patterns for excluding files and folders. For example, the file Explorer decides which files and folders to show or hide based on this setting. Refer to the `#search.exclude#` setting to define search specific excludes. Read more about glob patterns [here](https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options).
lt_lt: Sukonfigūruokite glob šablonus nurodančius kokių failų ir aplankų neįtraukti. Pavyzdžiui, failų naršyklė pagal šį nustatymą nusprendžia, kuriuos failus ir aplankus rodyti arba slėpti. Norėdami apibrėžti konkrečios paieškos neįtraukiamus failus, žr. nustatymą `#search.exclude#`. Daugiau apie glob šablonus [čia] (https://code.visualstudio.com/docs/editor/codebasics#_advanced-search-options).

# explorer.decorations.badges
source: Controls whether file decorations should use badges.
lt_lt: Nustato, ar failų dekoracijose turi būti naudojami ženkliukai.

# explorer.decorations.colors
source: Controls whether file decorations should use colors.
lt_lt: Nustato, ar failų dekoracijose turi būti naudojamos spalvos.

# explorer.incrementalNaming
source: Controls what naming strategy to use when a giving a new name to a duplicated explorer item on paste.
lt_lt: Nustato, kokią strategiją naudoti suteikiant naują pavadinimą dubliuotam naršyklės elementui įklijuoti.

# explorerConfigurationTitle
source: File Explorer
lt_lt: Failų naršyklė

# files.autoSave.afterDelay
source: A dirty editor is automatically saved after the configured `#files.autoSaveDelay#`.
lt_lt: Pakeitimai automatiškai išsaugomi po nustatyto `#files.autoSaveDelay#` laiko.

# files.autoSave.off
source: A dirty editor is never automatically saved.
lt_lt: Pakeitimai niekada nėra automatiškai išsaugomi.

# files.autoSave.onFocusChange
source: A dirty editor is automatically saved when the editor loses focus.
lt_lt: Pakeitimai yra automatiškai išsaugomi, kai redaktorius praranda fokusą.
