Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-workbench/vs_workbench_contrib_files.xlf
Languages: lt_lt

# files.autoSave.onWindowChange
source: A dirty editor is automatically saved when the window loses focus.
lt_lt: Pakeitimai yra automatiškai išsaugomi, kai langas praranda fokusą.

# files.exclude.boolean
source: The glob pattern to match file paths against. Set to true or false to enable or disable the pattern.
lt_lt: Glob šablonas, pagal kurį bus randami failų keliai. Nustatykite true arba false, kad įjungtumėte arba išjungtumėte šabloną.

# files.exclude.when
source: Additional check on the siblings of a matching file. Use $(basename) as variable for the matching file name.
lt_lt: Papildomai patikrinti failus esančius tame pačiame aplanke kaip ir rastasis. Rasto failo pavadinimas laikomas kintamajame $(basename).

# files.restoreUndoStack
source: Restore the undo stack when a file is reopened.
lt_lt: Atkurti atšaukimo dėklą, kai vėl atidaromas failas.

# files.saveConflictResolution
source: A save conflict can occur when a file is saved to disk that was changed by another program in the meantime. To prevent data loss, the user is asked to compare the changes in the editor with the version on disk. This setting should only be changed if you frequently encounter save conflict errors and may result in data loss if used without caution.
lt_lt: Išsaugojimo konfliktas gali kilti, kai į diską įrašomas failas, kuris tuo metu buvo pakeistas kita programa. Kad būtų išvengta duomenų praradimo, naudotojo prašoma palyginti pakeitimus redaktoriuje su diske esančia versija. Šį nustatymą reikėtų keisti tik tuo atveju, jei dažnai susiduriate su išsaugojimo konflikto klaidomis, o jei juo naudojatės neapdairiai, galite prarasti duomenis.

# files.simpleDialog.enable
source: Enables the simple file dialog. The simple file dialog replaces the system file dialog when enabled.
lt_lt: Įjungiamas paprastas failų dialogo langas. Įjungtas paprastas failo dialogo langas pakeičia sistemos failo dialogo langą.

# filesConfigurationTitle
source: Files
lt_lt: Failai

# formatOnSave
source: Format a file on save. A formatter must be available, the file must not be saved after delay, and the editor must not be shutting down.
lt_lt: Įrašant formatuokite failą. Formatavimo programa turi būti prieinama, failas turi būti išsaugotas ne vėliau kaip po uždelsimo, o redaktorius neturi tuo metu išsijunginėti.

# formatOnSaveMode
source: Controls if format on save formats the whole file or only modifications. Only applies when `#editor.formatOnSave#` is enabled.
lt_lt: Nustato, ar išsaugant formatą formatuojamas visas failas, ar tik pakeitimai. Taikoma tik tada, kai įjungta `#editor.formatOnSave#`.

# hotExit
source: Controls whether unsaved files are remembered between sessions, allowing the save prompt when exiting the editor to be skipped.
lt_lt: Nustato, ar neišsaugoti failai įsimenami tarp sesijų, todėl išeinant iš redaktoriaus galima praleisti išsaugojimo raginimą.

# hotExit.off
source: Disable hot exit. A prompt will show when attempting to close a window with dirty files.
lt_lt: Išjungti greitąjį išjungimą. Bandant uždaryti langą su failais turinčiais neišsaugotų pakeitimų, bus rodomas raginimas.

# hotExit.onExit
source: Hot exit will be triggered when the last window is closed on Windows/Linux or when the `workbench.action.quit` command is triggered (command palette, keybinding, menu). All windows without folders opened will be restored upon next launch. A list of previously opened windows with unsaved files can be accessed via `File > Open Recent > More...`
lt_lt: Greitasis išėjimas" bus įjungtas, kai bus uždarytas paskutinis langas Windows/Linux sistemoje arba kai bus įjungta komanda `workbench.action.quit` (komandų paletė, klavišų ryšys, meniu). Visi langai be atidarytų aplankų bus atkurti paleidus kitą kartą. Anksčiau atidarytų langų su neišsaugotais failais sąrašą galima pasiekti per `File > Open Recent > More...`

# hotExit.onExitAndWindowClose
source: Hot exit will be triggered when the last window is closed on Windows/Linux or when the `workbench.action.quit` command is triggered (command palette, keybinding, menu), and also for any window with a folder opened regardless of whether it's the last window. All windows without folders opened will be restored upon next launch. A list of previously opened windows with unsaved files can be accessed via `File > Open Recent > More...`
lt_lt: Greitasis išjungimas bus įjungtas uždarius paskutinį langą "Windows" / "Linux" sistemoje arba įjungus komandą `workbench.action.quit` (komandų paletė, klavišų ryšys, meniu), taip pat bet kuriame lange, kuriame atidarytas aplankas, nepriklausomai nuo to, ar tai paskutinis langas. Visi langai, kuriuose nėra atidarytų aplankų, bus atkurti paleidus kitą kartą. Anksčiau atidarytų langų su neišsaugotais failais sąrašą galima pasiekti per `Failas > Atidaryti naujausius > Daugiau...`

# hotExit.onExitAndWindowCloseBrowser
source: Hot exit will be triggered when the browser quits or the window or tab is closed.
lt_lt: Greitasis išjungimas bus aktyvuojamas, kai išsijungs naršyklė arba bus uždarytas langas arba skirtukas.

# insertFinalNewline
source: When enabled, insert a final new line at the end of the file when saving it.
lt_lt: Kai ši funkcija įjungta, išsaugant failą jo pabaigoje įterpiama nauja tuščia eilutė.

# maxMemoryForLargeFilesMB
source: Controls the memory available to VS Code after restart when trying to open large files. Same effect as specifying `--max-memory=NEWSIZE` on the command line.
lt_lt: Kontroliuoja atmintį, kurią turi VS Code po naujo paleidimo, kai bandoma atidaryti didelius failus. Toks pat poveikis, kaip komandinėje eilutėje nurodžius `--max-memory=NEWSIZE`.

# modification
source: Format modifications (requires source control).
lt_lt: Formato pakeitimai (reikia versijų kontrolės).

# openEditorsSortOrder
source: Controls the sorting order of editors in the Open Editors pane.
lt_lt: Valdo redaktorių rūšiavimo tvarką lange Atverti redaktoriai.

# openEditorsVisible
source: Number of editors shown in the Open Editors pane. Setting this to 0 hides the Open Editors pane.
lt_lt: Atvirų redaktorių lange rodomų redaktorių skaičius. Nustačius šią reikšmę į 0, atidarytų redaktorių skydelis paslepiamas.

# overwriteFileOnDisk
source: Will resolve the save conflict by overwriting the file on disk with the changes in the editor.
lt_lt: Išspręs išsaugojimo konfliktą perrašydamas diske esantį failą su redaktoriuje padarytais pakeitimais.

# simple
source: Appends the word "copy" at the end of the duplicated name potentially followed by a number
lt_lt: Dubliuojamo pavadinimo pabaigoje prideda žodį "copy", galimai su skaičiumi

# smart
source: Adds a number at the end of the duplicated name. If some number is already part of the name, tries to increase that number
lt_lt: Dubliuojamo pavadinimo pabaigoje prideda skaičių. Jei koks nors skaičius jau yra vardo dalis, bandoma jį padidinti

# sortOrder
source: Controls the property-based sorting of files and folders in the explorer.
lt_lt: Valdo failų ir aplankų rūšiavimą pagal savybes naršyklėje.

# sortOrder.alphabetical
source: Editors are ordered in alphabetical order inside each editor group.
lt_lt: Redaktoriai kiekvienoje redaktorių grupėje išdėstyti abėcėlės tvarka.

# sortOrder.default
source: Files and folders are sorted by their names. Folders are displayed before files.
lt_lt: Failai ir aplankai rikiuojami pagal pavadinimus. Aplankai rodomi pirmiau nei failai.

# sortOrder.editorOrder
source: Editors are ordered in the same order editor tabs are shown.
lt_lt: Redaktoriai išdėstyti ta pačia tvarka, kaip ir rodomi redaktorių skirtukai.

# sortOrder.filesFirst
source: Files and folders are sorted by their names. Files are displayed before folders.
lt_lt: Failai ir aplankai rikiuojami pagal pavadinimus. Failai rodomi prieš aplankus.

# sortOrder.mixed
source: Files and folders are sorted by their names. Files are interwoven with folders.
lt_lt: Failai ir aplankai rikiuojami pagal pavadinimus. Failai yra susieti su aplankais.

# sortOrder.modified
source: Files and folders are sorted by last modified date in descending order. Folders are displayed before files.
lt_lt: Failai ir aplankai surikiuojami pagal paskutinio pakeitimo datą mažėjančia tvarka. Aplankai rodomi prieš failus.

# sortOrder.type
source: Files and folders are grouped by extension type then sorted by their names. Folders are displayed before files.
lt_lt: Failai ir aplankai sugrupuojami pagal plėtinio tipą, tada surūšiuojami pagal pavadinimus. Aplankai rodomi pirmiau nei failai.

# sortOrderLexicographicOptions
source: Controls the lexicographic sorting of file and folder names in the explorer.
lt_lt: Valdo leksikografinį failų ir aplankų pavadinimų rūšiavimą naršyklėje.

# sortOrderLexicographicOptions.default
source: Uppercase and lowercase names are mixed together.
lt_lt: Didžiųjų ir mažųjų raidžių pavadinimai yra neskiriami.

# sortOrderLexicographicOptions.lower
source: Lowercase names are grouped together before uppercase names.
lt_lt: Mažosios raidės grupuojamos prieš didžiąsias.

# sortOrderLexicographicOptions.unicode
source: Names are sorted in unicode order.
lt_lt: Vardai surūšiuoti Unikodo tvarka.

# sortOrderLexicographicOptions.upper
source: Uppercase names are grouped together before lowercase names.
lt_lt: Didžiosios raidės grupuojamos prieš mažąsias.

# trimFinalNewlines
source: When enabled, will trim all new lines after the final new line at the end of the file when saving it.
lt_lt: Kai ši funkcija įjungta, išsaugant failą bus ištrinti visi jo pabaigoje esantys eilutės pabaigos simboliai, išskyrus paskutinį.

# trimTrailingWhitespace
source: When enabled, will trim trailing whitespace when saving a file.
lt_lt: Kai ši funkcija įjungta, išsaugant failą bus ištrinti visi matomi tarpai esantys eilučių pabaigose.

# useTrash
source: Moves files/folders to the OS trash (recycle bin on Windows) when deleting. Disabling this will delete files/folders permanently.
lt_lt: Trinant failus ir aplankus perkelia į operacinės sistemos šiukšliadėžę. Išjungus šią funkciją, failai / aplankai bus ištrinti visam laikui.

# watcherExclude
source: Configure glob patterns of file paths to exclude from file watching. Patterns must match on absolute paths, i.e. prefix with `**/` or the full path to match properly and suffix with `/**` to match files within a path (for example `**/build/output/**` or `/Users/name/workspaces/project/build/output/**`). Changing this setting requires a restart. When you experience Code consuming lots of CPU time on startup, you can exclude large folders to reduce the initial load.
lt_lt: Nustatyti failų, kurių nereikia sekti glob šablonus. Šablonai turi veikti su absoliučiais keliais, t. y. priešdėlis turi būti `**/` arba visas kelias, kad atitiktų tinkamai, o galūnė – `/**`, kad atitiktų failus kelio viduje (pavyzdžiui, `**/build/output/**` arba `/Users/name/workspaces/project/build/output/**`). Norint pakeisti šį nustatymą, reikia paleisti iš naujo. Jei pastebėjote, kad paleidimo metu Code sunaudoja daug procesoriaus laiko, galite išskirti didelius aplankus, kad sumažintumėte pradinę apkrovą.

# noWorkspace
source: No Folder Opened
lt_lt: Nėra atidaryto aplanko

# canNotResolve
source: Unable to resolve workspace folder
lt_lt: Nepavyksta nustatyti darbo vietos aplanko

# label
source: Explorer
lt_lt: Naršyklė

# symbolicLlink
source: Symbolic Link
lt_lt: Simbolinė nuoroda

# unknown
source: Unknown File Type
lt_lt: Nežinomas failo tipas

# collapseExplorerFolders
source: Collapse Folders in Explorer
lt_lt: Suskleisti aplankus naršyklėje

# createNewFile
source: New File
lt_lt: Naujas failas

# createNewFolder
source: New Folder
lt_lt: Naujas aplankas

# explorerSection
source: Explorer Section: {0}
lt_lt: Naršyklės skyrius: {0}

source: Refresh Explorer
lt_lt: Atnaujinti naršyklę

# confirmMove
source: Are you sure you want to move '{0}' into '{1}'?
lt_lt: Ar tikrai norite perkelti '{0}' į '{1}'?

# confirmMultiMove
source: Are you sure you want to move the following {0} files into '{1}'?
lt_lt: Ar tikrai norite perkelti šiuos {0} failus į '{1}'?

# confirmRootMove
source: Are you sure you want to change the order of root folder '{0}' in your workspace?
lt_lt: Ar tikrai norite pakeisti šakninio aplanko "{0}" tvarką savo darbo erdvėje?

# confirmRootsMove
source: Are you sure you want to change the order of multiple root folders in your workspace?
lt_lt: Ar tikrai norite pakeisti kelių šakninių aplankų tvarką savo darbo erdvėje?

# copy
source: Copy {0}
lt_lt: Kopijuoti {0}

# copying
source: Copying {0}
lt_lt: Kopijuojama {0}

# fileInputAriaLabel
source: Type file name. Press Enter to confirm or Escape to cancel.
lt_lt: Įveskite failo pavadinimą. Paspauskite Enter, kad patvirtintumėte, arba Escape, kad atšauktumėte.

# move
source: Move {0}
lt_lt: Perkelti {0}

# moveButtonLabel
source: &&Move
lt_lt: &&Perkelti

# moving
source: Moving {0}
lt_lt: Perkeliama {0}

# treeAriaLabel
source: Files Explorer
lt_lt: Failų naršyklė

# dirtyCounter
source: {0} unsaved
lt_lt: {0} neišsaugotas

# flipLayout
source: Toggle Vertical/Horizontal Editor Layout
lt_lt: Vertikalaus / horizontalaus redaktoriaus išdėstymo perjungimas

# miToggleEditorLayout
source: Flip &&Layout
lt_lt: Apversti &&rodinį

source: Open Editors
lt_lt: Atverti redaktoriai

# dirtyFile
source: 1 unsaved file
lt_lt: 1 neišsaugotas failas

# dirtyFiles
source: {0} unsaved files
lt_lt: {0} neišsaugoti failai

# explorerResourceCut
source: True when an item in the EXPLORER has been cut for cut and paste.
lt_lt: Tiesa, kai elementas EXPLORER'yje buvo iškirptas, kad būtų galima jį iškirpti ir įklijuoti.

# explorerResourceIsFolder
source: True when the focused item in the EXPLORER is a folder.
lt_lt: Tiesa, kai fokusuojamas elementas EXPLORER'yje yra aplankas.

# explorerResourceIsRoot
source: True when the focused item in the EXPLORER is a root folder.
lt_lt: Tiesa, kai fokusuojamas elementas EXPLORER'yje yra šakninis aplankas.

# explorerResourceMoveableToTrash
source: True when the focused item in the EXPLORER can be moved to trash.
lt_lt: Tiesa, kai sufokusuotą elementą EXPLORER'yje galima perkelti į šiukšliadėžę.

# explorerResourceReadonly
source: True when the focused item in the EXPLORER is readonly.
lt_lt: Tiesa, kai sufokusuotas elementas EXPLORER'yje yra skirtas tik skaitymui.

# explorerViewletCompressedFirstFocus
source: True when the focus is inside a compact item's first part in the EXPLORER view.
lt_lt: Tiesa, kai fokusas yra kompaktiško elemento pirmojoje dalyje EXPLORER'io rodinyje.

# explorerViewletCompressedFocus
source: True when the focused item in the EXPLORER view is a compact item.
lt_lt: Tiesa, kai EXPLORER'io rodinyje fokusuojamas elementas yra kompaktiškas elementas.

# explorerViewletCompressedLastFocus
source: True when the focus is inside a compact item's last part in the EXPLORER view.
lt_lt: Tiesa, kai fokusas yra kompaktiško elemento paskutinėje dalyje EXPLORER'io rodinyje.

# explorerViewletFocus
source: True when the focus is inside the EXPLORER viewlet.
lt_lt: Tiesa, kai fokusas yra EXPLORER'io rodinio viduje.

# explorerViewletVisible
source: True when the EXPLORER viewlet is visible.
lt_lt: Tiesa, kai EXPLORER'io rodinys yra matomas.

# filesExplorerFocus
source: True when the focus is inside the EXPLORER view.
lt_lt: Tiesa, kai fokusas yra EXPLORER'io rodinyje.

# openEditorsFocus
source: True when the focus is inside the OPEN EDITORS view.
lt_lt: Tiesa, kai fokusas yra rodinyje OPEN EDITORS.

# openEditorsVisible
source: True when the OPEN EDITORS view is visible.
lt_lt: Tiesa, kai rodinys OPEN EDITORS yra matomas.

# enospcError
source: Unable to watch for file changes in this large workspace folder. Please follow the instructions link to resolve this issue.
lt_lt: Nepavyksta stebėti failų pakeitimų šiame dideliame darbo aplinkos aplanke. Norėdami išspręsti šią problemą, vadovaukitės nurodytomis instrukcijomis.

# installNet
source: Download .NET Framework 4.5
lt_lt: Atsisiųsti .NET Framework 4.5

# learnMore
source: Instructions
lt_lt: Instrukcijos

# netVersionError
source: The Microsoft .NET Framework 4.5 is required. Please follow the link to install it.
lt_lt: Reikalinga "Microsoft .NET Framework 4.5". Norėdami ją įdiegti, sekite šią nuorodą.

# openContainer
source: Open Containing Folder
lt_lt: Atverti tėvinį aplanką

# revealInMac
source: Reveal in Finder
lt_lt: Rodyti paieškos sistemoje Finder

# revealInWindows
source: Reveal in File Explorer
lt_lt: Rodyti failų naršyklėje

source: Configure Memory Limit
lt_lt: Konfigūruoti atminties ribojimus

# fileTooLargeForHeapError
source: To open a file of this size, you need to restart and allow {0} to use more memory
lt_lt: Norėdami atidaryti tokio dydžio failą, turite paleisti iš naujo ir leisti {0} naudoti daugiau atminties

# relaunchWithIncreasedMemoryLimit
source: Restart with {0} MB
lt_lt: Paleiskite iš naujo su {0} MB
