Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_editor.xlf
Languages: lt

# editor.suggest.showFolders
source: When enabled IntelliSense shows `folder`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `aplanko` pasiūlymus.

# editor.suggest.showFunctions
source: When enabled IntelliSense shows `function`-suggestions.
lt: Įjungus IntelliSense rodomi `funkcijos` pasiūlymai.

# editor.suggest.showInterfaces
source: When enabled IntelliSense shows `interface`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo "sąsajos" pasiūlymus.

# editor.suggest.showIssues
source: When enabled IntelliSense shows `issues`-suggestions.
lt: Kai įjungta, IntelliSense rodo `problemų` pasiūlymus.

# editor.suggest.showKeywords
source: When enabled IntelliSense shows `keyword`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `raktinių žodžių` užuominas.

# editor.suggest.showMethods
source: When enabled IntelliSense shows `method`-suggestions.
lt: Kai įjungta, IntelliSense rodo `metodo` pasiūlymus.

# editor.suggest.showModules
source: When enabled IntelliSense shows `module`-suggestions.
lt: Kai įjungta, IntelliSense rodo `modulų` siūlymus.

# editor.suggest.showOperators
source: When enabled IntelliSense shows `operator`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `operatoriaus` pasiūlymus.

# editor.suggest.showPropertys
source: When enabled IntelliSense shows `property`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `pavyzdžių` pasiūlymus.

# editor.suggest.showReferences
source: When enabled IntelliSense shows `reference`-suggestions.
lt: Kai įjungta, IntelliSense rodo `nurodymų` pasiūlymus.

# editor.suggest.showSnippets
source: When enabled IntelliSense shows `snippet`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `snippet` pasiūlymus.

# editor.suggest.showStructs
source: When enabled IntelliSense shows `struct`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `struktūros` pasiūlymus.

# editor.suggest.showTexts
source: When enabled IntelliSense shows `text`-suggestions.
lt: Įjungus IntelliSense, rodomi `teksto` pasiūlymai.

# editor.suggest.showTypeParameters
source: When enabled IntelliSense shows `typeParameter`-suggestions.
lt: Kai įjungta, IntelliSense rodo `typeParameter` pasiūlymus.

# editor.suggest.showUnits
source: When enabled IntelliSense shows `unit`-suggestions.
lt: Kai įjungta, IntelliSense rodo `vieneto` pasiūlymus.

# editor.suggest.showUsers
source: When enabled IntelliSense shows `user`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `vartotojo` pasiūlymus.

# editor.suggest.showValues
source: When enabled IntelliSense shows `value`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `vertės` pasiūlymus.

# editor.suggest.showVariables
source: When enabled IntelliSense shows `variable`-suggestions.
lt: Kai įjungta, IntelliSense rodo `pakeičiamųjų` siūlymus.

# editorViewAccessibleLabel
source: Editor content
lt: Redaktoriaus turinys

# emptySelectionClipboard
source: Controls whether copying without a selection copies the current line.
lt: Nustato, ar kopijuojant be pasirinkimo kopijuojama dabartinė eilutė.

# fastScrollSensitivity
source: Scrolling speed multiplier when pressing `Alt`.
lt: Slinkimo greičio daugiklis, kai paspaudžiamas `Alt`.

# find.addExtraSpaceOnTop
source: Controls whether the Find Widget should add extra lines on top of the editor. When true, you can scroll beyond the first line when the Find Widget is visible.
lt: Valdo, ar Find Widget turėtų pridėti papildomų eilučių redaktoriaus viršuje. Kai reikšmė yra true, matant Find Widget galėsite slinkti už pirmosios eilutės.

# find.autoFindInSelection
source: Controls the condition for turning on find in selection automatically.
lt: Valdo automatinio paieškos pasirinkimo įjungimo sąlygą.

# find.cursorMoveOnType
source: Controls whether the cursor should jump to find matches while typing.
lt: Nustato, ar rašant tekstą žymeklis turi šokinėti, kad rastų atitikmenis.

# find.globalFindClipboard
source: Controls whether the Find Widget should read or modify the shared find clipboard on macOS.
lt: Valdo, ar "Find Widget" turėtų skaityti arba keisti bendrinamąją "MacOS" paieškos iškarpinę.

# find.loop
source: Controls whether the search automatically restarts from the beginning (or the end) when no further matches can be found.
lt: Nustato, ar paieška automatiškai pradedama iš naujo nuo pradžios (arba pabaigos), kai nerandama daugiau atitikmenų.

# find.seedSearchStringFromSelection
source: Controls whether the search string in the Find Widget is seeded from the editor selection.
lt: Valdo, ar paieškos eilutė Find Widget yra nustatoma iš redaktoriaus pasirinkimo.

# folding
source: Controls whether the editor has code folding enabled.
lt: Nustato, ar redaktorius turi įjungti kodo sulankstymą.

# foldingHighlight
source: Controls whether the editor should highlight folded ranges.
lt: Nustato, ar redaktorius turėtų paryškinti sulankstytus intervalus.

# foldingStrategy
source: Controls the strategy for computing folding ranges.
lt: Valdo lankstymo intervalų skaičiavimo strategiją.

# foldingStrategy.auto
source: Use a language-specific folding strategy if available, else the indentation-based one.
lt: Jei yra, naudokite konkrečiai kalbai būdingą sulankstymo strategiją, kitu atveju - įtraukomis pagrįstą strategiją.

# foldingStrategy.indentation
source: Use the indentation-based folding strategy.
lt: Naudokite įtraukomis pagrįstą lankstymo strategiją.

# fontFamily
source: Controls the font family.
lt: Valdo šrifto šeimą.

# fontFeatureSettings
source: Explicit 'font-feature-settings' CSS property. A boolean can be passed instead if one only needs to turn on/off ligatures.
lt: Aiški CSS savybė "font-feature-settings". Jei reikia tik įjungti arba išjungti ligatūras, vietoj jos galima perduoti loginį reikšmę.

# fontLigatures
source: Enables/Disables font ligatures ('calt' and 'liga' font features). Change this to a string for fine-grained control of the 'font-feature-settings' CSS property.
lt: Įjungiamos / išjungiamos šrifto ligatūros ("calt" ir "liga" šrifto funkcijos). Pakeiskite šią reikšmę į eilutę, jei norite tiksliai valdyti CSS savybę "font-feature-settings".

# fontLigaturesGeneral
source: Configures font ligatures or font features. Can be either a boolean to enable/disable ligatures or a string for the value of the CSS 'font-feature-settings' property.
lt: Konfigūruoja šrifto ligatūras arba šrifto funkcijas. Tai gali būti loginis veiksnys, įjungiantis/išjungiantis ligatūras, arba CSS savybės "font-feature-settings" reikšmės eilutė.

# fontSize
source: Controls the font size in pixels.
lt: Valdo šrifto dydį pikseliais.

# fontWeight
source: Controls the font weight. Accepts "normal" and "bold" keywords or numbers between 1 and 1000.
lt: Valdo šrifto svorį. Priimami raktiniai žodžiai "normal" ir "bold" arba skaičiai nuo 1 iki 1000.

# fontWeightErrorMessage
source: Only "normal" and "bold" keywords or numbers between 1 and 1000 are allowed.
lt: Leidžiami tik "normalūs" ir "paryškinti" raktažodžiai arba skaičiai nuo 1 iki 1000.

# formatOnPaste
source: Controls whether the editor should automatically format the pasted content. A formatter must be available and the formatter should be able to format a range in a document.
lt: Nustato, ar redaktorius turėtų automatiškai formatuoti įterptą turinį. Turi būti prieinamas formatavimo įrankis, o formatavimo įrankis turi gebėti formatuoti dokumento intervalą.

# formatOnType
source: Controls whether the editor should automatically format the line after typing.
lt: Nustato, ar redaktorius turėtų automatiškai formatuoti eilutę po rašymo.

# glyphMargin
source: Controls whether the editor should render the vertical glyph margin. Glyph margin is mostly used for debugging.
lt: Valdo, ar redaktorius turėtų atvaizduoti vertikalųjį glifų pakraštį. Glifų paraštė dažniausiai naudojama derinimui.

# hideCursorInOverviewRuler
source: Controls whether the cursor should be hidden in the overview ruler.
lt: Nustato, ar žymeklis turi būti paslėptas apžvalgos liniuotėje.

# highlightActiveIndentGuide
source: Controls whether the editor should highlight the active indent guide.
lt: Nustato, ar redaktorius turėtų paryškinti aktyvųjį įtraukos vadovą.

# hover.delay
source: Controls the delay in milliseconds after which the hover is shown.
lt: Valdo uždelsimą milisekundėmis, po kurio rodomas užsklanda.

# hover.enabled
source: Controls whether the hover is shown.
lt: Nustato, ar rodomas užsklanda.

# hover.sticky
source: Controls whether the hover should remain visible when mouse is moved over it.
lt: Nustato, ar užsklanda turi likti matoma, kai ant jos užvedama pelė.

# inlayHints.enable
source: Enables the inlay hints in the editor.
lt: Įjungiamos redaktoriaus intarpų užuominos.

# inlayHints.fontFamily
source: Controls font family of inlay hints in the editor.
lt: Valdo redaktoriaus intarpų užuominų šrifto šeimą.

# inlayHints.fontSize
source: Controls font size of inlay hints in the editor. When set to `0`, the 90% of `#editor.fontSize#` is used.
lt: Valdo redaktoriaus intarpų užuominų šrifto dydį. Kai nustatyta `0`, naudojamas 90% of `#reditor.fontSize#`.

# inlineSuggest.enabled
source: Controls whether to automatically show inline suggestions in the editor.
lt: Nustato, ar automatiškai rodyti eilučių pasiūlymus redaktoriuje.

# inlineSuggest.mode
source: Controls which mode to use for rendering inline suggestions.
lt: Nustato, kokiu režimu atvaizduoti eilutės pasiūlymus.

# inlineSuggest.mode.prefix
source: Only render an inline suggestion if the replace text is a prefix of the insert text.
lt: Atvaizduokite įterptinį pasiūlymą tik tada, jei pakeistas tekstas yra įterpto teksto priešdėlis.

# inlineSuggest.mode.subwordDiff
source: Only render an inline suggestion if the replace text is a subword of the insert text.
lt: Įterptinį pasiūlymą atvaizduokite tik tada, jei pakeičiamas tekstas yra įterpiamo teksto posakis.

# letterSpacing
source: Controls the letter spacing in pixels.
lt: Valdo atstumą tarp raidžių pikseliais.

# lineHeight
source: Controls the line height. - Use 0 to automatically compute the line height from the font size. - Values between 0 and 8 will be used as a multiplier with the font size. - Values greater than or equal to 8 will be used as effective values.
lt: Valdo linijos aukštį. - Naudokite 0, jei eilutės aukštis automatiškai apskaičiuojamas pagal šrifto dydį. - Vertės nuo 0 iki 8 bus naudojamos kaip daugiklis su šrifto dydžiu. - Reikšmės, didesnės arba lygios 8, bus naudojamos kaip efektyvios reikšmės.

# lineNumbers
source: Controls the display of line numbers.
lt: Valdo eilučių numerių rodymą.

# lineNumbers.interval
source: Line numbers are rendered every 10 lines.
lt: Eilučių numeriai atvaizduojami kas 10 eilučių.

# lineNumbers.off
source: Line numbers are not rendered.
lt: Eilučių numeriai nėra atvaizduojami.

# lineNumbers.on
source: Line numbers are rendered as absolute number.
lt: Eilučių numeriai atvaizduojami kaip absoliutus skaičius.

# lineNumbers.relative
source: Line numbers are rendered as distance in lines to cursor position.
lt: Eilučių numeriai atvaizduojami kaip atstumas eilutėmis iki žymeklio padėties.

# linkedEditing
source: Controls whether the editor has linked editing enabled. Depending on the language, related symbols, e.g. HTML tags, are updated while editing.
lt: Nustato, ar įjungtas susietasis redagavimas. Priklausomai nuo kalbos, redaguojant atnaujinami susiję simboliai, pvz., HTML žymės.

# links
source: Controls whether the editor should detect links and make them clickable.
lt: Nustato, ar redaktorius turėtų aptikti nuorodas ir padaryti jas spustelėjamas.

# matchBrackets
source: Highlight matching brackets.
lt: Paryškinkite atitinkamus skliaustelius.

# minimap.enabled
source: Controls whether the minimap is shown.
lt: Nustato, ar rodomas minimapas.

# minimap.maxColumn
source: Limit the width of the minimap to render at most a certain number of columns.
lt: Apriboti minimapo plotį, kad būtų atvaizduojamas ne daugiau kaip tam tikras stulpelių skaičius.

# minimap.renderCharacters
source: Render the actual characters on a line as opposed to color blocks.
lt: Atvaizduokite tikruosius simbolius eilutėje, o ne spalvotus blokus.

# minimap.scale
source: Scale of content drawn in the minimap: 1, 2 or 3.
lt: Minimap'e piešiamo turinio mastelis: 1, 2 arba 3.

# minimap.showSlider
source: Controls when the minimap slider is shown.
lt: Valdo, kada rodomas minimapo slankiklis.

# minimap.side
source: Controls the side where to render the minimap.
lt: Valdo pusę, kurioje bus atvaizduojamas minimapas.

# minimap.size
source: Controls the size of the minimap.
lt: Valdo minimapo dydį.

# minimap.size.fill
source: The minimap will stretch or shrink as necessary to fill the height of the editor (no scrolling).
lt: Minimapas išsitempia arba susitraukia tiek, kiek reikia, kad užpildytų redaktoriaus aukštį (slinkimo nėra).

# minimap.size.fit
source: The minimap will shrink as necessary to never be larger than the editor (no scrolling).
lt: Minimapas sumažės tiek, kiek reikės, kad niekada nebūtų didesnis už redaktorių (be slinkimo).

# minimap.size.proportional
source: The minimap has the same size as the editor contents (and might scroll).
lt: Minimapas yra tokio pat dydžio kaip ir redaktoriaus turinys (ir gali slinkti).

# mouseWheelScrollSensitivity
source: A multiplier to be used on the `deltaX` and `deltaY` of mouse wheel scroll events.
lt: Daugiklis, naudojamas pelės ratuko slinkties įvykių `deltaX` ir `deltaY`.

# mouseWheelZoom
source: Zoom the font of the editor when using mouse wheel and holding `Ctrl`.
lt: Padidinkite redaktoriaus šriftą, kai naudojate pelės ratuką ir laikote `Ctrl`.

# multiCursorMergeOverlapping
source: Merge multiple cursors when they are overlapping.
lt: Sujungti kelis žymeklius, kai jie persidengia.

# multiCursorModifier
source: The modifier to be used to add multiple cursors with the mouse. The Go To Definition and Open Link mouse gestures will adapt such that they do not conflict with the multicursor modifier. [Read more](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).
lt: Keitiklis, kuris bus naudojamas norint pridėti kelis pelės žymeklius. Pelės gestai "Eiti į apibrėžimą" ir "Atidaryti nuorodą" bus pritaikyti taip, kad neprieštarautų kelių žymeklių modifikatoriui. [Skaityti daugiau](https://code.visualstudio.com/docs/editor/codebasics#_multicursor-modifier).

# multiCursorModifier.alt
source: Maps to `Alt` on Windows and Linux and to `Option` on macOS.
lt: "Windows" ir "Linux" sistemoje atitinka `Alt`, o "MacOS" sistemoje - `Option`.

# multiCursorModifier.ctrlCmd
source: Maps to `Control` on Windows and Linux and to `Command` on macOS.
lt: "Windows" ir "Linux" sistemoje atitinka `Control`, o "MacOS" sistemoje - `Command`.

# multiCursorPaste
source: Controls pasting when the line count of the pasted text matches the cursor count.
lt: Kontroliuoja įklijavimą, kai įklijuojamo teksto eilučių skaičius sutampa su žymeklio skaičiumi.

# multiCursorPaste.full
source: Each cursor pastes the full text.
lt: Kiekvienas žymeklis įklijuoja visą tekstą.

# multiCursorPaste.spread
source: Each cursor pastes a single line of the text.
lt: Kiekvienas žymeklis įklijuoja vieną teksto eilutę.

# occurrencesHighlight
source: Controls whether the editor should highlight semantic symbol occurrences.
lt: Nustato, ar redaktorius turėtų paryškinti semantinių simbolių atsiradimą.

# overviewRulerBorder
source: Controls whether a border should be drawn around the overview ruler.
lt: Nustato, ar aplink apžvalgos liniuotę turi būti nubrėžtas apvadas.

# padding.bottom
source: Controls the amount of space between the bottom edge of the editor and the last line.
lt: Valdo tarpo tarp apatinio redaktoriaus krašto ir paskutinės eilutės dydį.

# padding.top
source: Controls the amount of space between the top edge of the editor and the first line.
lt: Valdo tarpo tarp viršutinio redaktoriaus krašto ir pirmosios eilutės dydį.

# parameterHints.cycle
source: Controls whether the parameter hints menu cycles or closes when reaching the end of the list.
lt: Valdo, ar parametrų užuominų meniu cikliškai užsidarys, ar užsidarys, pasiekus sąrašo pabaigą.

# parameterHints.enabled
source: Enables a pop-up that shows parameter documentation and type information as you type.
lt: Įjungiamas iškylantysis langas, kuriame rašant rodoma parametrų dokumentacija ir tipo informacija.

# peekWidgetDefaultFocus
source: Controls whether to focus the inline editor or the tree in the peek widget.
lt: Valdo, ar žvilgsnio valdiklyje fokusuoti eilutės redaktorių, ar medį.

# peekWidgetDefaultFocus.editor
source: Focus the editor when opening peek
lt: Fokusuoti redaktorių atidarant peek

# peekWidgetDefaultFocus.tree
source: Focus the tree when opening peek
lt: Atidarydami žvilgtelėkite į medį

# quickSuggestions
source: Controls whether suggestions should automatically show up while typing.
lt: Nustato, ar rašant tekstą automatiškai rodomi pasiūlymai.

# quickSuggestions.comments
source: Enable quick suggestions inside comments.
lt: Įgalinkite greitus pasiūlymus komentaruose.

# quickSuggestions.other
source: Enable quick suggestions outside of strings and comments.
lt: Įgalinkite greitus pasiūlymus ne eilutėse ir komentaruose.

# quickSuggestions.strings
source: Enable quick suggestions inside strings.
lt: Įgalinti greitus pasiūlymus eilutėse.

# quickSuggestionsDelay
source: Controls the delay in milliseconds after which quick suggestions will show up.
lt: Valdo uždelsimą milisekundėmis, po kurio bus rodomi greiti pasiūlymai.

# renameOnType
source: Controls whether the editor auto renames on type.
lt: Nustato, ar redaktorius automatiškai pervadins pavadinimus pagal tipą.

# renameOnTypeDeprecate
source: Deprecated, use `editor.linkedEditing` instead.
lt: Pasenęs, vietoj jo naudokite `editor.linkedEditing`.

# renderControlCharacters
source: Controls whether the editor should render control characters.
lt: Nustato, ar redaktorius turi atvaizduoti valdymo simbolius.

# renderFinalNewline
source: Render last line number when the file ends with a newline.
lt: Atvaizduoti paskutinės eilutės numerį, kai failas baigiasi naująja eilute.

# renderIndentGuides
source: Controls whether the editor should render indent guides.
lt: Nustato, ar redaktorius turi atvaizduoti įtraukų kreipinius.

# renderLineHighlight
source: Controls how the editor should render the current line highlight.
lt: Valdo, kaip redaktorius turėtų atvaizduoti dabartinės eilutės paryškinimą.

# renderLineHighlight.all
source: Highlights both the gutter and the current line.
lt: Išryškina ir tarpinę, ir esamą eilutę.

# renderLineHighlightOnlyWhenFocus
source: Controls if the editor should render the current line highlight only when the editor is focused.
lt: Nustato, ar redaktorius turi atvaizduoti dabartinės eilutės paryškinimą tik tada, kai redaktorius yra sufokusuotas.

# renderWhitespace
source: Controls how the editor should render whitespace characters.
lt: Nustato, kaip redaktorius turėtų atvaizduoti baltuosius simbolius.

# renderWhitespace.boundary
source: Render whitespace characters except for single spaces between words.
lt: Atvaizduokite baltuosius simbolius, išskyrus atskirus tarpus tarp žodžių.

# renderWhitespace.selection
source: Render whitespace characters only on selected text.
lt: Atvaizduoti baltuosius simbolius tik pasirinktame tekste.

# renderWhitespace.trailing
source: Render only trailing whitespace characters.
lt: Atvaizduoti tik užpakalinius baltuosius simbolius.

# roundedSelection
source: Controls whether selections should have rounded corners.
lt: Nustato, ar pasirinktys turi turėti užapvalintus kampus.

# rulers
source: Render vertical rulers after a certain number of monospace characters. Use multiple values for multiple rulers. No rulers are drawn if array is empty.
lt: Po tam tikro skaičiaus monospace simbolių atvaizduokite vertikalias liniuotes. Naudokite kelias vertes kelioms liniuotėms. Liniuotės nerodomos, jei masyvas tuščias.

# rulers.color
source: Color of this editor ruler.
lt: Šios redaktoriaus liniuotės spalva.

# rulers.size
source: Number of monospace characters at which this editor ruler will render.
lt: Monospace simbolių skaičius, kurį atvaizduos ši redaktoriaus liniuotė.

# scrollBeyondLastColumn
source: Controls the number of extra characters beyond which the editor will scroll horizontally.
lt: Nustatomas papildomų simbolių skaičius, kurį viršijus redaktorius slinksta horizontaliai.

# scrollBeyondLastLine
source: Controls whether the editor will scroll beyond the last line.
lt: Nustato, ar redaktorius slinkti už paskutinės eilutės.

# scrollPredominantAxis
source: Scroll only along the predominant axis when scrolling both vertically and horizontally at the same time. Prevents horizontal drift when scrolling vertically on a trackpad.
lt: Slinkite tik išilgai vyraujančios ašies, kai vienu metu slinkite ir vertikaliai, ir horizontaliai. Apsaugo nuo horizontalaus dreifo, kai slinkimas vertikaliai atliekamas naudojant sekimo pultelį.

# scrollbar.horizontal
source: Controls the visibility of the horizontal scrollbar.
lt: Valdo horizontalios slinkties juostos matomumą.

# scrollbar.horizontal.auto
source: The horizontal scrollbar will be visible only when necessary.
lt: Horizontali slinkties juosta bus matoma tik prireikus.

# scrollbar.horizontal.fit
source: The horizontal scrollbar will always be hidden.
lt: Horizontali slinkties juosta visada bus paslėpta.

# scrollbar.horizontal.visible
source: The horizontal scrollbar will always be visible.
lt: Horizontali slinkties juosta visada bus matoma.

# scrollbar.horizontalScrollbarSize
source: The height of the horizontal scrollbar.
lt: Horizontaliosios slinkties juostos aukštis.

# scrollbar.scrollByPage
source: Controls whether clicks scroll by page or jump to click position.
lt: Valdo, ar paspaudimai slenka pagal puslapį, ar peršoka į paspaudimo padėtį.

# scrollbar.vertical
source: Controls the visibility of the vertical scrollbar.
lt: Valdo vertikaliosios slinkties juostos matomumą.

# scrollbar.vertical.auto
source: The vertical scrollbar will be visible only when necessary.
lt: Vertikali slinkties juosta bus matoma tik prireikus.

# scrollbar.vertical.fit
source: The vertical scrollbar will always be hidden.
lt: Vertikali slinkties juosta visada bus paslėpta.

# scrollbar.vertical.visible
source: The vertical scrollbar will always be visible.
lt: Vertikali slinkties juosta visada bus matoma.

# scrollbar.verticalScrollbarSize
source: The width of the vertical scrollbar.
lt: Vertikalios slinkties juostos plotis.

# selectLeadingAndTrailingWhitespace
source: Whether leading and trailing whitespace should always be selected.
lt: Ar visada turi būti pasirenkamos pradinės ir galinės baltosios eilutės.

# selectionClipboard
source: Controls whether the Linux primary clipboard should be supported.
lt: Nustato, ar turi būti palaikoma "Linux" pirminė iškarpinė.

# selectionHighlight
source: Controls whether the editor should highlight matches similar to the selection.
lt: Nustato, ar redaktorius turėtų paryškinti panašius į pasirinktus atitikmenis.

# showDeprecated
source: Controls strikethrough deprecated variables.
lt: Kontroliuoja perbrauktus nebenaudojamus kintamuosius.

# showFoldingControls
source: Controls when the folding controls on the gutter are shown.
lt: Valdikliai, kai rodomi ant latako esantys sulankstymo valdikliai.

# showFoldingControls.always
source: Always show the folding controls.
lt: Visada parodykite sulankstomus valdiklius.

# showFoldingControls.mouseover
source: Only show the folding controls when the mouse is over the gutter.
lt: Lankstymo valdikliai rodomi tik tada, kai pelė yra virš griovelio.

# showUnused
source: Controls fading out of unused code.
lt: Kontroliuoja nenaudojamo kodo išnykimą.
