Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_editor.xlf
Languages: lt

# smoothScrolling
source: Controls whether the editor will scroll using an animation.
lt: Nustato, ar redaktorius bus slinkti naudojant animaciją.

# snippetSuggestions
source: Controls whether snippets are shown with other suggestions and how they are sorted.
lt: Nustato, ar fragmentai rodomi kartu su kitais pasiūlymais ir kaip jie rūšiuojami.

# snippetSuggestions.bottom
source: Show snippet suggestions below other suggestions.
lt: Rodyti fragmentų pasiūlymus po kitais pasiūlymais.

# snippetSuggestions.inline
source: Show snippets suggestions with other suggestions.
lt: Rodyti fragmentų pasiūlymus su kitais pasiūlymais.

# snippetSuggestions.none
source: Do not show snippet suggestions.
lt: Nerodyti fragmentų pasiūlymų.

# snippetSuggestions.top
source: Show snippet suggestions on top of other suggestions.
lt: Rodyti fragmentų pasiūlymus virš kitų pasiūlymų.

# stickyTabStops
source: Emulate selection behavior of tab characters when using spaces for indentation. Selection will stick to tab stops.
lt: Imituoti skirtuko simbolių pasirinkimo elgseną, kai įtraukimui naudojami tarpai. Pasirinkimas bus priklijuotas prie skirtuko stotelių.

# suggest.filterGraceful
source: Controls whether filtering and sorting suggestions accounts for small typos.
lt: Nustato, ar filtruojant ir rūšiuojant pasiūlymus atsižvelgiama į mažas rašybos klaidas.

# suggest.insertMode
source: Controls whether words are overwritten when accepting completions. Note that this depends on extensions opting into this feature.
lt: Nustato, ar priimant papildymus žodžiai bus perrašomi. Atkreipkite dėmesį, kad tai priklauso nuo to, ar plėtiniai yra pasirinkę šią funkciją.

# suggest.insertMode.insert
source: Insert suggestion without overwriting text right of the cursor.
lt: Įterpkite pasiūlymą neperrašydami teksto dešinėje žymeklio pusėje.

# suggest.insertMode.replace
source: Insert suggestion and overwrite text right of the cursor.
lt: Įterpkite pasiūlymą ir perrašykite tekstą dešinėje žymeklio pusėje.

# suggest.localityBonus
source: Controls whether sorting favors words that appear close to the cursor.
lt: Nustato, ar rūšiuojant pirmenybė teikiama žodžiams, esantiems netoli žymeklio.

# suggest.maxVisibleSuggestions.dep
source: This setting is deprecated. The suggest widget can now be resized.
lt: Šis nustatymas nebenaudojamas. Pasiūlymo valdiklio dydį dabar galima keisti.

# suggest.preview
source: Controls whether to preview the suggestion outcome in the editor.
lt: Nustato, ar redaktoriaus ekrane bus peržiūrimas pasiūlymo rezultatas.

# suggest.previewMode
source: Controls which mode to use for rendering the suggest preview.
lt: Nustato, kokiu režimu bus atvaizduojama pasiūlymo peržiūra.

# suggest.previewMode.prefix
source: Only render a preview if the replace text is a prefix of the insert text.
lt: Peržiūrą atvaizduokite tik tuo atveju, jei pakeičiamas tekstas yra įterpiamo teksto priešdėlis.

# suggest.previewMode.subwordDiff
source: Only render a preview if the replace text is a subword of the insert text.
lt: Peržiūrą atvaizduokite tik tuo atveju, jei pakeičiamas tekstas yra įterpiamo teksto posakis.

# suggest.shareSuggestSelections
source: Controls whether remembered suggestion selections are shared between multiple workspaces and windows (needs `#editor.suggestSelection#`).
lt: Valdo, ar įsiminti pasiūlymų pasirinkimai dalijami keliose darbo vietose ir languose (reikia `#editor.suggestSelection#`).

# suggest.showIcons
source: Controls whether to show or hide icons in suggestions.
lt: Nustato, ar rodyti, ar slėpti piktogramas pasiūlymuose.

# suggest.showInlineDetails
source: Controls whether suggest details show inline with the label or only in the details widget
lt: Nustato, ar siūloma informacija turi būti rodoma kartu su etikete, ar tik išsamios informacijos valdiklyje

# suggest.showStatusBar
source: Controls the visibility of the status bar at the bottom of the suggest widget.
lt: Valdo būsenos juostos, esančios siūlymo valdiklio apačioje, matomumą.

# suggest.snippetsPreventQuickSuggestions
source: Controls whether an active snippet prevents quick suggestions.
lt: Nustato, ar aktyvi fragmentas užkerta kelią greitiems pasiūlymams.

# suggestFontSize
source: Font size for the suggest widget. When set to `0`, the value of `#editor.fontSize#` is used.
lt: Pasiūlymo valdiklio šrifto dydis. Kai nustatyta `0`, naudojama `#editor.fontSize#` reikšmė.

# suggestLineHeight
source: Line height for the suggest widget. When set to `0`, the value of `#editor.lineHeight#` is used. The minimum value is 8.
lt: Pasiūlymo valdiklio linijos aukštis. Kai nustatyta `0`, naudojama `#editor.lineHeight#` reikšmė. Mažiausia vertė yra 8.

# suggestOnTriggerCharacters
source: Controls whether suggestions should automatically show up when typing trigger characters.
lt: Nustato, ar įvedant trigerio simbolius turėtų būti automatiškai rodomi pasiūlymai.

# suggestSelection
source: Controls how suggestions are pre-selected when showing the suggest list.
lt: Nustato, kaip iš anksto parenkami pasiūlymai, kai rodomas pasiūlymų sąrašas.

# suggestSelection.first
source: Always select the first suggestion.
lt: Visada pasirinkite pirmąjį pasiūlymą.

# suggestSelection.recentlyUsed
source: Select recent suggestions unless further typing selects one, e.g. `console.| -&gt; console.log` because `log` has been completed recently.
lt: Pasirinkite naujausius pasiūlymus, nebent toliau rašant pasirenkamas vienas iš jų, pvz., `console.| -&gt; console.log`, nes `log` buvo baigtas neseniai.

# suggestSelection.recentlyUsedByPrefix
source: Select suggestions based on previous prefixes that have completed those suggestions, e.g. `co -&gt; console` and `con -&gt; const`.
lt: Pasirinkite pasiūlymus pagal ankstesnius priešdėlius, kurie papildė tuos pasiūlymus, pvz., `co -&gt; console` ir `con -&gt; const`.

# tabCompletion
source: Enables tab completions.
lt: Įjungiamas skirtuko užbaigimas.

# tabCompletion.off
source: Disable tab completions.
lt: Išjungti skirtuko užbaigimus.

# tabCompletion.on
source: Tab complete will insert the best matching suggestion when pressing tab.
lt: Paspaudus skirtuką "Tab complete" bus įterptas geriausiai atitinkantis pasiūlymas.

# tabCompletion.onlySnippets
source: Tab complete snippets when their prefix match. Works best when 'quickSuggestions' aren't enabled.
lt: Skirtukas užbaigti fragmentus, kai jų priešdėliai sutampa. Geriausiai veikia, kai "QuickSuggestions" nėra įjungta.

# unfoldOnClickAfterEndOfLine
source: Controls whether clicking on the empty content after a folded line will unfold the line.
lt: Nustato, ar spustelėjus tuščią turinį po sulankstytos eilutės, eilutė bus išskleista.

# unusualLineTerminators
source: Remove unusual line terminators that might cause problems.
lt: Pašalinkite neįprastus linijos terminatorius, kurie gali sukelti problemų.

# unusualLineTerminators.auto
source: Unusual line terminators are automatically removed.
lt: Neįprasti eilučių terminatoriai pašalinami automatiškai.

# unusualLineTerminators.off
source: Unusual line terminators are ignored.
lt: Neįprasti eilučių terminatoriai ignoruojami.

# unusualLineTerminators.prompt
source: Unusual line terminators prompt to be removed.
lt: Neįprasti eilučių terminatoriai raginami pašalinti.

# useTabStops
source: Inserting and deleting whitespace follows tab stops.
lt: Baltųjų tarpų įterpimas ir šalinimas po skirtuko stotelių.

# wordSeparators
source: Characters that will be used as word separators when doing word related navigations or operations.
lt: Ženklai, kurie bus naudojami kaip žodžių skyrybos ženklai atliekant su žodžiais susijusią navigaciją arba operacijas.

# wordWrap
source: Controls how lines should wrap.
lt: Nustato, kaip turėtų būti užlenkiamos eilutės.

# wordWrap.bounded
source: Lines will wrap at the minimum of viewport and `#editor.wordWrapColumn#`.
lt: Eilutės bus apvyniojamos pagal mažiausią viewport ir `##editor.wordWrapColumn#` reikšmę.

# wordWrap.wordWrapColumn
source: Lines will wrap at `#editor.wordWrapColumn#`.
lt: Eilutės bus užlenktos ties `##editor.wordWrapColumn#`.

# wordWrapColumn
source: Controls the wrapping column of the editor when `#editor.wordWrap#` is `wordWrapColumn` or `bounded`.
lt: Kontroliuoja redaktoriaus apvyniojimo stulpelį, kai `#editor.wordWrap#` yra `wordWrapColumn` arba `bounded`.

# wrappingIndent
source: Controls the indentation of wrapped lines.
lt: Kontroliuoja suvyniotų eilučių įtrauką.

# wrappingIndent.deepIndent
source: Wrapped lines get +2 indentation toward the parent.
lt: Apvyniotoms eilutėms suteikiama +2 įtrauka į pagrindinę eilutę.

# wrappingIndent.indent
source: Wrapped lines get +1 indentation toward the parent.
lt: Apvyniotoms eilutėms suteikiama +1 įtrauka į pagrindinę eilutę.

# wrappingIndent.none
source: No indentation. Wrapped lines begin at column 1.
lt: Nėra įtraukos. Apvyniotos eilutės prasideda nuo 1 stulpelio.

# wrappingIndent.same
source: Wrapped lines get the same indentation as the parent.
lt: Apvyniotos eilutės turi tokią pačią įtrauką kaip ir pagrindinės eilutės.

# wrappingStrategy
source: Controls the algorithm that computes wrapping points.
lt: Valdo algoritmą, pagal kurį apskaičiuojami įvyniojimo taškai.

# wrappingStrategy.advanced
source: Delegates wrapping points computation to the browser. This is a slow algorithm, that might cause freezes for large files, but it works correctly in all cases.
lt: Deleguoja įvyniojimo taškų skaičiavimą naršyklei. Tai lėtas algoritmas, dėl kurio dideli failai gali užstrigti, tačiau visais atvejais jis veikia teisingai.

# wrappingStrategy.simple
source: Assumes that all characters are of the same width. This is a fast algorithm that works correctly for monospace fonts and certain scripts (like Latin characters) where glyphs are of equal width.
lt: Daroma prielaida, kad visi simboliai yra vienodo pločio. Tai greitas algoritmas, kuris tinkamai veikia monospace šriftams ir tam tikriems rašmenims (pvz., lotyniškiems rašmenims), kai glifai yra vienodo pločio.

# editorColumnSelection
source: Whether `editor.columnSelection` is enabled
lt: Ar įjungta `editor.columnSelection` funkcija

# editorFocus
source: Whether the editor or an editor widget has focus (e.g. focus is in the find widget)
lt: Ar redaktorius arba redaktoriaus valdiklis turi fokusą (pvz., fokusas yra paieškos valdiklyje)

# editorHasCodeActionsProvider
source: Whether the editor has a code actions provider
lt: Ar redaktorius turi kodo veiksmų teikėją

# editorHasCodeLensProvider
source: Whether the editor has a code lens provider
lt: Ar redaktorius turi kodo objektyvo teikėją

# editorHasCompletionItemProvider
source: Whether the editor has a completion item provider
lt: Ar redaktorius turi užbaigimo elementų teikėją

# editorHasDeclarationProvider
source: Whether the editor has a declaration provider
lt: Ar redaktorius turi deklaracijos teikėją

# editorHasDefinitionProvider
source: Whether the editor has a definition provider
lt: Ar redaktorius turi apibrėžties teikėją

# editorHasDocumentFormattingProvider
source: Whether the editor has a document formatting provider
lt: Ar redaktorius turi dokumento formatavimo teikėją

# editorHasDocumentHighlightProvider
source: Whether the editor has a document highlight provider
lt: Ar redaktorius turi dokumento paryškinimo teikėją

# editorHasDocumentSelectionFormattingProvider
source: Whether the editor has a document selection formatting provider
lt: Ar redaktorius turi dokumento pasirinkimo formatavimo teikėją

# editorHasDocumentSymbolProvider
source: Whether the editor has a document symbol provider
lt: Ar redaktorius turi dokumento simbolių teikėją

# editorHasHoverProvider
source: Whether the editor has a hover provider
lt: Ar redaktorius turi užvedimo paslaugų teikėją

# editorHasImplementationProvider
source: Whether the editor has an implementation provider
lt: Ar redaktorius turi įgyvendinimo teikėją

# editorHasInlayHintsProvider
source: Whether the editor has an inline hints provider
lt: Ar redaktoriuje yra įterptinių užuominų teikėjas

# editorHasMultipleDocumentFormattingProvider
source: Whether the editor has multiple document formatting providers
lt: Ar redaktorius turi kelis dokumento formatavimo paslaugų teikėjus

# editorHasMultipleDocumentSelectionFormattingProvider
source: Whether the editor has multiple document selection formatting providers
lt: Ar redaktorius turi kelis dokumento pasirinkimo formatavimo teikėjus

# editorHasMultipleSelections
source: Whether the editor has multiple selections
lt: Ar redaktoriuje galima pasirinkti kelis pasirinkimus

# editorHasReferenceProvider
source: Whether the editor has a reference provider
lt: Ar redaktorius turi nuorodų teikėją

# editorHasRenameProvider
source: Whether the editor has a rename provider
lt: Ar redaktorius turi pervardijimo teikėją

# editorHasSelection
source: Whether the editor has text selected
lt: Ar redaktoriuje pasirinktas tekstas

# editorHasSignatureHelpProvider
source: Whether the editor has a signature help provider
lt: Ar redaktorius turi parašo pagalbos teikėją

# editorHasTypeDefinitionProvider
source: Whether the editor has a type definition provider
lt: Ar redaktorius turi tipo apibrėžties teikėją

# editorHoverVisible
source: Whether the editor hover is visible
lt: Ar matomas redaktoriaus žymeklis

# editorLangId
source: The language identifier of the editor
lt: Redaktoriaus kalbos identifikatorius

# editorReadonly
source: Whether the editor is read only
lt: Ar redaktorius gali būti tik skaitomas

# editorTabMovesFocus
source: Whether `Tab` will move focus out of the editor
lt: Ar `Tab` perkels fokusą iš redaktoriaus

# editorTextFocus
source: Whether the editor text has focus (cursor is blinking)
lt: Ar redaktoriaus tekste yra fokusas (mirksi žymeklis)

# inCompositeEditor
source: Whether the editor is part of a larger editor (e.g. notebooks)
lt: Ar redaktorius yra didesnio redaktoriaus (pvz., sąsiuvinių) dalis

# inDiffEditor
source: Whether the context is a diff editor
lt: Ar kontekstas yra skirtumų redaktorius

# textInputFocus
source: Whether an editor or a rich text input has focus (cursor is blinking)
lt: Ar fokusuojamas redaktorius, ar teksto įvestis (mirksi žymeklis)

# edit
source: Typing
lt: Rašymas

# plainText.alias
source: Plain Text
lt: Paprastas Tekstas

# accessibilityHelpMessage
source: Press Alt+F1 for Accessibility Options.
lt: Paspauskite Alt+F1 ir pasirinkite prieinamumo parinktis.

# auto_off
source: The editor is configured to never be optimized for usage with a Screen Reader, which is not the case at this time.
lt: Redaktorius sukonfigūruotas taip, kad niekada nebūtų optimizuotas naudoti su ekrano skaitymo programa, tačiau šiuo metu taip nėra.

# auto_on
source: The editor is configured to be optimized for usage with a Screen Reader.
lt: Redaktorius sukonfigūruotas taip, kad būtų optimizuotas naudoti su ekrano skaitymo programa.

# bulkEditServiceSummary
source: Made {0} edits in {1} files
lt: Atlikti {0} redagavimai {1} failuose

# changeConfigToOnMac
source: To configure the editor to be optimized for usage with a Screen Reader press Command+E now.
lt: Jei norite sukonfigūruoti redaktorių, kad jis būtų optimizuotas naudojimui su ekrano skaitytuvu, dabar paspauskite Command+E.

# changeConfigToOnWinLinux
source: To configure the editor to be optimized for usage with a Screen Reader press Control+E now.
lt: Jei norite sukonfigūruoti redaktorių, kad jis būtų optimizuotas naudoti su ekrano skaitymo programa, paspauskite Control+E.

# editableDiffEditor
source: in a pane of a diff editor.
lt: skirtumų redaktoriaus lange.

# editableEditor
source: in a code editor
lt: kodo redaktoriuje

# emergencyConfOn
source: Now changing the setting `accessibilitySupport` to 'on'.
lt: Dabar pakeiskite nustatymą `accessibilitySupport` į 'on'.

# gotoLineActionLabel
source: Go to Line/Column...
lt: Eikite į eilutę / stulpelį...

# helpQuickAccess
source: Show all Quick Access Providers
lt: Rodyti visus greitosios prieigos paslaugų teikėjus

# inspectTokens
source: Developer: Inspect Tokens
lt: Kūrėjas: Apžiūrėti žetonus

# multiSelection
source: {0} selections
lt: {0} pasirinkimai

# multiSelectionRange
source: {0} selections ({1} characters selected)
lt: {0} pasirinkimai ({1} pasirinktos raidės)

source: No selection
lt: Nėra pasirinkimo

# openDocMac
source: Press Command+H now to open a browser window with more information related to editor accessibility.
lt: Paspauskite "Command+H", kad atidarytumėte naršyklės langą su daugiau informacijos, susijusios su redaktoriaus prieinamumu.

# openDocWinLinux
source: Press Control+H now to open a browser window with more information related to editor accessibility.
lt: Paspauskite Control+H, kad atidarytumėte naršyklės langą su daugiau informacijos, susijusios su redaktoriaus prieinamumu.

# openingDocs
source: Now opening the Editor Accessibility documentation page.
lt: Dabar atidarykite redaktoriaus prieinamumo dokumentacijos puslapį.

# outroMsg
source: You can dismiss this tooltip and return to the editor by pressing Escape or Shift+Escape.
lt: Šią užuominą galite atmesti ir grįžti į redaktorių paspausdami Escape arba Shift+Escape.

# quickCommandActionHelp
source: Show And Run Commands
lt: Rodyti ir paleisti komandas

# quickCommandActionLabel
source: Command Palette
lt: - Vykdykite „&lt;div class="link italics" role="button" onclick={0}&gt;Sukurti naują tuščią sąsiuvinį&lt;/div&gt;“ komandų paletėje (&lt;div class="italics"&gt;Shift + Command + P&lt;/div&gt;)&lt;br /&gt;- Išbandykite mūsų &lt;div class="link" role="button" onclick={1}&gt;pavyzdinį sąsiuvinį&lt;/div&gt; ir sužinokite apie užrašų knygučių savybes

# quickOutlineActionLabel
source: Go to Symbol...
lt: Eiti į simbolį...

# quickOutlineByCategoryActionLabel
source: Go to Symbol by Category...
lt: Pereikite prie simbolio pagal kategoriją...

# readonlyDiffEditor
source: in a read-only pane of a diff editor.
lt: tik skaitymui skirtumų redaktoriaus lange.

# readonlyEditor
source: in a read-only code editor
lt: tik skaityti skirtame kodo redaktoriuje

# showAccessibilityHelpAction
source: Show Accessibility Help
lt: Rodyti prieinamumo pagalbą

# singleSelection
source: Line {0}, Column {1}
lt: Eilutė {0}, stulpelis {1}

# singleSelectionRange
source: Line {0}, Column {1} ({2} selected)
lt: Eilutė {0}, stulpelis {1} (pasirinktas {2})

# tabFocusModeOffMsg
source: Pressing Tab in the current editor will insert the tab character. Toggle this behavior by pressing {0}.
lt: Paspaudus Tab dabartiniame redaktoriuje, įterpiamas skirtuko simbolis. Šią elgseną perjunkite paspausdami {0}.

# tabFocusModeOffMsgNoKb
source: Pressing Tab in the current editor will insert the tab character. The command {0} is currently not triggerable by a keybinding.
lt: Paspaudus Tab dabartiniame redaktoriuje, įterpiamas skirtuko simbolis. Komanda {0} šiuo metu negali būti aktyvuojama klavišų jungtimi.

# tabFocusModeOnMsg
source: Pressing Tab in the current editor will move focus to the next focusable element. Toggle this behavior by pressing {0}.
lt: Paspaudus "Tab" dabartiniame redaktoriuje, fokusas bus perkeltas į kitą fokusuojamą elementą. Šią funkciją perjungsite paspausdami {0}.

# tabFocusModeOnMsgNoKb
source: Pressing Tab in the current editor will move focus to the next focusable element. The command {0} is currently not triggerable by a keybinding.
lt: Paspaudus "Tab" dabartiniame redaktoriuje, fokusas bus perkeltas į kitą fokusuojamą elementą. Komanda {0} šiuo metu negali būti paleidžiama klavišų ryšiu.

# toggleHighContrast
source: Toggle High Contrast Theme
lt: Didelio kontrasto temos perjungimas

# caret
source: Color of the editor cursor.
lt: Redaktoriaus žymeklio spalva.

# deprecatedEditorActiveLineNumber
source: Id is deprecated. Use 'editorLineNumber.activeForeground' instead.
lt: Id nebenaudojamas. Vietoj jo naudokite "editorLineNumber.activeForeground".

# editorActiveIndentGuide
source: Color of the active editor indentation guides.
lt: Aktyvaus redaktoriaus įtraukos kreipiančiųjų spalva.

# editorActiveLineNumber
source: Color of editor active line number
lt: Redaktoriaus aktyvios eilutės numerio spalva

# editorBracketMatchBackground
source: Background color behind matching brackets
lt: Fono spalva už suderintų skliaustų

# editorBracketMatchBorder
source: Color for matching brackets boxes
lt: Spalva, skirta suderinti laikiklių dėžutes

# editorCodeLensForeground
source: Foreground color of editor CodeLens
lt: Redaktoriaus pirmojo plano spalva CodeLens

# editorCursorBackground
source: The background color of the editor cursor. Allows customizing the color of a character overlapped by a block cursor.
lt: Redaktoriaus žymeklio fono spalva. Leidžia pritaikyti bloko žymekliu uždengto simbolio spalvą.

# editorGhostTextBorder
source: Border color of ghost text in the editor.
lt: Vaiduoklio teksto apvado spalva redaktoriuje.

# editorGhostTextForeground
source: Foreground color of the ghost text in the editor.
lt: Vaiduoklio teksto pirmojo plano spalva redaktoriuje.

# editorGutter
source: Background color of the editor gutter. The gutter contains the glyph margins and the line numbers.
lt: Redaktoriaus griovelio fono spalva. Į tarpinę dedamos glifų paraštės ir eilučių numeriai.

# editorIndentGuides
source: Color of the editor indentation guides.
lt: Redaktoriaus įtraukos kreipiančiųjų spalva.

# editorLineNumbers
source: Color of editor line numbers.
lt: Redaktoriaus eilučių numerių spalva.

# editorOverviewRulerBackground
source: Background color of the editor overview ruler. Only used when the minimap is enabled and placed on the right side of the editor.
lt: Redaktoriaus apžvalgos liniuotės fono spalva. Naudojama tik tada, kai įjungtas minimapas ir yra dešinėje redaktoriaus pusėje.

# editorOverviewRulerBorder
source: Color of the overview ruler border.
lt: Apžvalgos liniuotės apvado spalva.

# editorRuler
source: Color of the editor rulers.
lt: Redaktoriaus liniuočių spalva.

# editorWhitespaces
source: Color of whitespace characters in the editor.
lt: Baltųjų simbolių spalva redaktoriuje.

# lineHighlight
source: Background color for the highlight of line at the cursor position.
lt: Fono spalva, kuria žymeklio padėtyje paryškinama linija.

# lineHighlightBorderBox
source: Background color for the border around the line at the cursor position.
lt: Fono spalva, kuria žymeklio vietoje apjuosiama linija.

# overviewRuleError
source: Overview ruler marker color for errors.
lt: Apžvalga Liniuotės žymeklio spalva klaidoms žymėti.

# overviewRuleInfo
source: Overview ruler marker color for infos.
lt: Apžvalgos liniuotės žymeklio spalva, skirta informacijai.

# overviewRuleWarning
source: Overview ruler marker color for warnings.
lt: Perskaitykite liniuotės įspėjimų žymeklio spalvą.

# overviewRulerRangeHighlight
source: Overview ruler marker color for range highlights. The color must not be opaque so as not to hide underlying decorations.
lt: Apžvalgos liniuotės žymeklio spalva, skirta diapazonui paryškinti. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# rangeHighlight
source: Background color of highlighted ranges, like by quick open and find features. The color must not be opaque so as not to hide underlying decorations.
lt: Išryškintų intervalų fono spalva, pavyzdžiui, naudojant greito atidarymo ir radimo funkcijas. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# rangeHighlightBorder
source: Background color of the border around highlighted ranges.
lt: Fono spalva, kuria apjuosiami išryškinti intervalai.
