Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_editor.xlf
Languages: lt

# removedCursor
source: Removed secondary cursors
lt: Pašalinti antriniai žymekliai

# stickydesc
source: Stick to the end even when going to longer lines
lt: Laikykitės pabaigos net ir eidami į ilgesnes eiles

# accessibilityOffAriaLabel
source: The editor is not accessible at this time. Press {0} for options.
lt: Redaktorius šiuo metu neprieinamas. Paspauskite {0}, jei norite pasirinkti parinktis.

source: editor
lt: redaktorius

# cancellableOperation
source: Whether the editor runs a cancellable operation, e.g. like 'Peek References'
lt: Ar redaktorius atlieka atšaukiamą operaciją, pvz., "Peek References"

# miSelectAll
source: &amp;&amp;Select All
lt: &amp;&amp;rinkti viską

# miUndo
source: &amp;&amp;Undo
lt: &amp;&amp;ndo

source: Redo
lt: Pakartoti

source: Select All
lt: Pasirinkti viską

source: Undo
lt: Atšaukti

# cursors.maximum
source: The number of cursors has been limited to {0}.
lt: Kursorių skaičius apribotas iki {0}.

# diff.tooLarge
source: Cannot compare files because one file is too large.
lt: Negalima palyginti failų, nes vienas failas yra per didelis.

# diffInsertIcon
source: Line decoration for inserts in the diff editor.
lt: Įterpinių linijų apipavidalinimas skirtumų redaktoriuje.

# diffRemoveIcon
source: Line decoration for removals in the diff editor.
lt: Linijų puošyba pašalinimams skirtumų redaktoriuje.

# blankLine
source: blank
lt: tuščia

# deleteLine
source: - {0} original line {1}
lt: - {0} pradinė linija {1}

# diffReviewCloseIcon
source: Icon for 'Close' in diff review.
lt: Skirtumų peržiūros piktograma "Uždaryti".

# diffReviewInsertIcon
source: Icon for 'Insert' in diff review.
lt: Skirtumų peržiūros piktograma "Įterpti".

# diffReviewRemoveIcon
source: Icon for 'Remove' in diff review.
lt: Skirtumų peržiūros piktograma "Pašalinti".

# editor.action.diffReview.next
source: Go to Next Difference
lt: Pereiti prie kito skirtumo

# editor.action.diffReview.prev
source: Go to Previous Difference
lt: Pereiti prie ankstesnio skirtumo

# equalLine
source: {0} original line {1} modified line {2}
lt: {0} pradinė eilutė {1} pakeista eilutė {2}

# header
source: Difference {0} of {1}: original line {2}, {3}, modified line {4}, {5}
lt: Skirtumas {0} nuo {1}: pradinė eilutė {2}, {3}, pakeista eilutė {4}, {5}

# insertLine
source: + {0} modified line {1}
lt: + {0} pakeista eilutė {1}

# label.close
source: Close
lt: Uždaryti

# more_lines_changed
source: {0} lines changed
lt: {0} pakeistos eilutės

source: no lines changed
lt: nėra pakeistų eilučių

# one_line_changed
source: 1 line changed
lt: Pakeista 1 eilutė

# unchangedLine
source: {0} unchanged line {1}
lt: {0} nepakeista eilutė {1}

# diff.clipboard.copyDeletedLineContent.label
source: Copy deleted line ({0})
lt: Nukopijuoti ištrintą eilutę ({0})

# diff.clipboard.copyDeletedLinesContent.label
source: Copy deleted lines
lt: Kopijuoti ištrintas eilutes

# diff.clipboard.copyDeletedLinesContent.single.label
source: Copy deleted line
lt: Kopijuoti ištrintą eilutę

# diff.inline.revertChange.label
source: Revert this change
lt: Grąžinti šį pakeitimą

# codeLens
source: Controls whether the editor shows CodeLens.
lt: Nustato, ar redaktorius rodo CodeLens.

# detectIndentation
source: Controls whether `#editor.tabSize#` and `#editor.insertSpaces#` will be automatically detected when a file is opened based on the file contents.
lt: Valdo, ar `#editor.tabSize#` ir `#editor.insertSpaces#` bus automatiškai nustatomos atidarant failą pagal failo turinį.

# editorConfigurationTitle
source: Editor
lt: Redaktorius

# ignoreTrimWhitespace
source: When enabled, the diff editor ignores changes in leading or trailing whitespace.
lt: Kai ši funkcija įjungta, skirtumų redaktorius ignoruoja pradinės arba galinės baltosios eilutės pakeitimus.

# insertSpaces
source: Insert spaces when pressing `Tab`. This setting is overridden based on the file contents when `#editor.detectIndentation#` is on.
lt: Įterpkite tarpelius, kai spaudžiate `Tab`. Šis nustatymas pakeičiamas atsižvelgiant į failo turinį, kai įjungtas `#editor.detectIndentation#`.

# largeFileOptimizations
source: Special handling for large files to disable certain memory intensive features.
lt: Specialus didelių failų tvarkymas, kad būtų išjungtos tam tikros daug atminties reikalaujančios funkcijos.

# maxComputationTime
source: Timeout in milliseconds after which diff computation is cancelled. Use 0 for no timeout.
lt: Laiko limitas milisekundėmis, po kurio skirtumo skaičiavimas atšaukiamas. Naudokite 0, jei laiko limito nėra.

# maxTokenizationLineLength
source: Lines above this length will not be tokenized for performance reasons
lt: Dėl našumo priežasčių ilgesnės nei šis ilgis eilutės nebus žymimos

# renderIndicators
source: Controls whether the diff editor shows +/- indicators for added/removed changes.
lt: Nustato, ar skirtumų redaktoriuje bus rodomi pridėtų/pašalintų pakeitimų +/- rodikliai.

# semanticHighlighting.configuredByTheme
source: Semantic highlighting is configured by the current color theme's `semanticHighlighting` setting.
lt: Semantinis paryškinimas konfigūruojamas pagal dabartinės spalvų temos `semanticHighlighting` nustatymą.

# semanticHighlighting.enabled
source: Controls whether the semanticHighlighting is shown for the languages that support it.
lt: Kontroliuoja, ar semanticHighlighting rodomas kalboms, kurios jį palaiko.

# semanticHighlighting.false
source: Semantic highlighting disabled for all color themes.
lt: Semantinis paryškinimas išjungtas visose spalvų temose.

# semanticHighlighting.true
source: Semantic highlighting enabled for all color themes.
lt: Įjungtas semantinis paryškinimas visose spalvų temose.

# sideBySide
source: Controls whether the diff editor shows the diff side by side or inline.
lt: Nustato, ar skirtumų redaktorius rodo skirtumus greta, ar eilutėje.

# stablePeek
source: Keep peek editors open even when double clicking their content or when hitting `Escape`.
lt: Žvilgtelėkite į redaktorių, net jei dukart spustelėjote jų turinį arba paspaudėte `Escape`.

# tabSize
source: The number of spaces a tab is equal to. This setting is overridden based on the file contents when `#editor.detectIndentation#` is on.
lt: Tarpelių skaičius, kuriam lygus skirtukas. Šis nustatymas pakeičiamas atsižvelgiant į failo turinį, kai įjungta `#editor.detectIndentation#`.

# trimAutoWhitespace
source: Remove trailing auto inserted whitespace.
lt: Pašalinti automatiškai įterptus baltuosius ženklus.

# wordBasedSuggestions
source: Controls whether completions should be computed based on words in the document.
lt: Nustato, ar papildymai turi būti skaičiuojami pagal dokumente esančius žodžius.

# wordBasedSuggestionsMode
source: Controls from which documents word based completions are computed.
lt: Nustato, iš kurių dokumentų skaičiuojami žodžiais pagrįsti papildymai.

# wordBasedSuggestionsMode.allDocuments
source: Suggest words from all open documents.
lt: Pasiūlykite žodžius iš visų atvirų dokumentų.

# wordBasedSuggestionsMode.currentDocument
source: Only suggest words from the active document.
lt: Siūlo tik aktyvaus dokumento žodžius.

# wordBasedSuggestionsMode.matchingDocuments
source: Suggest words from all open documents of the same language.
lt: Siūlo žodžius iš visų atvirų tos pačios kalbos dokumentų.

# wordWrap.inherit
source: Lines will wrap according to the `#editor.wordWrap#` setting.
lt: Eilutės bus apvyniojamos pagal `##editor.wordWrap#` nustatymą.

# wordWrap.off
source: Lines will never wrap.
lt: Linijos niekada nebus apvyniotos.

# wordWrap.on
source: Lines will wrap at the viewport width.
lt: Linijos bus užlenktos pagal rodinio plotį.

# acceptSuggestionOnCommitCharacter
source: Controls whether suggestions should be accepted on commit characters. For example, in JavaScript, the semi-colon (`;`) can be a commit character that accepts a suggestion and types that character.
lt: Kontroliuoja, ar turėtų būti priimami pasiūlymai dėl įsipareigojimo simbolių. Pavyzdžiui, "JavaScript" programoje dvitaškis (`;`) gali būti įsipareigojimo ženklas, kuris priima pasiūlymą ir įveda šį ženklą.

# acceptSuggestionOnEnter
source: Controls whether suggestions should be accepted on `Enter`, in addition to `Tab`. Helps to avoid ambiguity between inserting new lines or accepting suggestions.
lt: Nustato, ar siūlymai turėtų būti priimami ne tik `Tab`, bet ir `Enter`. Padeda išvengti dviprasmybių tarp naujų eilučių įterpimo ir pasiūlymų priėmimo.

# acceptSuggestionOnEnterSmart
source: Only accept a suggestion with `Enter` when it makes a textual change.
lt: Pasiūlymą su `Enter` priimkite tik tada, kai juo pakeičiamas tekstas.

# accessibilityPageSize
source: Controls the number of lines in the editor that can be read out by a screen reader at once. When we detect a screen reader we automatically set the default to be 500. Warning: this has a performance implication for numbers larger than the default.
lt: Valdo redaktoriaus eilučių, kurias vienu metu gali perskaityti ekrano skaitytuvas, skaičių. Kai aptinkame ekrano skaitytuvą, automatiškai nustatome, kad numatytoji reikšmė yra 500. Įspėjimas: tai turi įtakos našumui, jei skaičiai didesni už numatytąjį.

# accessibilitySupport
source: Controls whether the editor should run in a mode where it is optimized for screen readers. Setting to on will disable word wrapping.
lt: Nustato, ar redaktorius turėtų veikti tokiu režimu, kad būtų optimizuotas ekrano skaitytuvams. Nustačius įjungta, žodžių apvyniojimas bus išjungtas.

# accessibilitySupport.auto
source: The editor will use platform APIs to detect when a Screen Reader is attached.
lt: Redaktorius naudos platformos API, kad nustatytų, ar prijungtas ekrano skaitytuvas.

# accessibilitySupport.off
source: The editor will never be optimized for usage with a Screen Reader.
lt: Redaktorius niekada nebus optimizuotas naudoti su ekrano skaitymo programa.

# accessibilitySupport.on
source: The editor will be permanently optimized for usage with a Screen Reader. Word wrapping will be disabled.
lt: Redaktorius bus nuolat optimizuotas naudoti su ekrano skaitytuvu. Žodžių apvyniojimas bus išjungtas.

# alternativeDeclarationCommand
source: Alternative command id that is being executed when the result of 'Go to Declaration' is the current location.
lt: Alternatyvios komandos, kuri vykdoma, kai "Go to Declaration" rezultatas yra dabartinė vieta, ID.

# alternativeDefinitionCommand
source: Alternative command id that is being executed when the result of 'Go to Definition' is the current location.
lt: Alternatyvios komandos, kuri vykdoma, kai "Go to Definition" rezultatas yra dabartinė vieta, ID.

# alternativeImplementationCommand
source: Alternative command id that is being executed when the result of 'Go to Implementation' is the current location.
lt: Alternatyvios komandos, kuri vykdoma, kai "Go to Implementation" rezultatas yra dabartinė vieta, ID.

# alternativeReferenceCommand
source: Alternative command id that is being executed when the result of 'Go to Reference' is the current location.
lt: Alternatyvios komandos, kuri vykdoma, kai "Go to Reference" rezultatas yra dabartinė vieta, ID.

# alternativeTypeDefinitionCommand
source: Alternative command id that is being executed when the result of 'Go to Type Definition' is the current location.
lt: Alternatyvios komandos, kuri vykdoma, kai "Go to Type Definition" rezultatas yra dabartinė vieta, ID.

# autoClosingBrackets
source: Controls whether the editor should automatically close brackets after the user adds an opening bracket.
lt: Nustato, ar redaktorius turėtų automatiškai uždaryti skliaustus, kai naudotojas prideda atidaromąjį skliaustą.

# autoClosingDelete
source: Controls whether the editor should remove adjacent closing quotes or brackets when deleting.
lt: Nustato, ar trinant redaktorius turėtų pašalinti gretimas uždaromąsias kabutes arba skliaustelius.

# autoClosingOvertype
source: Controls whether the editor should type over closing quotes or brackets.
lt: Nustato, ar redaktorius turėtų rašyti virš uždaromųjų kabučių arba skliaustų.

# autoClosingQuotes
source: Controls whether the editor should automatically close quotes after the user adds an opening quote.
lt: Nustato, ar redaktorius turėtų automatiškai uždaryti kabutes, kai naudotojas prideda pradinę kabutę.

# autoIndent
source: Controls whether the editor should automatically adjust the indentation when users type, paste, move or indent lines.
lt: Nustato, ar redaktorius turėtų automatiškai koreguoti įtrauką, kai naudotojai įveda, įklijuoja, perkelia arba įterpia eilutes.

# autoSurround
source: Controls whether the editor should automatically surround selections when typing quotes or brackets.
lt: Nustato, ar redaktorius turėtų automatiškai apsupti pasirinkimus, kai rašote kabutes arba skliaustelius.

# codeActions
source: Enables the code action lightbulb in the editor.
lt: Redaktoriuje įjungiama kodo veiksmo lemputė.

# codeLensFontFamily
source: Controls the font family for CodeLens.
lt: Valdo CodeLens šrifto šeimą.

# codeLensFontSize
source: Controls the font size in pixels for CodeLens. When set to `0`, the 90% of `#editor.fontSize#` is used.
lt: Valdo CodeLens šrifto dydį pikseliais. Kai nustatyta `0`, naudojamas 90% of `#reditor.fontSize#`.

# colorDecorators
source: Controls whether the editor should render the inline color decorators and color picker.
lt: Kontroliuoja, ar redaktorius turėtų atvaizduoti įvestus spalvų dekoratorius ir spalvų rinkiklį.

# columnSelection
source: Enable that the selection with the mouse and keys is doing column selection.
lt: Įgalinkite, kad pasirinkimo pelės ir klavišų pagalba būtų atliekamas stulpelių pasirinkimas.

# comments.ignoreEmptyLines
source: Controls if empty lines should be ignored with toggle, add or remove actions for line comments.
lt: Nustato, ar tuščios eilutės turėtų būti ignoruojamos naudojant perjungimo, pridėjimo arba pašalinimo veiksmus, skirtus eilučių komentarams.

# comments.insertSpace
source: Controls whether a space character is inserted when commenting.
lt: Nustato, ar komentuojant įterpiamas tarpo ženklas.

# copyWithSyntaxHighlighting
source: Controls whether syntax highlighting should be copied into the clipboard.
lt: Nustato, ar sintaksės paryškinimas turi būti nukopijuotas į iškarpinę.

# cursorBlinking
source: Control the cursor animation style.
lt: Valdykite žymeklio animacijos stilių.

# cursorSmoothCaretAnimation
source: Controls whether the smooth caret animation should be enabled.
lt: Nustato, ar turi būti įjungta sklandi caret animacija.

# cursorStyle
source: Controls the cursor style.
lt: Valdo žymeklio stilių.

# cursorSurroundingLines
source: Controls the minimal number of visible leading and trailing lines surrounding the cursor. Known as 'scrollOff' or 'scrollOffset' in some other editors.
lt: Nustato minimalų matomų pradinių ir galinių linijų, supančių žymeklį, skaičių. Kai kuriuose kituose redaktoriuose žinomas kaip "scrollOff" arba "scrollOffset".

# cursorSurroundingLinesStyle
source: Controls when `cursorSurroundingLines` should be enforced.
lt: Nustato, kada turi būti taikomas `cursorSurroundingLines`.

# cursorSurroundingLinesStyle.all
source: `cursorSurroundingLines` is enforced always.
lt: `cursorSurroundingLines` taikomas visada.

# cursorSurroundingLinesStyle.default
source: `cursorSurroundingLines` is enforced only when triggered via the keyboard or API.
lt: `cursorSurroundingLines` yra įgyvendinamas tik tada, kai jis sukeliamas klaviatūra arba API.

# cursorWidth
source: Controls the width of the cursor when `#editor.cursorStyle#` is set to `line`.
lt: Valdo žymeklio plotį, kai `#editor.cursorStyle#` nustatyta į `line`.

# definitionLinkOpensInPeek
source: Controls whether the Go to Definition mouse gesture always opens the peek widget.
lt: Nustato, ar pelės gestas "Go to Definition" visada atveria žvilgsnio valdiklį.

# deprecated
source: This setting is deprecated, please use separate settings like 'editor.suggest.showKeywords' or 'editor.suggest.showSnippets' instead.
lt: Šis nustatymas nebenaudojamas, vietoj jo naudokite atskirus nustatymus, pavyzdžiui, 'editor.suggest.showKeywords' arba 'editor.suggest.showSnippets'.

# dragAndDrop
source: Controls whether the editor should allow moving selections via drag and drop.
lt: Nustato, ar redaktorius turėtų leisti perkelti pasirinkimus vilkimo ir nuleidimo būdu.

# editor.autoClosingBrackets.beforeWhitespace
source: Autoclose brackets only when the cursor is to the left of whitespace.
lt: Skliaustelius automatiškai uždaro tik tada, kai žymeklis yra kairėje baltosios eilutės pusėje.

# editor.autoClosingBrackets.languageDefined
source: Use language configurations to determine when to autoclose brackets.
lt: Naudokite kalbos konfigūracijas, kad nustatytumėte, kada automatiškai uždaryti skliaustelius.

# editor.autoClosingDelete.auto
source: Remove adjacent closing quotes or brackets only if they were automatically inserted.
lt: Šalinkite gretimas uždaromąsias kabutes arba skliaustelius tik tuo atveju, jei jie buvo įterpti automatiškai.

# editor.autoClosingOvertype.auto
source: Type over closing quotes or brackets only if they were automatically inserted.
lt: Uždaromąsias kabutes arba skliaustelius rašykite tik tada, jei jie buvo įterpti automatiškai.

# editor.autoClosingQuotes.beforeWhitespace
source: Autoclose quotes only when the cursor is to the left of whitespace.
lt: Automatiškai uždaromos kabutės tik tada, kai žymeklis yra kairėje baltosios eilutės pusėje.

# editor.autoClosingQuotes.languageDefined
source: Use language configurations to determine when to autoclose quotes.
lt: Naudokite kalbos konfigūracijas, kad nustatytumėte, kada automatiškai uždaryti citatas.

# editor.autoIndent.advanced
source: The editor will keep the current line's indentation, honor language defined brackets and invoke special onEnterRules defined by languages.
lt: Redaktorius išlaikys dabartinės eilutės įtrauką, atsižvelgs į kalbos apibrėžtus skliaustelius ir taikys specialias kalbų apibrėžtas "onEnterRules" taisykles.

# editor.autoIndent.brackets
source: The editor will keep the current line's indentation and honor language defined brackets.
lt: Redaktorius išlaikys dabartinės eilutės įtrauką ir laikysis kalbos apibrėžtų skliaustų.

# editor.autoIndent.full
source: The editor will keep the current line's indentation, honor language defined brackets, invoke special onEnterRules defined by languages, and honor indentationRules defined by languages.
lt: Redaktorius išlaikys dabartinės eilutės įtrauką, laikysis kalbos apibrėžtų skliaustų, taikys specialias kalbų apibrėžtas "onEnterRules" ir laikysis kalbų apibrėžtų įtraukos taisyklių.

# editor.autoIndent.keep
source: The editor will keep the current line's indentation.
lt: Redaktorius išlaikys dabartinės eilutės įtrauką.

# editor.autoIndent.none
source: The editor will not insert indentation automatically.
lt: Redaktorius automatiškai neįterpia įtraukos.

# editor.autoSurround.brackets
source: Surround with brackets but not quotes.
lt: Apjuoskite skliaustais, bet ne kabutėmis.

# editor.autoSurround.languageDefined
source: Use language configurations to determine when to automatically surround selections.
lt: Naudokite kalbos konfigūracijas, kad nustatytumėte, kada automatiškai apsupti pasirinkimus.

# editor.autoSurround.quotes
source: Surround with quotes but not brackets.
lt: Apjuoskite kabutėmis, bet ne skliaustais.

# editor.editor.gotoLocation.multipleDeclarations
source: Controls the behavior the 'Go to Declaration'-command when multiple target locations exist.
lt: Kontroliuoja, kaip elgtis komandai "Eiti į deklaraciją", kai yra kelios tikslinės vietos.

# editor.editor.gotoLocation.multipleDefinitions
source: Controls the behavior the 'Go to Definition'-command when multiple target locations exist.
lt: Kontroliuoja, kaip elgtis komandai "Eiti į apibrėžtį", kai yra kelios tikslinės vietos.

# editor.editor.gotoLocation.multipleImplemenattions
source: Controls the behavior the 'Go to Implementations'-command when multiple target locations exist.
lt: Kontroliuoja, kaip elgtis komandai "Go to Implementations", kai yra kelios tikslinės vietos.

# editor.editor.gotoLocation.multipleReferences
source: Controls the behavior the 'Go to References'-command when multiple target locations exist.
lt: Kontroliuoja, kaip elgtis komandai "Eiti į nuorodas", kai yra kelios tikslinės vietos.

# editor.editor.gotoLocation.multipleTypeDefinitions
source: Controls the behavior the 'Go to Type Definition'-command when multiple target locations exist.
lt: Kontroliuoja, kaip elgtis komandai "Eiti į tipo apibrėžtį", kai yra kelios tikslinės vietos.

# editor.find.autoFindInSelection.always
source: Always turn on Find in selection automatically.
lt: Visada automatiškai įjunkite funkciją Ieškoti pasirinkime.

# editor.find.autoFindInSelection.multiline
source: Turn on Find in selection automatically when multiple lines of content are selected.
lt: Automatiškai įjunkite funkciją Ieškoti pasirinkime, kai pasirenkamos kelios turinio eilutės.

# editor.find.autoFindInSelection.never
source: Never turn on Find in selection automatically (default).
lt: Niekada automatiškai neįjungti funkcijos Ieškoti pasirinkime (numatytoji parinktis).

# editor.gotoLocation.multiple.deprecated
source: This setting is deprecated, please use separate settings like 'editor.editor.gotoLocation.multipleDefinitions' or 'editor.editor.gotoLocation.multipleImplementations' instead.
lt: Šis nustatymas nebenaudojamas, vietoj jo naudokite atskirus nustatymus, pavyzdžiui, "editor.editor.gotoLocation.multipleDefinitions" arba "editor.editor.gotoLocation.multipleImplementations".

# editor.gotoLocation.multiple.goto
source: Go to the primary result and enable peek-less navigation to others
lt: Eikite į pagrindinį rezultatą ir įgalinkite navigaciją be žvilgsnio į kitus

# editor.gotoLocation.multiple.gotoAndPeek
source: Go to the primary result and show a peek view
lt: Eikite į pirminį rezultatą ir parodykite žvilgsnio vaizdą

# editor.gotoLocation.multiple.peek
source: Show peek view of the results (default)
lt: Rodyti rezultatų žvilgsnio vaizdą (numatytoji reikšmė)

# editor.suggest.showClasss
source: When enabled IntelliSense shows `class`-suggestions.
lt: Kai įjungta, IntelliSense rodo `klasės` siūlymus.

# editor.suggest.showColors
source: When enabled IntelliSense shows `color`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `spalvos` pasiūlymus.

# editor.suggest.showConstants
source: When enabled IntelliSense shows `constant`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo "pastovius" pasiūlymus.

# editor.suggest.showConstructors
source: When enabled IntelliSense shows `constructor`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `konstruktoriaus` pasiūlymus.

# editor.suggest.showCustomcolors
source: When enabled IntelliSense shows `customcolor`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo "Customcolor" pasiūlymus.

# editor.suggest.showDeprecated
source: When enabled IntelliSense shows `deprecated`-suggestions.
lt: Kai įjungta, IntelliSense rodo `deprecated` pasiūlymus.

# editor.suggest.showEnumMembers
source: When enabled IntelliSense shows `enumMember`-suggestions.
lt: Kai įjungta, IntelliSense rodo `enumMember` pasiūlymus.

# editor.suggest.showEnums
source: When enabled IntelliSense shows `enum`-suggestions.
lt: Kai įjungta, IntelliSense rodo `enum` pasiūlymus.

# editor.suggest.showEvents
source: When enabled IntelliSense shows `event`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `įvykių` pasiūlymus.

# editor.suggest.showFields
source: When enabled IntelliSense shows `field`-suggestions.
lt: Kai įjungta, "IntelliSense" rodo `polio` pasiūlymus.

# editor.suggest.showFiles
source: When enabled IntelliSense shows `file`-suggestions.
lt: Kai įjungta, IntelliSense rodo `failų` siūlymus.
