Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_editor.xlf
Languages: lt

# symbolHighlight
source: Background color of highlighted symbol, like for go to definition or go next/previous symbol. The color must not be opaque so as not to hide underlying decorations.
lt: Išryškinto simbolio fono spalva, pvz., pereiti prie apibrėžties arba pereiti prie kito / ankstesnio simbolio. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# symbolHighlightBorder
source: Background color of the border around highlighted symbols.
lt: Fono spalva, kuria žymimi išryškinti simboliai.

# unnecessaryCodeBorder
source: Border color of unnecessary (unused) source code in the editor.
lt: Nereikalingo (nenaudojamo) šaltinio kodo apvado spalva redaktoriuje.

# unnecessaryCodeOpacity
source: Opacity of unnecessary (unused) source code in the editor. For example, "#000000c0" will render the code with 75% opacity. For high contrast themes, use the 'editorUnnecessaryCode.border' theme color to underline unnecessary code instead of fading it out.
lt: Nereikalingo (nenaudojamo) šaltinio kodo neskaidrumas redaktoriuje. Pavyzdžiui, "#000000c0" kodas bus atvaizduojamas 75% o neskaidrumo. Didelio kontrasto temose naudokite temos spalvą "editorUnnecessaryCode.border", kad pabrauktumėte nereikalingą kodą, užuot jį išblukinę.
