Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_platform.xlf
Languages: lt_lt

# config.property.duplicate
source: Cannot register '{0}'. This property is already registered.
lt_lt: Negalima užregistruoti '{0}'. Ši savybė jau užregistruota.

# config.property.empty
source: Cannot register an empty property
lt_lt: Negalima užregistruoti tuščios nuosavybės

# config.property.languageDefault
source: Cannot register '{0}'. This matches property pattern '\\[.*\\]$' for describing language specific editor settings. Use 'configurationDefaults' contribution.
lt_lt: Negalima užregistruoti '{0}'. Tai atitinka ypatybės šabloną '\\[.*\\]$', skirtą kalbai būdingiems redaktoriaus nustatymams aprašyti. Naudokite 'configurationDefaults' indėlį.

# defaultLanguageConfiguration.description
source: Configure settings to be overridden for {0} language.
lt_lt: Sukonfigūruokite nustatymus, kurie bus pakeisti {0} kalba.

# defaultLanguageConfigurationOverrides.title
source: Default Language Configuration Overrides
lt_lt: Numatytoji kalbos konfigūracija pakeičia

# overrideSettings.defaultDescription
source: Configure editor settings to be overridden for a language.
lt_lt: Sukonfigūruokite redaktoriaus nustatymus, kurie turi būti pakeisti kalbos atžvilgiu.

# overrideSettings.errorMessage
source: This setting does not support per-language configuration.
lt_lt: Šis nustatymas nepalaiko kiekvienos kalbos konfigūracijos.

# getContextKeyInfo
source: A command that returns information about context keys
lt_lt: Komanda, grąžinanti informaciją apie konteksto raktus

# inputFocus
source: Whether keyboard focus is inside an input box
lt_lt: Ar klaviatūros fokusas yra įvesties lange

# isIOS
source: Whether the operating system is IOS
lt_lt: Ar operacinė sistema yra IOS

# isLinux
source: Whether the operating system is Linux
lt_lt: Ar operacinė sistema yra Linux

# isMac
source: Whether the operating system is macOS
lt_lt: Ar operacinė sistema yra macOS

# isMacNative
source: Whether the operating system is macOS on a non-browser platform
lt_lt: Ar operacinė sistema yra macOS ne naršyklės platformoje

# isWeb
source: Whether the platform is a web browser
lt_lt: Ar platforma yra žiniatinklio naršyklė

# isWindows
source: Whether the operating system is Windows
lt_lt: Ar operacinė sistema yra Windows

# moreFile
source: ...1 additional file not shown
lt_lt: ...1 failas nerodomas

# moreFiles
source: ...{0} additional files not shown
lt_lt: ...{0} failai nerodomi

source: Open
lt_lt: Atverti

source: Open File
lt_lt: Atverti failą

source: Open Folder
lt_lt: Atverti aplanką

# openWorkspace
source: &&Open
lt_lt: &&Atverti

# openWorkspaceTitle
source: Open Workspace
lt_lt: Atverti darbo erdvę

# add
source: Add folder(s) to the last active window.
lt_lt: Į paskutinį aktyvų langą pridėkite aplanką (-us).

# category
source: Filters installed extensions by provided category, when using --list-extensions.
lt_lt: Filtruoja įdiegtus plėtinius pagal nurodytą kategoriją, kai naudojama parinktis --list-extensions.

# diff
source: Compare two files with each other.
lt_lt: Palyginkite du failus tarpusavyje.

# disableExtension
source: Disable an extension.
lt_lt: Išjungti plėtinį.

# disableExtensions
source: Disable all installed extensions.
lt_lt: Išjunkite visus įdiegtus plėtinius.

# disableGPU
source: Disable GPU hardware acceleration.
lt_lt: Išjunkite GPU aparatinį spartinimą.

# experimentalApis
source: Enables proposed API features for extensions. Can receive one or more extension IDs to enable individually.
lt_lt: Įjungiamos siūlomos API funkcijos plėtiniams. Gali gauti vieną ar daugiau plėtinių ID, kuriuos galima įjungti atskirai.

# extensionHomePath
source: Set the root path for extensions.
lt_lt: Nustatykite plėtinių šakninį kelią.

source: Extensions Management
lt_lt: Plėtinių valdymas

# goto
source: Open a file at the path on the specified line and character position.
lt_lt: Atidaryti failą nurodytoje eilutėje ir simbolių padėtyje nurodytu keliu.

# help
source: Print usage.
lt_lt: Spausdinimo naudojimas.

# inspect-brk-extensions
source: Allow debugging and profiling of extensions with the extension host being paused after start. Check the developer tools for the connection URI.
lt_lt: Leidžiama derinti ir profiliuoti plėtinius, kai paleidus plėtinio prieglobstį jis sustabdomas. Patikrinkite kūrėjo įrankius dėl ryšio URI.

# inspect-extensions
source: Allow debugging and profiling of extensions. Check the developer tools for the connection URI.
lt_lt: Leidžia derinti ir profiliuoti plėtinius. Patikrinkite kūrėjų įrankius dėl ryšio URI.

# installExtension
source: Installs or updates the extension. The identifier of an extension is always `${publisher}.${name}`. Use `--force` argument to update to latest version. To install a specific version provide `@${version}`. For example: 'vscode.csharp@1.2.3'.
lt_lt: Įdiegia arba atnaujina plėtinį. Plėtinio identifikatorius visada yra `${publisher}.${name}`. Naudokite argumentą `--force`, jei norite atnaujinti iki naujausios versijos. Norėdami įdiegti konkrečią versiją, nurodykite `@${version}`. Pavyzdžiui: 'vscode.csharp@1.2.3'.

# listExtensions
source: List the installed extensions.
lt_lt: Išvardykite įdiegtus plėtinius.

# locale
source: The locale to use (e.g. en-US or zh-TW).
lt_lt: Naudotina vietinė kalba (pvz., en-US arba zh-TW).

# log
source: Log level to use. Default is 'info'. Allowed values are 'critical', 'error', 'warn', 'info', 'debug', 'trace', 'off'.
lt_lt: Naudotinas žurnalo lygis. Numatytoji reikšmė yra "info". Leidžiamos reikšmės yra "critical", "error", "warn", "info", "debug", "trace", "off".

# maxMemory
source: Max memory size for a window (in Mbytes).
lt_lt: Didžiausias lango atminties dydis (Mbytes).

# newWindow
source: Force to open a new window.
lt_lt: Priversti atidaryti naują langą.

source: options
lt_lt: parinktys

# optionsUpperCase
source: Options
lt_lt: Nustatymai

source: paths
lt_lt: keliai

# prof-startup
source: Run CPU profiler during startup.
lt_lt: Paleidimo metu paleiskite procesoriaus profilerį.

# reuseWindow
source: Force to open a file or folder in an already opened window.
lt_lt: Priversti atidaryti failą arba aplanką jau atidarytame lange.

# showVersions
source: Show versions of installed extensions, when using --list-extensions.
lt_lt: Rodomos įdiegtų plėtinių versijos, kai naudojama parinktis --list-extensions.

# status
source: Print process usage and diagnostics information.
lt_lt: Spausdinti proceso naudojimo ir diagnostikos informaciją.

# stdinUnix
source: To read from stdin, append '-' (e.g. 'ps aux | grep code | {0} -')
lt_lt: Jei norite skaityti iš stdin, pridėkite '-' (pvz., 'ps aux | grep code | {0} -')

# stdinWindows
source: To read output from another program, append '-' (e.g. 'echo Hello World | {0} -')
lt_lt: Norėdami perskaityti išvestį iš kitos programos, pridėkite '-' (pvz., 'echo Hello World | {0} -')

# telemetry
source: Shows all telemetry events which VS code collects.
lt_lt: Rodomi visi telemetrijos įvykiai, kuriuos renka VS kodas.

source: Troubleshooting
lt_lt: Problemų sprendimas

# turn sync
source: Turn sync on or off.
lt_lt: Įjunkite arba išjunkite sinchronizavimą.

# uninstallExtension
source: Uninstalls an extension.
lt_lt: Išinstaliuoja plėtinį.

source: Unknown commit
lt_lt: Nežinomas įsipareigojimas

source: Unknown version
lt_lt: Nežinoma versija

source: Usage
lt_lt: Panaudojimas

# userDataDir
source: Specifies the directory that user data is kept in. Can be used to open multiple distinct instances of Code.
lt_lt: Nurodomas katalogas, kuriame saugomi naudotojo duomenys. Gali būti naudojamas keliems skirtingiems Code egzemplioriams atidaryti.

# verbose
source: Print verbose output (implies --wait).
lt_lt: Spausdinti verbalinę išvestį (reiškia --wait).

# version
source: Print version.
lt_lt: Spausdinta versija.

# wait
source: Wait for the files to be closed before returning.
lt_lt: Prieš grįždami palaukite, kol failai bus uždaryti.

# gotoValidation
source: Arguments in `--goto` mode should be in the format of `FILE(:LINE(:CHARACTER))`.
lt_lt: Argumentai `--goto` režimu turi būti `FILE(:LINE(:CHARACTER))` formato.

# multipleValues
source: Option '{0}' is defined more than once. Using value '{1}.'
lt_lt: Parinktis "{0}" apibrėžta daugiau nei vieną kartą. Naudojant reikšmę "{1}

# unknownOption
source: Warning: '{0}' is not in the list of known options, but still passed to Electron/Chromium.
lt_lt: Įspėjimas: '{0}' nėra žinomų parinkčių sąraše, bet vis tiek perduodama Electron/Chromium.

source: Extensions
lt_lt: Plėtiniai

source: Preferences
lt_lt: Nustatymai

# alreadyInstalled
source: Extension '{0}' is already installed.
lt_lt: Plėtinis '{0}' jau įdiegtas.

# alreadyInstalled-checkAndUpdate
source: Extension '{0}' v{1} is already installed. Use '--force' option to update to latest version or provide '@<version>' to install a specific version, for example: '{2}@1.2.3'.
lt_lt: Plėtinis '{0}' v{1} jau įdiegtas. Naudokite parinktį '--force', kad atnaujintumėte iki naujausios versijos, arba nurodykite '@<version>', kad įdiegtumėte konkrečią versiją, pavyzdžiui: '{2}@1.2.3'</version>.

# builtin
source: Extension '{0}' is a Built-in extension and cannot be uninstalled
lt_lt: Plėtinis "{0}" yra integruotasis plėtinys ir jo negalima pašalinti

# cancelInstall
source: Cancelled installing extension '{0}'.
lt_lt: Atšauktas plėtinio '{0}' diegimas.

# cancelVsixInstall
source: Cancelled installing extension '{0}'.
lt_lt: Atšauktas plėtinio '{0}' diegimas.

# forceDowngrade
source: A newer version of extension '{0}' v{1} is already installed. Use '--force' option to downgrade to older version.
lt_lt: Jau įdiegta naujesnė plėtinio '{0}' versija v{1}. Naudokite '--force' parinktį, kad pereitumėte prie senesnės versijos.

# forceUninstall
source: Extension '{0}' is marked as a Built-in extension by user. Please use '--force' option to uninstall it.
lt_lt: Naudotojas pažymėjo plėtinį '{0}' kaip integruotąjį plėtinį. Norėdami jį pašalinti, naudokite parinktį '--force'.

# installation failed
source: Failed Installing Extensions: {0}
lt_lt: Nepavyko įdiegti plėtinių: {0}

# installing
source: Installing extension '{0}'...
lt_lt: Įdiegti plėtinį '{0}'...

# installing builtin
source: Installing builtin extension '{0}'...
lt_lt: Įdiegiamas integruotas plėtinys '{0}'...

# installing builtin with version
source: Installing builtin extension '{0}' v{1}...
lt_lt: Įdiegiamas integruotas plėtinys '{0}' v{1}...

# installing with version
source: Installing extension '{0}' v{1}...
lt_lt: Įdiegti plėtinį '{0}' v{1}...

source: Installing extensions...
lt_lt: Priedų diegimas...

# installingExtensionsOnLocation
source: Installing extensions on {0}...
lt_lt: Įdiegti plėtinius į {0}...

# listFromLocation
source: Extensions installed on {0}:
lt_lt: Įdiegti plėtiniai {0}:

# notFound
source: Extension '{0}' not found.
lt_lt: Nerastas plėtinys '{0}'.

# notInstalled
source: Extension '{0}' is not installed.
lt_lt: Plėtinis '{0}' neįdiegtas.

# notInstalleddOnLocation
source: Extension '{0}' is not installed on {1}.
lt_lt: Plėtinis '{0}' nėra įdiegtas {1}.

# successInstall
source: Extension '{0}' v{1} was successfully installed.
lt_lt: Sėkmingai įdiegtas plėtinys '{0}' v{1}.

# successUninstall
source: Extension '{0}' was successfully uninstalled!
lt_lt: Plėtinis '{0}' sėkmingai pašalintas!

# successUninstallFromLocation
source: Extension '{0}' was successfully uninstalled from {1}!
lt_lt: Plėtinis '{0}' sėkmingai pašalintas iš {1}!

# successVsixInstall
source: Extension '{0}' was successfully installed.
lt_lt: Plėtinis '{0}' sėkmingai įdiegtas.

# uninstalling
source: Uninstalling {0}...
lt_lt: Pašalinti {0}...

# updateMessage
source: Updating the extension '{0}' to the version {1}
lt_lt: Pratęsimo '{0}' atnaujinimas į versiją {1}

# useId
source: Make sure you use the full extension ID, including the publisher, e.g.: {0}
lt_lt: Įsitikinkite, kad naudojate visą plėtinio ID, įskaitant leidėją, pvz: {0}

# exeRecommended
source: You have {0} installed on your system. Do you want to install the recommended extensions for it?
lt_lt: Jūsų sistemoje įdiegta {0}. Ar norite įdiegti jai rekomenduojamus plėtinius?

# MarketPlaceDisabled
source: Marketplace is not enabled
lt_lt: "Marketplace" nėra įjungta

# Not a Marketplace extension
source: Only Marketplace Extensions can be reinstalled
lt_lt: Galima iš naujo įdiegti tik "Marketplace" plėtinius

# exitCode
source: Unable to install the extension. Please Exit and Start VS Code before reinstalling.
lt_lt: Nepavyksta įdiegti plėtinio. Prieš diegdami iš naujo, išeikite ir paleiskite "VS Code".

# incompatible
source: Unable to install extension '{0}' as it is not compatible with VS Code '{1}'.
lt_lt: Nepavyksta įdiegti plėtinio "{0}", nes jis nesuderinamas su VS kodu "{1}".

# malicious extension
source: Can't install extension since it was reported to be problematic.
lt_lt: Negalima įdiegti plėtinio, nes buvo pranešta, kad jis kelia problemų.

# multipleDependentsError
source: Cannot uninstall '{0}' extension. '{1}', '{2}' and other extension depend on this.
lt_lt: Negalima pašalinti plėtinio "{0}". '{1}', '{2}' ir kiti plėtiniai priklauso nuo šio plėtinio.

# multipleIndirectDependentsError
source: Cannot uninstall '{0}' extension. It includes uninstalling '{1}' extension and '{2}', '{3}' and other extensions depend on this.
lt_lt: Negalima pašalinti plėtinio "{0}". Tai apima ir '{1}' plėtinio ir nuo jo priklausančių '{2}', '{3}' bei kitų plėtinių pašalinimą.

# notExists
source: Could not find extension
lt_lt: Nepavyko rasti plėtinio

# notFoundCompatibleDependency
source: Unable to install '{0}' extension because it is not compatible with the current version of VS Code (version {1}).
lt_lt: Nepavyksta įdiegti plėtinio "{0}", nes jis nesuderinamas su dabartine "VS Code" versija (versija {1}).

# quitCode
source: Unable to install the extension. Please Quit and Start VS Code before reinstalling.
lt_lt: Nepavyksta įdiegti plėtinio. Prieš diegdami iš naujo, užbaigite ir paleiskite VS Code.

# removeError
source: Error while removing the extension: {0}. Please Quit and Start VS Code before trying again.
lt_lt: Klaida šalinant plėtinį: {0}. Prieš bandydami dar kartą, nutraukite ir paleiskite VS Code.

# restartCode
source: Please restart VS Code before reinstalling {0}.
lt_lt: Prieš iš naujo įdiegdami {0}, iš naujo paleiskite VS kodą.

# singleDependentError
source: Cannot uninstall '{0}' extension. '{1}' extension depends on this.
lt_lt: Negalima pašalinti plėtinio "{0}". '{1}' plėtinys priklauso nuo šio plėtinio.

# singleIndirectDependentError
source: Cannot uninstall '{0}' extension . It includes uninstalling '{1}' extension and '{2}' extension depends on this.
lt_lt: Negalima pašalinti plėtinio '{0}'. Tai apima ir "{1}" plėtinio ir "{2}" plėtinio pašalinimą, kuris nuo to priklauso.

# twoDependentsError
source: Cannot uninstall '{0}' extension. '{1}' and '{2}' extensions depend on this.
lt_lt: Negalima pašalinti plėtinio "{0}". '{1}' ir '{2}' plėtiniai nuo to priklauso.

# twoIndirectDependentsError
source: Cannot uninstall '{0}' extension. It includes uninstalling '{1}' extension and '{2}' and '{3}' extensions depend on this.
lt_lt: Negalima pašalinti plėtinio "{0}". Jis apima ir plėtinio '{1}' pašalinimą, o plėtiniai '{2}' ir '{3}' nuo jo priklauso.

# invalidManifest
source: VSIX invalid: package.json is not a JSON file.
lt_lt: VSIX negalioja: package.json nėra JSON failas.

# cannot read
source: Cannot read the extension from {0}
lt_lt: Negalima nuskaityti plėtinio iš {0}

# errorDeleting
source: Unable to delete the existing folder '{0}' while installing the extension '{1}'. Please delete the folder manually and try again
lt_lt: Nepavyksta ištrinti esamo aplanko "{0}" diegiant plėtinį "{1}". Ištrinkite aplanką rankiniu būdu ir bandykite dar kartą

# invalidManifest
source: Extension invalid: package.json is not a JSON file.
lt_lt: Plėtinis negalioja: package.json nėra JSON failas.

# renameError
source: Unknown error while renaming {0} to {1}
lt_lt: Nežinoma klaida pervadinant {0} į {1}

# versionMismatch
source: Extension is not compatible with Code {0}. Extension requires: {1}.
lt_lt: Pratęsimas nesuderinamas su kodu {0}. Išplėtimui reikia: {1}.

# versionSpecificity1
source: Version specified in `engines.vscode` ({0}) is not specific enough. For vscode versions before 1.0.0, please define at a minimum the major and minor desired version. E.g. ^0.10.0, 0.10.x, 0.11.0, etc.
lt_lt: Įraše `engines.vscode` ({0}) nurodyta versija yra nepakankamai konkreti. Jei vscode versijos yra ankstesnės nei 1.0.0, nurodykite bent jau norimą pagrindinę ir šalutinę versiją. Pvz., ^0.10.0, 0.10.x, 0.11.0 ir t. t.

# versionSpecificity2
source: Version specified in `engines.vscode` ({0}) is not specific enough. For vscode versions after 1.0.0, please define at a minimum the major desired version. E.g. ^1.10.0, 1.10.x, 1.x.x, 2.x.x, etc.
lt_lt: Įraše `engines.vscode` ({0}) nurodyta versija yra nepakankamai konkreti. Jei vscode versijos yra vėlesnės nei 1.0.0, nurodykite bent jau pagrindinę pageidaujamą versiją. Pvz., ^1.10.0, 1.10.x, 1.x.x, 2.x.x ir t. t.

# versionSyntax
source: Could not parse `engines.vscode` value {0}. Please use, for example: ^1.22.0, ^1.22.x, etc.
lt_lt: Nepavyko išnarplioti `engines.vscode` vertės {0}. Prašome naudoti, pvz: ^1.22.0, ^1.22.x ir t. t.

# console.title
source: VS Code Console
lt_lt: VS kodo konsolė

# ext.term.app.not.found
source: can't find terminal application '{0}'
lt_lt: neranda terminalo programos '{0}'

# linux.term.failed
source: '{0}' failed with exit code {1}
lt_lt: '{0}' nepavyko, išėjimo kodas {1}

# mac.terminal.script.failed
source: Script '{0}' failed with exit code {1}
lt_lt: Skriptas '{0}' nepavyko, išėjimo kodas {1}

# mac.terminal.type.not.supported
source: '{0}' not supported
lt_lt: '{0}' nepalaikomas

# press.any.key
source: Press any key to continue...
lt_lt: Norėdami tęsti, paspauskite bet kurį klavišą...

# deleteFailedNonEmptyFolder
source: Unable to delete non-empty folder '{0}'.
lt_lt: Nepavyksta ištrinti ne tuščio aplanko '{0}'.

# deleteFailedNotFound
source: Unable to delete non-existing file '{0}'
lt_lt: Nepavyksta ištrinti neegzistuojančio failo '{0}'

# deleteFailedTrashUnsupported
source: Unable to delete file '{0}' via trash because provider does not support it.
lt_lt: Nepavyksta ištrinti failo '{0}' per šiukšliadėžę, nes paslaugų teikėjas to nepalaiko.

# err.read
source: Unable to read file '{0}' ({1})
lt_lt: Nepavyksta perskaityti failo '{0}' ({1})

# err.readonly
source: Unable to modify readonly file '{0}'
lt_lt: Nepavyksta pakeisti tik skaitymui skirto failo '{0}'

# err.write
source: Unable to write file '{0}' ({1})
lt_lt: Nepavyksta įrašyti failo '{0}' ({1})

# fileExists
source: Unable to create file '{0}' that already exists when overwrite flag is not set
lt_lt: Nepavyksta sukurti failo '{0}', kuris jau egzistuoja, kai nenustatyta perrašymo vėliava

# fileIsDirectoryReadError
source: Unable to read file '{0}' that is actually a directory
lt_lt: Nepavyksta perskaityti failo '{0}', kuris iš tikrųjų yra katalogas

# fileIsDirectoryWriteError
source: Unable to write file '{0}' that is actually a directory
lt_lt: Nepavyksta įrašyti failo '{0}', kuris iš tikrųjų yra katalogas

# fileModifiedError
source: File Modified Since
lt_lt: Failas modifikuotas nuo

# fileNotFoundError
source: Unable to resolve non-existing file '{0}'
lt_lt: Nepavyksta išspręsti neegzistuojančio failo '{0}'

# fileNotModifiedError
source: File not modified since
lt_lt: Failas nemodifikuotas nuo

# fileTooLargeError
source: Unable to read file '{0}' that is too large to open
lt_lt: Nepavyksta perskaityti failo '{0}', kuris yra per didelis, kad jį būtų galima atidaryti

# invalidPath
source: Unable to resolve filesystem provider with relative file path '{0}'
lt_lt: Nepavyksta nustatyti failų sistemos teikėjo su santykiniu failo keliu '{0}'

# mkdirExistsError
source: Unable to create folder '{0}' that already exists but is not a directory
lt_lt: Nepavyksta sukurti aplanko '{0}', kuris jau egzistuoja, bet nėra katalogas

# noProviderFound
source: No file system provider found for resource '{0}'
lt_lt: Ištekliui '{0}' nerastas failų sistemos teikėjas

# unableToMoveCopyError1
source: Unable to copy when source '{0}' is same as target '{1}' with different path case on a case insensitive file system
lt_lt: Nepavyksta kopijuoti, kai šaltinis '{0}' yra tas pats kaip ir tikslinis '{1}' su skirtingais kelio atvejais failų sistemoje, kurioje didžiosios ir mažosios raidės neskaičiuojamos

# unableToMoveCopyError2
source: Unable to move/copy when source '{0}' is parent of target '{1}'.
lt_lt: Nepavyksta perkelti/kopijuoti, kai šaltinis "{0}" yra tikslinės "{1}" tėvinė dalis.

# unableToMoveCopyError3
source: Unable to move/copy '{0}' because target '{1}' already exists at destination.
lt_lt: Nepavyksta perkelti/kopijuoti '{0}', nes tikslas '{1}' jau egzistuoja paskirties vietoje.

# unableToMoveCopyError4
source: Unable to move/copy '{0}' into '{1}' since a file would replace the folder it is contained in.
lt_lt: Nepavyko perkelti / nukopijuoti '{0}' į '{1}', nes failas pakeistų aplanką, kuriame jis yra.

# writeFailedUnlockUnsupported
source: Unable to unlock file '{0}' because provider does not support it.
lt_lt: Nepavyksta atrakinti failo '{0}', nes teikėjas jo nepalaiko.

source: Unknown Error
lt_lt: Nežinoma klaida

# fileTooLargeError
source: File is too large to open
lt_lt: Failas yra per didelis, kad jį būtų galima atidaryti

# fileTooLargeForHeapError
source: To open a file of this size, you need to restart and allow {0} to use more memory
lt_lt: Norėdami atidaryti tokio dydžio failą, turite iš naujo paleisti ir leisti {0} naudoti daugiau atminties

# binFailed
source: Failed to move '{0}' to the recycle bin
lt_lt: Nepavyko perkelti '{0}' į šiukšliadėžę

# trashFailed
source: Failed to move '{0}' to the trash
lt_lt: Nepavyko perkelti '{0}' į šiukšliadėžę

# copyError
source: Unable to copy '{0}' into '{1}' ({2}).
lt_lt: Nepavyksta nukopijuoti '{0}' į '{1}' ({2}).

# fileCopyErrorExists
source: File at target already exists
lt_lt: Tikslinis failas jau egzistuoja

# fileCopyErrorPathCase
source: 'File cannot be copied to same path with different path case
lt_lt: "Failo negalima kopijuoti į tą patį kelią su skirtingu kelio atveju

# fileExists
source: File already exists
lt_lt: Failas jau egzistuoja

# fileNotExists
source: File does not exist
lt_lt: Failas neegzistuoja

# moveError
source: Unable to move '{0}' into '{1}' ({2}).
lt_lt: Nepavyksta perkelti '{0}' į '{1}' ({2}).

source: &&Cancel
lt_lt: &&Atšaukti

# confirmCloseIssueReporter
source: Your input will not be saved. Are you sure you want to close this window?
lt_lt: Jūsų įvesta informacija nebus išsaugota. Ar tikrai norite uždaryti šį langą?

source: Issue Reporter
lt_lt: Klausimo pranešėjas

# issueReporterWriteToClipboard
source: There is too much data to send to GitHub directly. The data will be copied to the clipboard, please paste it into the GitHub issue page that is opened.
lt_lt: Yra per daug duomenų, kad juos būtų galima tiesiogiai siųsti į "GitHub". Duomenys bus nukopijuoti į iškarpinę, įklijuokite juos į atidarytą "GitHub" problemos puslapį.

source: Local
lt_lt: Vietinis

source: Process Explorer
lt_lt: Procesų tyrėjas

# first.chord
source: ({0}) was pressed. Waiting for second key of chord...
lt_lt: ({0}). Laukiama antrojo akordo klavišo...

# missing.chord
source: The key combination ({0}, {1}) is not a command.
lt_lt: Klavišų kombinacija ({0}, {1}) nėra komanda.
