Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_platform.xlf
Languages: lt_lt

# overviewRulerCurrentContentForeground
source: Current overview ruler foreground for inline merge-conflicts.
lt_lt: Dabartinės apžvalgos liniuotės pirmas planas, skirtas eilutės sujungimo konfliktams.

# overviewRulerFindMatchForeground
source: Overview ruler marker color for find matches. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Apžvalga Liniuotės žymeklio spalva, skirta rasti atitikmenis. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# overviewRulerIncomingContentForeground
source: Incoming overview ruler foreground for inline merge-conflicts.
lt_lt: Įeinančios apžvalgos liniuotės pirmame plane, skirtame eilutės sujungimo konfliktams.

# overviewRulerSelectionHighlightForeground
source: Overview ruler marker color for selection highlights. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Apžvalgos liniuotės žymeklio spalva, skirta pasirinkimo akcentams paryškinti. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# pickerBackground
source: Quick picker background color. The quick picker widget is the container for pickers like the command palette.
lt_lt: Greito pasirinkimo fono spalva. Greitojo pasirinkimo valdiklis yra rinkiklių, tokių kaip komandų paletė, talpykla.

# pickerForeground
source: Quick picker foreground color. The quick picker widget is the container for pickers like the command palette.
lt_lt: Greito rinkiklio pirmojo plano spalva. Greitojo pasirinkimo valdiklis yra rinkiklių, tokių kaip komandų paletė, talpykla.

# pickerGroupBorder
source: Quick picker color for grouping borders.
lt_lt: Greitai pasirenkama grupavimo ribų spalva.

# pickerGroupForeground
source: Quick picker color for grouping labels.
lt_lt: Greitai pasirenkama grupavimo etikečių spalva.

# pickerTitleBackground
source: Quick picker title background color. The quick picker widget is the container for pickers like the command palette.
lt_lt: Greito pasirinkimo pavadinimo fono spalva. Greitojo pasirinkimo valdiklis yra rinkiklių, tokių kaip komandų paletė, talpykla.

# problemsErrorIconForeground
source: The color used for the problems error icon.
lt_lt: Problemų klaidos piktogramos spalva.

# problemsInfoIconForeground
source: The color used for the problems info icon.
lt_lt: Problemų informacijos piktogramos spalva.

# problemsWarningIconForeground
source: The color used for the problems warning icon.
lt_lt: Problemų įspėjimo piktogramos spalva.

# progressBarBackground
source: Background color of the progress bar that can show for long running operations.
lt_lt: Pažangos juostos fono spalva, kuri gali būti rodoma ilgai vykdomoms operacijoms.

# quickInput.list.focusBackground deprecation
source: Please use quickInputList.focusBackground instead
lt_lt: Vietoj to naudokite quickInputList.focusBackground

# quickInput.listFocusBackground
source: Quick picker background color for the focused item.
lt_lt: Greitojo rinkiklio fono spalva fokusuotam elementui.

# quickInput.listFocusForeground
source: Quick picker foreground color for the focused item.
lt_lt: Greitojo rinkiklio fokusuojamo elemento pirmojo plano spalva.

# quickInput.listFocusIconForeground
source: Quick picker icon foreground color for the focused item.
lt_lt: Greitojo rinkiklio piktogramos fono spalva, skirta sufokusuotam elementui.

# sashActiveBorder
source: Border color of active sashes.
lt_lt: Aktyvių juostų apvado spalva.

# scrollbarShadow
source: Scrollbar shadow to indicate that the view is scrolled.
lt_lt: Slinkties juostos šešėlis, rodantis, kad vaizdas yra slenkamas.

# scrollbarSliderActiveBackground
source: Scrollbar slider background color when clicked on.
lt_lt: Slankiklio slankiklio fono spalva, kai ant jo paspaudžiama.

# scrollbarSliderBackground
source: Scrollbar slider background color.
lt_lt: Slinkties juostos slankiklio fono spalva.

# scrollbarSliderHoverBackground
source: Scrollbar slider background color when hovering.
lt_lt: Slankiklio slankiklio fono spalva, kai jis pakyla.

# searchEditor.editorFindMatchBorder
source: Border color of the Search Editor query matches.
lt_lt: Paieškos redaktoriaus užklausos atitikmenų apvado spalva.

# searchEditor.queryMatch
source: Color of the Search Editor query matches.
lt_lt: Paieškos redaktoriaus užklausos atitikmenų spalva.

# selectionBackground
source: The background color of text selections in the workbench (e.g. for input fields or text areas). Note that this does not apply to selections within the editor.
lt_lt: Darbo stalo teksto pasirinkimų fono spalva (pvz., įvesties laukų arba teksto sričių). Atkreipkite dėmesį, kad tai netaikoma redaktoriaus pasirinkimams.

# snippetFinalTabstopHighlightBackground
source: Highlight background color of the final tabstop of a snippet.
lt_lt: Išryškina paskutinės fragmento skirtuko stotelės fono spalvą.

# snippetFinalTabstopHighlightBorder
source: Highlight border color of the final tabstop of a snippet.
lt_lt: Išryškinkite paskutinės fragmento skirtuko stotelės apvado spalvą.

# snippetTabstopHighlightBackground
source: Highlight background color of a snippet tabstop.
lt_lt: Išryškinkite fragmentų skirtuko stotelės fono spalvą.

# snippetTabstopHighlightBorder
source: Highlight border color of a snippet tabstop.
lt_lt: Ištraukos skirtuko skirtuko krašto spalvos paryškinimas.

# statusBarBackground
source: Background color of the editor hover status bar.
lt_lt: Redaktoriaus žymės būsenos juostos fono spalva.

# textBlockQuoteBackground
source: Background color for block quotes in text.
lt_lt: Tekste esančių blokinių kabučių fono spalva.

# textBlockQuoteBorder
source: Border color for block quotes in text.
lt_lt: Tekste esančių blokinių kabučių apvado spalva.

# textCodeBlockBackground
source: Background color for code blocks in text.
lt_lt: Teksto kodų blokų fono spalva.

# textLinkActiveForeground
source: Foreground color for links in text when clicked on and on mouse hover.
lt_lt: Tekste esančių nuorodų pirmojo fono spalva, kai jos paspaudžiamos ir užvedamos pelės žymekliu.

# textLinkForeground
source: Foreground color for links in text.
lt_lt: Tekste esančių nuorodų pirmojo plano spalva.

# textPreformatForeground
source: Foreground color for preformatted text segments.
lt_lt: Iš anksto suformatuotų teksto segmentų pirmojo plano spalva.

# textSeparatorForeground
source: Color for text separators.
lt_lt: Teksto skirtukų spalva.

# toolbarActiveBackground
source: Toolbar background when holding the mouse over actions
lt_lt: Įrankių juostos fonas laikant pelę virš veiksmų

# toolbarHoverBackground
source: Toolbar background when hovering over actions using the mouse
lt_lt: Įrankių juostos fonas, kai pelės žymekliu užvedama ant veiksmų

# toolbarHoverOutline
source: Toolbar outline when hovering over actions using the mouse
lt_lt: Įrankių juostos kontūras, kai pelės žymekliu užvedama ant veiksmų

# treeIndentGuidesStroke
source: Tree stroke color for the indentation guides.
lt_lt: Medžio brūkšnio spalva, skirta įtraukos kreipiančiosioms.

# warningBorder
source: Border color of warning boxes in the editor.
lt_lt: Redaktoriaus įspėjamųjų langelių ribų spalva.

# widgetShadow
source: Shadow color of widgets such as find/replace inside the editor.
lt_lt: Rodyklių, pvz., redaktoriaus viduje esančios funkcijos "rasti / pakeisti", šešėlių spalva.

# iconDefintion.fontCharacter
source: The font character associated with the icon definition.
lt_lt: Šrifto simbolis, susijęs su piktogramos apibrėžtimi.

# iconDefintion.fontId
source: The id of the font to use. If not set, the font that is defined first is used.
lt_lt: Naudotino šrifto ID. Jei nenustatytas, naudojamas tas šriftas, kuris apibrėžtas pirmas.

# nextChangeIcon
source: Icon for goto next editor location.
lt_lt: Ikona, skirta pereiti į kitą redaktoriaus vietą.

# previousChangeIcon
source: Icon for goto previous editor location.
lt_lt: Ikona, skirta pereiti į ankstesnę redaktoriaus vietą.

# widgetClose
source: Icon for the close action in widgets.
lt_lt: Valdiklių uždarymo veiksmo piktograma.

# abstract
source: Style to use for symbols that are abstract.
lt_lt: Stilius, naudojamas abstrakčių simbolių atveju.

# async
source: Style to use for symbols that are async.
lt_lt: Stilius, naudojamas asinchroniškiems simboliams.

# class
source: Style for classes.
lt_lt: Klasių stilius.

# comment
source: Style for comments.
lt_lt: Komentarų stilius.

# declaration
source: Style for all symbol declarations.
lt_lt: Visų simbolių deklaracijų stilius.

# deprecated
source: Style to use for symbols that are deprecated.
lt_lt: Stilius, kurį reikia naudoti simboliams, kurie yra atgyvenę.

# documentation
source: Style to use for references in documentation.
lt_lt: Stilius, naudojamas dokumentuose pateikiamoms nuorodoms.

# enum
source: Style for enums.
lt_lt: Sąrašų stilius.

# enumMember
source: Style for enum members.
lt_lt: Sąrašo narių stilius.

# event
source: Style for events.
lt_lt: Renginių stilius.

# function
source: Style for functions
lt_lt: Funkcijų stilius

# interface
source: Style for interfaces.
lt_lt: Sąsajų stilius.

# keyword
source: Style for keywords.
lt_lt: Raktinių žodžių stilius.

# labels
source: Style for labels.
lt_lt: Etikečių stilius

# macro
source: Style for macros.
lt_lt: Makrokomandų stilius.

# member
source: Style for member functions
lt_lt: Narių funkcijų stilius

# method
source: Style for method (member functions)
lt_lt: Metodo (nario funkcijos) stilius

# modification
source: Style to use for write accesses.
lt_lt: Stilius, naudojamas rašymo prieigoms.

# namespace
source: Style for namespaces.
lt_lt: Vardų erdvių stilius.

# number
source: Style for numbers.
lt_lt: Numerių stilius.

# operator
source: Style for operators.
lt_lt: Operatorių stilius.

# parameter
source: Style for parameters.
lt_lt: Parametrų stilius.

# property
source: Style for properties.
lt_lt: Savybių stilius.

# readonly
source: Style to use for symbols that are readonly.
lt_lt: Stilius, kurį reikia naudoti tik skaitymui skirtiems simboliams.

# regexp
source: Style for expressions.
lt_lt: Išraiškos stilius.

# schema.fontStyle.error
source: Font style must be 'italic', 'bold' or 'underline' or a combination. The empty string unsets all styles.
lt_lt: Šrifto stilius turi būti "kursyvas", "paryškintas", "pabraukta" arba jų derinys. Tuščia eilutė panaikina visus stilius.

# schema.token.background.warning
source: Token background colors are currently not supported.
lt_lt: Žetonų fono spalvos šiuo metu nepalaikomos.

# schema.token.bold
source: Sets or unsets the font style to bold. Note, the presence of 'fontStyle' overrides this setting.
lt_lt: Nustato arba panaikina šrifto stiliaus paryškinimą. Atkreipkite dėmesį, kad jei yra "fontStyle", šis nustatymas pakeičiamas.

# schema.token.fontStyle
source: Sets the all font styles of the rule: 'italic', 'bold' or 'underline' or a combination. All styles that are not listed are unset. The empty string unsets all styles.
lt_lt: Nustatomi visi taisyklės šrifto stiliai: "italic", "bold", "underline" arba jų derinys. Visi neišvardyti stiliai nenustatomi. Tuščia eilutė panaikina visų stilių nustatymą.

# schema.token.fontStyle.none
source: None (clear inherited style)
lt_lt: Nėra (aiškus paveldėtas stilius)

# schema.token.foreground
source: Foreground color for the token.
lt_lt: Ženklo pirmojo plano spalva.

# schema.token.italic
source: Sets or unsets the font style to italic. Note, the presence of 'fontStyle' overrides this setting.
lt_lt: Nustato arba panaikina šrifto stiliaus kursyvas nustatymą. Atkreipkite dėmesį, kad jei yra "fontStyle", šis nustatymas pakeičiamas.

# schema.token.settings
source: Colors and styles for the token.
lt_lt: Ženklo spalvos ir stiliai.

# schema.token.underline
source: Sets or unsets the font style to underline. Note, the presence of 'fontStyle' overrides this setting.
lt_lt: Nustato arba panaikina šrifto stiliaus pabraukimą. Atkreipkite dėmesį, kad jei yra "fontStyle", šis nustatymas yra viršesnis.

# static
source: Style to use for symbols that are static.
lt_lt: Stilius, naudojamas statiniams simboliams.

# string
source: Style for strings.
lt_lt: Styginių stilius.

# struct
source: Style for structs.
lt_lt: Struktūrų stilius.

# type
source: Style for types.
lt_lt: Tipų stilius.

# typeParameter
source: Style for type parameters.
lt_lt: Tipo parametrų stilius.

# variable
source: Style for variables.
lt_lt: Kintamųjų stilius.

source: Cancel
lt_lt: Atšaukti

# cannotResourceRedoDueToInProgressUndoRedo
source: Could not redo '{0}' because there is already an undo or redo operation running.
lt_lt: Negalima iš naujo atlikti '{0}', nes jau vykdoma atšaukimo arba pakartotinio įrašymo operacija.

# cannotResourceUndoDueToInProgressUndoRedo
source: Could not undo '{0}' because there is already an undo or redo operation running.
lt_lt: Nepavyko atšaukti '{0}', nes jau vykdoma atšaukimo arba pakartotinio atšaukimo operacija.

# cannotWorkspaceRedo
source: Could not redo '{0}' across all files. {1}
lt_lt: Nepavyko pakartotinai įrašyti '{0}' visuose failuose. {1}

# cannotWorkspaceRedoDueToChanges
source: Could not redo '{0}' across all files because changes were made to {1}
lt_lt: Nepavyko iš naujo įrašyti '{0}' visuose failuose, nes buvo atlikti pakeitimai {1}

# cannotWorkspaceRedoDueToInMeantimeUndoRedo
source: Could not redo '{0}' across all files because an undo or redo operation occurred in the meantime
lt_lt: Nepavyko iš naujo atkurti '{0}' visuose failuose, nes per tą laiką buvo atlikta atšaukimo arba atkūrimo operacija

# cannotWorkspaceRedoDueToInProgressUndoRedo
source: Could not redo '{0}' across all files because there is already an undo or redo operation running on {1}
lt_lt: Nepavyko iš naujo padaryti '{0}' visuose failuose, nes jau vykdoma atšaukimo arba pakartotinio padarymo operacija {1}

# cannotWorkspaceUndo
source: Could not undo '{0}' across all files. {1}
lt_lt: Nepavyko atšaukti '{0}' visuose failuose. {1}

# cannotWorkspaceUndoDueToChanges
source: Could not undo '{0}' across all files because changes were made to {1}
lt_lt: Nepavyko atšaukti '{0}' visuose failuose, nes pakeitimai buvo padaryti {1}

# cannotWorkspaceUndoDueToInMeantimeUndoRedo
source: Could not undo '{0}' across all files because an undo or redo operation occurred in the meantime
lt_lt: Nepavyko atšaukti '{0}' visuose failuose, nes per tą laiką buvo atlikta atšaukimo arba pakartotinio atšaukimo operacija

# cannotWorkspaceUndoDueToInProgressUndoRedo
source: Could not undo '{0}' across all files because there is already an undo or redo operation running on {1}
lt_lt: Nepavyko atšaukti '{0}' visuose failuose, nes jau vykdoma atšaukimo arba pakartotinio atšaukimo operacija {1}

# confirmDifferentSource
source: Would you like to undo '{0}'?
lt_lt: Ar norite atšaukti '{0}'?

# confirmDifferentSource.yes
source: Yes
lt_lt: Taip

# confirmWorkspace
source: Would you like to undo '{0}' across all files?
lt_lt: Ar norite atšaukti '{0}' visuose failuose?

# externalRemoval
source: The following files have been closed and modified on disk: {0}.
lt_lt: Šie failai buvo uždaryti ir modifikuoti diske: {0}.

# noParallelUniverses
source: The following files have been modified in an incompatible way: {0}.
lt_lt: Šie failai buvo pakeisti nesuderinamai: {0}.

# nok
source: Undo this File
lt_lt: Atšaukti šį failą

# ok
source: Undo in {0} Files
lt_lt: Atšaukti į {0} Failai

# default
source: Enable automatic update checks. Code will check for updates automatically and periodically.
lt_lt: Įjungti automatines atnaujinimų patikras. Kodas automatiškai ir periodiškai tikrins, ar yra atnaujinimų.

# deprecated
source: This setting is deprecated, please use '{0}' instead.
lt_lt: Šis nustatymas nebenaudojamas, vietoj jo naudokite '{0}'.

# enableWindowsBackgroundUpdates
source: Enable to download and install new VS Code versions in the background on Windows.
lt_lt: Įgalinti atsisiųsti ir įdiegti naujas "VS Code" versijas "Windows" fone.

# enableWindowsBackgroundUpdatesTitle
source: Enable Background Updates on Windows
lt_lt: Fono atnaujinimų įjungimas sistemoje "Windows

# manual
source: Disable automatic background update checks. Updates will be available if you manually check for updates.
lt_lt: Išjungti automatines fono atnaujinimų patikras. Atnaujinimai bus prieinami, jei juos tikrinsite rankiniu būdu.

# none
source: Disable updates.
lt_lt: Išjungti atnaujinimus.

# showReleaseNotes
source: Show Release Notes after an update. The Release Notes are fetched from a Microsoft online service.
lt_lt: Po atnaujinimo rodyti išleidimo pastabas. Išleidimo pastabos gaunamos iš "Microsoft" internetinės paslaugos.

# start
source: Check for updates only on startup. Disable automatic background update checks.
lt_lt: Tikrinti naujinius tik paleidimo metu. Išjunkite automatinį fono atnaujinimų tikrinimą.

# updateConfigurationTitle
source: Update
lt_lt: Atnaujinti

# updateMode
source: Configure whether you receive automatic updates. Requires a restart after change. The updates are fetched from a Microsoft online service.
lt_lt: Konfigūruokite, ar gausite automatinius atnaujinimus. Po pakeitimo reikia paleisti iš naujo. Atnaujinimai gaunami iš "Microsoft" internetinės paslaugos.

# incompatible
source: Cannot sync {0} as its local version {1} is not compatible with its remote version {2}
lt_lt: Negalima sinchronizuoti {0}, nes jo vietinė versija {1} nesuderinama su nuotoline versija {2}

# incompatible sync data
source: Cannot parse sync data as it is not compatible with the current version.
lt_lt: Negalima analizuoti sinchronizavimo duomenų, nes jie nesuderinami su dabartine versija.

# errorInvalidSettings
source: Unable to sync keybindings because the content in the file is not valid. Please open the file and correct it.
lt_lt: Nepavyksta sinchronizuoti klavišų sąsajų, nes failo turinys negalioja. Atidarykite failą ir jį pataisykite.

# errorInvalidSettings
source: Unable to sync settings as there are errors/warning in settings file.
lt_lt: Nepavyksta sinchronizuoti nustatymų, nes nustatymų faile yra klaidų / įspėjimų.

# default service changed
source: Cannot sync because default service has changed
lt_lt: Negalima sinchronizuoti, nes pasikeitė numatytoji paslauga

# service changed
source: Cannot sync because sync service has changed
lt_lt: Negalima sinchronizuoti, nes pasikeitė sinchronizavimo paslauga

# session expired
source: Cannot sync because current session is expired
lt_lt: Negalima sinchronizuoti, nes baigėsi dabartinės sesijos galiojimo laikas

# turned off
source: Cannot sync because syncing is turned off in the cloud
lt_lt: Negalima sinchronizuoti, nes sinchronizavimas debesyje išjungtas

# turned off machine
source: Cannot sync because syncing is turned off on this machine from another machine.
lt_lt: Negalima sinchronizuoti, nes šiame kompiuteryje išjungtas sinchronizavimas iš kito kompiuterio.

# app.extension.identifier.errorMessage
source: Expected format '${publisher}.${name}'. Example: 'vscode.csharp'.
lt_lt: Laukiamas formatas '${publisher}.${name}'. Pavyzdys: 'vscode.csharp'.

source: Settings Sync
lt_lt: Nustatymų sinchronizavimas

# settingsSync.ignoredExtensions
source: List of extensions to be ignored while synchronizing. The identifier of an extension is always `${publisher}.${name}`. For example: `vscode.csharp`.
lt_lt: Sinchronizuojant ignoruojamų plėtinių sąrašas. Išplėtimo identifikatorius visada yra `${publisher}.${name}`. Pavyzdžiui: `vscode.csharp`.

# settingsSync.ignoredSettings
source: Configure settings to be ignored while synchronizing.
lt_lt: Konfigūruokite nustatymus, į kuriuos sinchronizuojant bus neatsižvelgiama.

# settingsSync.keybindingsPerPlatform
source: Synchronize keybindings for each platform.
lt_lt: Sinchronizuokite kiekvienos platformos klavišų sąsajas.

# error incompatible
source: Cannot read machines data as the current version is incompatible. Please update {0} and try again.
lt_lt: Negalima nuskaityti mašinų duomenų, nes dabartinė versija yra nesuderinama. Atnaujinkite {0} ir bandykite dar kartą.

# appCrashed
source: The window has crashed
lt_lt: Langas sudužo

# appCrashedDetail
source: We are sorry for the inconvenience. You can reopen the window to continue where you left off.
lt_lt: Atsiprašome už nepatogumus. Galite iš naujo atidaryti langą ir tęsti pradėtą darbą.

# appCrashedDetails
source: The window has crashed (reason: '{0}', code: '{1}')
lt_lt: Langas sugedo (priežastis: '{0}', kodas: '{1}')

# appStalled
source: The window is not responding
lt_lt: Langas nereaguoja

# appStalledDetail
source: You can reopen or close the window or keep waiting.
lt_lt: Galite dar kartą atidaryti arba uždaryti langą arba toliau laukti.

# hiddenMenuBar
source: You can still access the menu bar by pressing the Alt-key.
lt_lt: Meniu juostą vis dar galite pasiekti paspaudę klavišą Alt.

source: &&Reopen
lt_lt: &&Atnaujinti

# pathNotExistDetail
source: The path '{0}' does not exist on this computer.
lt_lt: Kelias '{0}' šiame kompiuteryje neegzistuoja.

# pathNotExistTitle
source: Path does not exist
lt_lt: Kelio nėra

# uriInvalidDetail
source: The URI '{0}' is not valid and can not be opened.
lt_lt: URI '{0}' yra negaliojantis ir negali būti atidarytas.

# uriInvalidTitle
source: URI can not be opened
lt_lt: URI negalima atidaryti

source: Trusted
lt_lt: Patikimas

# untrusted
source: Restricted Mode
lt_lt: Ribotas režimas

source: Code Workspace
lt_lt: Kodo darbo erdvė

source: New Window
lt_lt: Naujas langas

# newWindowDesc
source: Opens a new window
lt_lt: Atidaromas naujas langas

source: Recent Folders
lt_lt: Naujausi aplankai

# recentFoldersAndWorkspaces
source: Recent Folders & Workspaces
lt_lt: Naujausi aplankai ir darbo vietos

source: Untitled (Workspace)
lt_lt: Be pavadinimo (darbo erdvė)

# workspaceName
source: {0} (Workspace)
lt_lt: {0} (Darbo erdvė)

# workspaceOpenedDetail
source: The workspace is already opened in another window. Please close that window first and then try again.
lt_lt: Darbo sritis jau atidaryta kitame lange. Pirmiausia uždarykite tą langą ir bandykite dar kartą.

# workspaceOpenedMessage
source: Unable to save workspace '{0}'
lt_lt: Nepavyksta išsaugoti darbo vietos '{0}'
