Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_platform.xlf
Languages: lt_lt

# automatic keyboard navigation setting
source: Controls whether keyboard navigation in lists and trees is automatically triggered simply by typing. If set to `false`, keyboard navigation is only triggered when executing the `list.toggleKeyboardNavigation` command, for which you can assign a keyboard shortcut.
lt_lt: Nustato, ar navigacija klaviatūra sąrašuose ir medžiuose automatiškai įjungiama tiesiog rašant. Jei nustatyta reikšmė `false`, navigacija klaviatūra įjungiama tik tada, kai vykdoma komanda `list.toggleKeyboardNavigation`, kuriai galima priskirti klaviatūros spartųjį klavišą.

# expand mode
source: Controls how tree folders are expanded when clicking the folder names. Note that some trees and lists might choose to ignore this setting if it is not applicable.
lt_lt: Valdo, kaip medžio aplankai išplečiami spustelėjus aplankų pavadinimus. Atkreipkite dėmesį, kad kai kuriuose medžiuose ir sąrašuose šis nustatymas gali būti ignoruojamas, jei jis netaikomas.

# horizontalScrolling setting
source: Controls whether lists and trees support horizontal scrolling in the workbench. Warning: turning on this setting has a performance implication.
lt_lt: Nustato, ar darbalaukyje sąrašuose ir medžiuose palaikomas horizontalus slinkimas. Įspėjimas: šio nustatymo įjungimas turi įtakos našumui.

# keyboardNavigationSettingKey
source: Controls the keyboard navigation style for lists and trees in the workbench. Can be simple, highlight and filter.
lt_lt: Valdo klaviatūros naršymo stilių, taikomą darbalaukyje esantiems sąrašams ir medžiams. Gali būti paprastas, išryškinti ir filtruoti.

# keyboardNavigationSettingKey.filter
source: Filter keyboard navigation will filter out and hide all the elements which do not match the keyboard input.
lt_lt: Filtruoti navigaciją klaviatūra bus išfiltruoti ir paslėpti visi elementai, kurie neatitinka klaviatūros įvesties.

# keyboardNavigationSettingKey.highlight
source: Highlight keyboard navigation highlights elements which match the keyboard input. Further up and down navigation will traverse only the highlighted elements.
lt_lt: Išryškinti navigaciją klaviatūra išryškina elementus, kurie atitinka klaviatūros įvestį. Tolesnė navigacija aukštyn ir žemyn apims tik paryškintus elementus.

# keyboardNavigationSettingKey.simple
source: Simple keyboard navigation focuses elements which match the keyboard input. Matching is done only on prefixes.
lt_lt: Paprasta navigacija klaviatūra sutelkia dėmesį į elementus, atitinkančius klaviatūros įvestį. Atitikimas atliekamas tik su priešdėliais.

# list smoothScrolling setting
source: Controls whether lists and trees have smooth scrolling.
lt_lt: Nustato, ar sąrašai ir medžiai turi būti sklandžiai slenkami.

# multiSelectModifier
source: The modifier to be used to add an item in trees and lists to a multi-selection with the mouse (for example in the explorer, open editors and scm view). The 'Open to Side' mouse gestures - if supported - will adapt such that they do not conflict with the multiselect modifier.
lt_lt: Modifikatorius, naudojamas norint įtraukti medžių ir sąrašų elementą į daugkartinį pasirinkimą pele (pvz., tyrėjo, atvirų redaktorių ir scm rodinyje). Pelės gestai "Atverti į šoną", jei jie palaikomi, bus pritaikyti taip, kad neprieštarautų daugiataškio pasirinkimo modifikatoriui.

# multiSelectModifier.alt
source: Maps to `Alt` on Windows and Linux and to `Option` on macOS.
lt_lt: "Windows" ir "Linux" sistemoje atitinka `Alt`, o "MacOS" sistemoje - `Option`.

# multiSelectModifier.ctrlCmd
source: Maps to `Control` on Windows and Linux and to `Command` on macOS.
lt_lt: "Windows" ir "Linux" sistemoje atitinka `Control`, o "MacOS" sistemoje - `Command`.

# openModeModifier
source: Controls how to open items in trees and lists using the mouse (if supported). Note that some trees and lists might choose to ignore this setting if it is not applicable.
lt_lt: Valdo, kaip atidaryti medžių ir sąrašų elementus naudojant pelę (jei palaikoma). Atkreipkite dėmesį, kad kai kuriuose medžiuose ir sąrašuose šis nustatymas gali būti ignoruojamas, jei jis netaikomas.

# render tree indent guides
source: Controls whether the tree should render indent guides.
lt_lt: Nustato, ar medis turi atvaizduoti įtraukų kreipinius.

# tree indent setting
source: Controls tree indentation in pixels.
lt_lt: Valdo medžio įtrauką pikseliais.

# workbenchConfigurationTitle
source: Workbench
lt_lt: Darbo stalas

source: close
lt_lt: užverti

source: find
lt_lt: rasti

source: open
lt_lt: atviras

# sev.error
source: Error
lt_lt: Klaida

# sev.info
source: Info
lt_lt: Informacija

# sev.warning
source: Warning
lt_lt: Įspėjimas

# mAbout
source: About {0}
lt_lt: Apie {0}

# mBringToFront
source: Bring All to Front
lt_lt: Perkelti viską į priekį

# mEdit
source: &&Edit
lt_lt: &&Taisa

# mFile
source: &&File
lt_lt: &&Failas

# mGoto
source: &&Go
lt_lt: &&Eiti

# mHelp
source: &&Help
lt_lt: &&Žinynas

# mHide
source: Hide {0}
lt_lt: Paslėpti {0}

# mHideOthers
source: Hide Others
lt_lt: Paslėpti kitus

# mMergeAllWindows
source: Merge All Windows
lt_lt: Sujungti visus langus

# mMinimize
source: Minimize
lt_lt: Sumažinti

# mMoveTabToNewWindow
source: Move Tab to New Window
lt_lt: Kortelės perkėlimas į naują langą

# mNewTab
source: New Tab
lt_lt: Nauja kortelė

# mRun
source: &&Run
lt_lt: &&Vykdyti

# mSelection
source: &&Selection
lt_lt: &&Žymėjimas

# mServices
source: Services
lt_lt: Paslaugos

# mShowAll
source: Show All
lt_lt: Rodyti viską

# mShowNextTab
source: Show Next Tab
lt_lt: Rodyti kitą kortelę

# mShowPreviousTab
source: Show Previous Tab
lt_lt: Rodyti ankstesnę kortelę

# mTerminal
source: &&Terminal
lt_lt: &&Terminalas

# mView
source: &&View
lt_lt: &&Rodymas

# mWindow
source: Window
lt_lt: Langas

# mZoom
source: Zoom
lt_lt: Mastelis

# miCheckForUpdates
source: Check for &&Updates...
lt_lt: Patikrinti, ar yra &&atnaujinimų...

# miCheckingForUpdates
source: Checking for Updates...
lt_lt: Ieškoma atnaujinimų...

# miDownloadUpdate
source: D&&ownload Available Update
lt_lt: A&&tsisiųsti prieinamą atnaujinimą

# miDownloadingUpdate
source: Downloading Update...
lt_lt: Atsiunčiamas atnaujinimas...

# miInstallUpdate
source: Install &&Update...
lt_lt: Įdiegti &&atnaujinimą...

# miInstallingUpdate
source: Installing Update...
lt_lt: Diegiamas atnaujinimas...

# miNewWindow
source: New &&Window
lt_lt: Naujas &&langas

# miPreferences
source: &&Preferences
lt_lt: &&Nuostatos

# miQuit
source: Quit {0}
lt_lt: Išeiti {0}

# miRestartToUpdate
source: Restart to &&Update
lt_lt: Paleisti iš naujo &&atnaujinimui užbaigti

# miSwitchWindow
source: Switch &&Window...
lt_lt: Perjungti &&langą...

# cantCreateBinFolder
source: Unable to install the shell command '{0}'.
lt_lt: Nepavyksta įdiegti apvalkalo komandos '{0}'.

# cantUninstall
source: Unable to uninstall the shell command '{0}'.
lt_lt: Nepavyksta pašalinti apvalkalo komandos '{0}'.

# sourceMissing
source: Unable to find shell script in '{0}'
lt_lt: Nepavyksta rasti apvalkalo scenarijaus į '{0}'

# warnEscalation
source: {0} will now prompt with 'osascript' for Administrator privileges to install the shell command.
lt_lt: {0} dabar bus paprašyta 'osascript' administratoriaus teisių, kad būtų galima įdiegti apvalkalo komandą.

# warnEscalationUninstall
source: {0} will now prompt with 'osascript' for Administrator privileges to uninstall the shell command.
lt_lt: {0} dabar bus paprašyta 'osascript' administratoriaus privilegijų, kad būtų galima pašalinti apvalkalo komandą.

# canNotRun
source: Command '{0}' resulted in an error ({1})
lt_lt: Komanda "{0}" sukėlė klaidą ({1})

# morecCommands
source: other commands
lt_lt: kitos komandos

source: recently used
lt_lt: neseniai naudotas

source: editor commands
lt_lt: redaktoriaus komandos

source: global commands
lt_lt: visuotinės komandos

# proxy
source: The proxy setting to use. If not set, will be inherited from the `http_proxy` and `https_proxy` environment variables.
lt_lt: Naudotinas tarpinio serverio nustatymas. Jei nenustatytas, bus paveldėtas iš `http_proxy` ir `https_proxy` aplinkos kintamųjų.

# proxyAuthorization
source: The value to send as the `Proxy-Authorization` header for every network request.
lt_lt: Reikšmė, kuri siunčiama kaip `Proxy-Authorization` antraštė kiekvienai tinklo užklausai.

# proxySupport
source: Use the proxy support for extensions.
lt_lt: Naudokite įgaliotojo atstovo palaikymą plėtiniams.

# proxySupportFallback
source: Enable proxy support for extensions, fall back to request options, when no proxy found.
lt_lt: Įjungti tarpinio serverio palaikymą plėtiniams, grįžti prie užklausos parinkčių, kai nerandama tarpinio serverio.

# proxySupportOff
source: Disable proxy support for extensions.
lt_lt: Išjungti plėtinių proxy palaikymą.

# proxySupportOn
source: Enable proxy support for extensions.
lt_lt: Įjungti įgaliotojo serverio palaikymą plėtiniams.

# proxySupportOverride
source: Enable proxy support for extensions, override request options.
lt_lt: Įjungti įgaliotojo serverio palaikymą plėtiniams, pakeisti užklausos parinktis.

# strictSSL
source: Controls whether the proxy server certificate should be verified against the list of supplied CAs.
lt_lt: Nustato, ar tarpinio serverio sertifikatas turi būti tikrinamas pagal pateiktų CA sąrašą.

# systemCertificates
source: Controls whether CA certificates should be loaded from the OS. (On Windows and macOS, a reload of the window is required after turning this off.)
lt_lt: Nustato, ar CA sertifikatai turi būti įkeliami iš OS. (Išjungus šią funkciją "Windows" ir "MacOS", reikia iš naujo įkelti langą.)

# telemetry.enableTelemetry
source: Enable usage data and errors to be sent to a Microsoft online service.
lt_lt: Įgalinti naudojimo duomenis ir klaidas siųsti į "Microsoft" internetinę paslaugą.

# telemetry.enableTelemetryMd
source: Enable usage data and errors to be sent to a Microsoft online service. Read our privacy statement [here]({0}).
lt_lt: Įgalinti naudojimo duomenis ir klaidas siųsti į "Microsoft" internetinę paslaugą. Perskaitykite mūsų privatumo pareiškimą [čia]({0}).

# telemetryConfigurationTitle
source: Telemetry
lt_lt: Telemetrija

# terminal.integrated.automationShell.linux
source: A path that when set will override {0} and ignore {1} values for automation-related terminal usage like tasks and debug.
lt_lt: Kelias, kurį nustačius bus pakeičiamos {0} ir ignoruojamos {1} reikšmės su automatizavimu susijusiam terminalo naudojimui, pavyzdžiui, užduotims ir derinimui.

# terminal.integrated.automationShell.osx
source: A path that when set will override {0} and ignore {1} values for automation-related terminal usage like tasks and debug.
lt_lt: Kelias, kurį nustačius bus pakeičiamos {0} ir ignoruojamos {1} reikšmės su automatizavimu susijusiam terminalo naudojimui, pavyzdžiui, užduotims ir derinimui.

# terminal.integrated.automationShell.windows
source: A path that when set will override {0} and ignore {1} values for automation-related terminal usage like tasks and debug.
lt_lt: Kelias, kurį nustačius bus pakeičiamos {0} ir ignoruojamos {1} reikšmės su automatizavimu susijusiam terminalo naudojimui, pavyzdžiui, užduotims ir derinimui.

# terminal.integrated.defaultProfile.linux
source: The default profile used on Linux. This setting will currently be ignored if either {0} or {1} are set.
lt_lt: Numatytasis profilis, naudojamas "Linux". Šis nustatymas šiuo metu ignoruojamas, jei nustatytas {0} arba {1}.

# terminal.integrated.defaultProfile.osx
source: The default profile used on macOS. This setting will currently be ignored if either {0} or {1} are set.
lt_lt: Numatytasis profilis, naudojamas "macOS". Šis nustatymas šiuo metu ignoruojamas, jei nustatytas {0} arba {1}.

# terminal.integrated.defaultProfile.windows
source: The default profile used on Windows. This setting will currently be ignored if either {0} or {1} are set.
lt_lt: Numatytasis profilis, naudojamas "Windows" sistemoje. Šis nustatymas šiuo metu ignoruojamas, jei nustatytas {0} arba {1}.

# terminal.integrated.inheritEnv
source: Whether new shells should inherit their environment from VS Code which may source a login shell to ensure $PATH and other development variables are initialized. This has no effect on Windows.
lt_lt: Ar nauji apvalkalai turėtų paveldėti aplinką iš VS kodo, kuris gali būti prisijungimo apvalkalo šaltinis, siekiant užtikrinti, kad būtų inicializuoti $PATH ir kiti kūrimo kintamieji. Tai neturi įtakos "Windows" sistemai.

# terminal.integrated.profile.linux
source: The Linux profiles to present when creating a new terminal via the terminal dropdown. When set, these will override the default detected profiles. They are comprised of a {0} and optional {1}
lt_lt: "Linux" profiliai, kuriuos reikia pateikti kuriant naują terminalą per terminalo išskleidžiamąjį sąrašą. Nustatę šiuos profilius, jie pakeis numatytuosius aptiktus profilius. Juos sudaro {0} ir neprivalomas {1}

# terminal.integrated.profile.osx
source: The macOS profiles to present when creating a new terminal via the terminal dropdown. When set, these will override the default detected profiles. They are comprised of a {0} and optional {1}
lt_lt: "MacOS" profiliai, kuriuos reikia pateikti kuriant naują terminalą per terminalo išskleidžiamąjį sąrašą. Juos nustačius, jie pakeičia numatytuosius aptiktus profilius. Juos sudaro {0} ir neprivalomas {1}

# terminal.integrated.profiles.windows
source: The Windows profiles to present when creating a new terminal via the terminal dropdown. Set to null to exclude them, use the {0} property to use the default detected configuration. Or, set the {1} and optional {2}
lt_lt: "Windows" profiliai, kuriuos reikia pateikti kuriant naują terminalą per terminalo išskleidžiamąjį sąrašą. Nustatykite null, kad jų neįtrauktumėte, naudokite {0} savybę, kad naudotumėte numatytąją aptiktą konfigūraciją. Arba nustatykite {1} ir neprivalomą {2}

# terminal.integrated.shell.linux
source: The path of the shell that the terminal uses on Linux. [Read more about configuring the shell](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).
lt_lt: Kelias į apvalkalą, kurį terminalas naudoja "Linux" sistemoje. [Plačiau apie apvalkalo konfigūravimą](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).

# terminal.integrated.shell.linux.deprecation
source: This is deprecated, the new recommended way to configure your default shell is by creating a terminal profile in {0} and setting its profile name as the default in {1}. This will currently take priority over the new profiles settings but that will change in the future.
lt_lt: Šis būdas nebetaikomas, naujasis rekomenduojamas būdas konfigūruoti numatytąjį apvalkalą yra sukurti terminalo profilį {0} ir nustatyti jo profilio pavadinimą kaip numatytąjį {1}. Šiuo metu tai turi pirmenybę prieš naujų profilių nustatymus, tačiau ateityje tai pasikeis.

# terminal.integrated.shell.osx
source: The path of the shell that the terminal uses on macOS. [Read more about configuring the shell](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).
lt_lt: Korpuso, kurį terminalas naudoja "macOS" sistemoje, kelias. [Skaitykite daugiau apie apvalkalo konfigūravimą](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).

# terminal.integrated.shell.osx.deprecation
source: This is deprecated, the new recommended way to configure your default shell is by creating a terminal profile in {0} and setting its profile name as the default in {1}. This will currently take priority over the new profiles settings but that will change in the future.
lt_lt: Šis būdas nebetaikomas, naujasis rekomenduojamas būdas konfigūruoti numatytąjį apvalkalą yra sukurti terminalo profilį {0} ir nustatyti jo profilio pavadinimą kaip numatytąjį {1}. Šiuo metu tai turi pirmenybę prieš naujų profilių nustatymus, tačiau ateityje tai pasikeis.

# terminal.integrated.shell.windows
source: The path of the shell that the terminal uses on Windows. [Read more about configuring the shell](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).
lt_lt: Kelias į apvalkalą, kurį terminalas naudoja "Windows" sistemoje. [Skaitykite daugiau apie apvalkalo konfigūravimą](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).

# terminal.integrated.shell.windows.deprecation
source: This is deprecated, the new recommended way to configure your default shell is by creating a terminal profile in {0} and setting its profile name as the default in {1}. This will currently take priority over the new profiles settings but that will change in the future.
lt_lt: Šis būdas nebetaikomas, naujasis rekomenduojamas būdas konfigūruoti numatytąjį apvalkalą yra sukurti terminalo profilį {0} ir nustatyti jo profilio pavadinimą kaip numatytąjį {1}. Šiuo metu tai turi pirmenybę prieš naujų profilių nustatymus, tačiau ateityje tai pasikeis.

# terminal.integrated.shellArgs.linux
source: The command line arguments to use when on the Linux terminal. [Read more about configuring the shell](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).
lt_lt: Komandinės eilutės argumentai, kuriuos reikia naudoti "Linux" terminale. [Skaitykite daugiau apie apvalkalo konfigūravimą](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).

# terminal.integrated.shellArgs.osx
source: The command line arguments to use when on the macOS terminal. [Read more about configuring the shell](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).
lt_lt: Komandinės eilutės argumentai, kuriuos reikia naudoti "MacOS" terminale. [Skaitykite daugiau apie apvalkalo konfigūravimą](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).

# terminal.integrated.shellArgs.windows
source: The command line arguments to use when on the Windows terminal. [Read more about configuring the shell](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).
lt_lt: Komandinės eilutės argumentai, kuriuos reikia naudoti "Windows" terminale. [Skaitykite daugiau apie apvalkalo konfigūravimą](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).

# terminal.integrated.shellArgs.windows.string
source: The command line arguments in [command-line format](https://msdn.microsoft.com/en-au/08dfcab2-eb6e-49a4-80eb-87d4076c98c6) to use when on the Windows terminal. [Read more about configuring the shell](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).
lt_lt: Komandinės eilutės argumentai [komandinės eilutės formatas](https://msdn.microsoft.com/en-au/08dfcab2-eb6e-49a4-80eb-87d4076c98c6), kuriuos reikia naudoti "Windows" terminale. [Daugiau apie apvalkalo konfigūravimą](https://code.visualstudio.com/docs/editor/integrated-terminal#_configuration).

# terminal.integrated.showLinkHover
source: Whether to show hovers for links in the terminal output.
lt_lt: Ar terminalo išvestyje rodyti nuorodų žymes.

# terminal.integrated.useWslProfiles
source: Controls whether or not WSL distros are shown in the terminal dropdown
lt_lt: Nustato, ar WSL distributyvai rodomi terminalo išskleidžiamajame lange

# terminalIntegratedConfigurationTitle
source: Integrated Terminal
lt_lt: Integruotas terminalas

# terminalProfile.args
source: An optional set of arguments to run the shell executable with.
lt_lt: Neprivalomas argumentų rinkinys, su kuriuo paleidžiama apvalkalo vykdomoji programa.

# terminalProfile.color
source: A theme color ID to associate with this terminal.
lt_lt: Temos spalvos ID, kuris susiejamas su šiuo terminalu.

# terminalProfile.env
source: An object with environment variables that will be added to the terminal profile process. Set to `null` to delete environment variables from the base environment.
lt_lt: Objektas su aplinkos kintamaisiais, kurie bus įtraukti į terminalo profilio procesą. Nustatykite į `null`, jei norite ištrinti aplinkos kintamuosius iš bazinės aplinkos.

# terminalProfile.icon
source: A codicon ID to associate with this terminal.
lt_lt: Kodikono ID, kuris susiejamas su šiuo terminalu.

# terminalProfile.overrideName
source: Controls whether or not the profile name overrides the auto detected one.
lt_lt: Nustato, ar profilio pavadinimas bus viršesnis už automatiškai aptiktą.

# terminalProfile.path
source: A single path to a shell executable or an array of paths that will be used as fallbacks when one fails.
lt_lt: Vienas kelias į apvalkalo vykdomąjį failą arba kelių, kurie bus naudojami kaip atsarginiai variantai, kai vienas nepavyksta, masyvas.

# terminalProfile.windowsSource
source: A profile source that will auto detect the paths to the shell.
lt_lt: Profilio šaltinis, kuris automatiškai nustato kelius į apvalkalą.

# launchFail.cwdDoesNotExist
source: Starting directory (cwd) "{0}" does not exist
lt_lt: Pradinis katalogas (cwd) "{0}" neegzistuoja

# launchFail.cwdNotDirectory
source: Starting directory (cwd) "{0}" is not a directory
lt_lt: Pradinis katalogas (cwd) "{0}" nėra katalogas

# launchFail.executableDoesNotExist
source: Path to shell executable "{0}" does not exist
lt_lt: Kelio į apvalkalo vykdomąją programą "{0}" nėra

# launchFail.executableIsNotFileOrSymlink
source: Path to shell executable "{0}" is not a file of a symlink
lt_lt: Kelias į apvalkalo vykdomąją programą "{0}" nėra simlinko failas

# activeContrastBorder
source: An extra border around active elements to separate them from others for greater contrast.
lt_lt: Papildomas apvadas aplink aktyvius elementus, kad jie būtų atskirti nuo kitų ir būtų kontrastingesni.

# activeLinkForeground
source: Color of active links.
lt_lt: Aktyvių nuorodų spalva.

# badgeBackground
source: Badge background color. Badges are small information labels, e.g. for search results count.
lt_lt: Ženklelio fono spalva. Ženkliukai - tai nedidelės informacinės etiketės, pvz., skirtos paieškos rezultatams skaičiuoti.

# badgeForeground
source: Badge foreground color. Badges are small information labels, e.g. for search results count.
lt_lt: Ženklelio pirmojo plano spalva. Ženkliukai - tai nedidelės informacinės etiketės, pvz., skirtos paieškos rezultatams skaičiuoti.

# breadcrumbsBackground
source: Background color of breadcrumb items.
lt_lt: Drobės elementų fono spalva.

# breadcrumbsFocusForeground
source: Color of focused breadcrumb items.
lt_lt: Fokusuoto džiūvėsėlio elementų spalva.

# breadcrumbsSelectedBackground
source: Background color of breadcrumb item picker.
lt_lt: Drobės elementų rinkiklio fono spalva.

# breadcrumbsSelectedForegound
source: Color of selected breadcrumb items.
lt_lt: Pasirinktų trupinių elementų spalva.

# buttonBackground
source: Button background color.
lt_lt: Mygtuko fono spalva.

# buttonBorder
source: Button border color.
lt_lt: Mygtuko rėmelio spalva.

# buttonForeground
source: Button foreground color.
lt_lt: Mygtuko pirmojo plano spalva.

# buttonHoverBackground
source: Button background color when hovering.
lt_lt: Mygtuko fono spalva, kai jis pakyla.

# buttonSecondaryBackground
source: Secondary button background color.
lt_lt: Antrinio mygtuko fono spalva.

# buttonSecondaryForeground
source: Secondary button foreground color.
lt_lt: Antrinio mygtuko pirmojo plano spalva.

# buttonSecondaryHoverBackground
source: Secondary button background color when hovering.
lt_lt: Antrinio mygtuko fono spalva, kai jis užkliūva.

# chartsBlue
source: The blue color used in chart visualizations.
lt_lt: Mėlyna spalva, naudojama diagramų vizualizacijose.

# chartsForeground
source: The foreground color used in charts.
lt_lt: Diagramose naudojama pirmojo plano spalva.

# chartsGreen
source: The green color used in chart visualizations.
lt_lt: Žalia spalva, naudojama diagramų vizualizacijose.
