Repository: neda-zal/vscode-language-pack-lt
Catalog: xliff/vscode-editor/vs_platform.xlf
Languages: lt_lt

# chartsLines
source: The color used for horizontal lines in charts.
lt_lt: Spalva, naudojama horizontalioms linijoms diagramose.

# chartsOrange
source: The orange color used in chart visualizations.
lt_lt: Oranžinė spalva, naudojama diagramų vizualizacijose.

# chartsPurple
source: The purple color used in chart visualizations.
lt_lt: Violetinė spalva, naudojama diagramų vizualizacijose.

# chartsRed
source: The red color used in chart visualizations.
lt_lt: Raudona spalva, naudojama diagramų vizualizacijose.

# chartsYellow
source: The yellow color used in chart visualizations.
lt_lt: Geltona spalva, naudojama diagramų vizualizacijose.

# checkbox.background
source: Background color of checkbox widget.
lt_lt: Žymimojo langelio valdiklio fono spalva.

# checkbox.border
source: Border color of checkbox widget.
lt_lt: Žymimojo langelio valdiklio ribos spalva.

# checkbox.foreground
source: Foreground color of checkbox widget.
lt_lt: Žymimojo langelio valdiklio pirmojo plano spalva.

# contrastBorder
source: An extra border around elements to separate them from others for greater contrast.
lt_lt: Papildomas apvadas aplink elementus, kad jie būtų atskirti nuo kitų ir būtų kontrastingesni.

# descriptionForeground
source: Foreground color for description text providing additional information, for example for a label.
lt_lt: Aprašymo teksto, kuriame pateikiama papildoma informacija, pvz., etiketės, pirmojo plano spalva.

# diffDiagonalFill
source: Color of the diff editor's diagonal fill. The diagonal fill is used in side-by-side diff views.
lt_lt: Skirtumo redaktoriaus įstrižainės užpildo spalva. Įstrižainės užpildas naudojamas šoniniuose skirtumų rodiniuose.

# diffEditorBorder
source: Border color between the two text editors.
lt_lt: Dviejų teksto redaktorių ribos spalva.

# diffEditorInserted
source: Background color for text that got inserted. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Įterpto teksto fono spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# diffEditorInsertedOutline
source: Outline color for the text that got inserted.
lt_lt: Įterpto teksto kontūro spalva.

# diffEditorRemoved
source: Background color for text that got removed. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Pašalinto teksto fono spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# diffEditorRemovedOutline
source: Outline color for text that got removed.
lt_lt: Pašalinto teksto kontūro spalva.

source: Dropdown background.
lt_lt: Iškritimo fonas.

source: Dropdown border.
lt_lt: Išskleidžiamoji riba.

source: Dropdown foreground.
lt_lt: Išskleidžiamojo sąrašo pirmame plane.

source: Dropdown list background.
lt_lt: Išskleidžiamojo sąrašo fonas.

# editorBackground
source: Editor background color.
lt_lt: Redaktoriaus fono spalva.

# editorError.background
source: Background color of error text in the editor. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Redaktoriaus klaidų teksto fono spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# editorError.foreground
source: Foreground color of error squigglies in the editor.
lt_lt: Redaktoriaus klaidų skeveldrų pirmojo plano spalva.

# editorFindMatch
source: Color of the current search match.
lt_lt: Dabartinio paieškos atitikmens spalva.

# editorFindMatchBorder
source: Border color of the current search match.
lt_lt: Dabartinės paieškos atitikmens ribos spalva.

# editorForeground
source: Editor default foreground color.
lt_lt: Redaktoriaus numatytoji pirmojo plano spalva.

# editorHint.foreground
source: Foreground color of hint squigglies in the editor.
lt_lt: Redaktoriaus užuominų "Squigglies" pirmojo plano spalva.

# editorInactiveSelection
source: Color of the selection in an inactive editor. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Neaktyvaus redaktoriaus pasirinkimo spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# editorInfo.background
source: Background color of info text in the editor. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Redaktoriaus informacinio teksto fono spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# editorInfo.foreground
source: Foreground color of info squigglies in the editor.
lt_lt: Redaktoriaus informacinių skeveldrų pirmojo plano spalva.

# editorInlayHintBackground
source: Background color of inline hints
lt_lt: Įterptinių užuominų fono spalva

# editorInlayHintForeground
source: Foreground color of inline hints
lt_lt: Įterptinių užuominų pirmojo plano spalva

# editorLightBulbAutoFixForeground
source: The color used for the lightbulb auto fix actions icon.
lt_lt: Žibalinės lemputės automatinio taisymo veiksmų piktogramos spalva.

# editorLightBulbForeground
source: The color used for the lightbulb actions icon.
lt_lt: Lemputės veiksmų piktogramos spalva.

# editorSelectionBackground
source: Color of the editor selection.
lt_lt: Redaktoriaus pasirinkimo spalva.

# editorSelectionForeground
source: Color of the selected text for high contrast.
lt_lt: Pasirinkto teksto spalva, skirta dideliam kontrastui.

# editorSelectionHighlight
source: Color for regions with the same content as the selection. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Regionų, kurių turinys yra toks pat kaip pasirinkimo, spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# editorSelectionHighlightBorder
source: Border color for regions with the same content as the selection.
lt_lt: Regionų, kurių turinys yra toks pat kaip pasirinkimo, ribų spalva.

# editorWarning.background
source: Background color of warning text in the editor. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Redaktoriaus įspėjimo teksto fono spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# editorWarning.foreground
source: Foreground color of warning squigglies in the editor.
lt_lt: Redaktoriaus įspėjamųjų skeveldrų pirmojo plano spalva.

# editorWidgetBackground
source: Background color of editor widgets, such as find/replace.
lt_lt: Redaktoriaus valdiklių, pvz., rasti / pakeisti, fono spalva.

# editorWidgetBorder
source: Border color of editor widgets. The color is only used if the widget chooses to have a border and if the color is not overridden by a widget.
lt_lt: Redaktoriaus valdiklių rėmelių spalva. Spalva naudojama tik tuo atveju, jei valdiklis pasirenka turėti apvadą ir jei spalva nėra pakeista valdikliu.

# editorWidgetForeground
source: Foreground color of editor widgets, such as find/replace.
lt_lt: Redaktoriaus valdiklių, pvz., rasti / pakeisti, pirmojo plano spalva.

# editorWidgetResizeBorder
source: Border color of the resize bar of editor widgets. The color is only used if the widget chooses to have a resize border and if the color is not overridden by a widget.
lt_lt: Redaktoriaus valdiklių dydžio keitimo juostos ribų spalva. Spalva naudojama tik tuo atveju, jei valdiklis pasirenka keisti dydžio ribas ir jei spalva nėra pakeista valdikliu.

# errorBorder
source: Border color of error boxes in the editor.
lt_lt: Redaktoriaus klaidų langelių ribų spalva.

# errorForeground
source: Overall foreground color for error messages. This color is only used if not overridden by a component.
lt_lt: Bendra klaidų pranešimų pirmojo plano spalva. Ši spalva naudojama tik tuo atveju, jei jos neperrašo komponentas.

# findMatchHighlight
source: Color of the other search matches. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Kitų paieškos atitikmenų spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# findMatchHighlightBorder
source: Border color of the other search matches.
lt_lt: Kitų paieškos atitikmenų ribos spalva.

# findRangeHighlight
source: Color of the range limiting the search. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Paiešką ribojančio diapazono spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# findRangeHighlightBorder
source: Border color of the range limiting the search. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Paiešką ribojančio diapazono ribos spalva. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# focusBorder
source: Overall border color for focused elements. This color is only used if not overridden by a component.
lt_lt: Bendra fokusuotų elementų apvado spalva. Ši spalva naudojama tik tuo atveju, jei jos nepakeičia komponentas.

# foreground
source: Overall foreground color. This color is only used if not overridden by a component.
lt_lt: Bendra pirmojo plano spalva. Ši spalva naudojama tik tuo atveju, jei jos nepakeičia komponentas.

# highlight
source: List/Tree foreground color of the match highlights when searching inside the list/tree.
lt_lt: Sąrašo / medžio pirmojo plano spalva, kuria paryškinami atitikmenys, kai ieškoma sąraše / medyje.

# hintBorder
source: Border color of hint boxes in the editor.
lt_lt: Redaktoriaus užuominų langelių ribų spalva.

# hoverBackground
source: Background color of the editor hover.
lt_lt: Redaktoriaus fono spalva, kai rodomas užsklanda.

# hoverBorder
source: Border color of the editor hover.
lt_lt: Redaktoriaus žymeklio ribos spalva.

# hoverForeground
source: Foreground color of the editor hover.
lt_lt: Redaktoriaus žymės pirmojo plano spalva.

# hoverHighlight
source: Highlight below the word for which a hover is shown. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Paryškinkite po žodžiu, kuriam rodoma užsklanda. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# iconForeground
source: The default color for icons in the workbench.
lt_lt: Numatytoji darbalaukio piktogramų spalva.

# infoBorder
source: Border color of info boxes in the editor.
lt_lt: Redaktoriaus informacijos langelių apvadų spalva.

# inputBoxActiveOptionBorder
source: Border color of activated options in input fields.
lt_lt: Įvesties laukų įjungtų parinkčių ribų spalva.

source: Input box background.
lt_lt: Įvesties langelio fonas.

source: Input box border.
lt_lt: Įvesties langelio apvadas.

source: Input box foreground.
lt_lt: Įvesties laukas pirmame plane.

# inputOption.activeBackground
source: Background color of activated options in input fields.
lt_lt: Įvesties laukų įjungtų parinkčių fono spalva.

# inputOption.activeForeground
source: Foreground color of activated options in input fields.
lt_lt: Įvesties laukų aktyvuotų parinkčių įvesties fono spalva.

# inputPlaceholderForeground
source: Input box foreground color for placeholder text.
lt_lt: Įvesties lauko įvesties teksto pirmojo fono spalva.

# inputValidationErrorBackground
source: Input validation background color for error severity.
lt_lt: Įvesties patvirtinimo fono spalva pagal klaidos rimtumą.

# inputValidationErrorBorder
source: Input validation border color for error severity.
lt_lt: Įvesties patvirtinimo rėmelio spalva pagal klaidos sunkumą.

# inputValidationErrorForeground
source: Input validation foreground color for error severity.
lt_lt: Įvesties patvirtinimo įvesties pirmojo fono spalva pagal klaidos rimtumą.

# inputValidationInfoBackground
source: Input validation background color for information severity.
lt_lt: Įvesties patvirtinimo fono spalva, skirta informacijos rimtumui.

# inputValidationInfoBorder
source: Input validation border color for information severity.
lt_lt: Įvesties patvirtinimo ribos spalva, skirta informacijos griežtumui.

# inputValidationInfoForeground
source: Input validation foreground color for information severity.
lt_lt: Įvesties patvirtinimo įvesties pirmojo fono spalva, skirta informacijos rimtumui.

# inputValidationWarningBackground
source: Input validation background color for warning severity.
lt_lt: Įvesties patvirtinimo fono spalva, skirta įspėjimo rimtumui.

# inputValidationWarningBorder
source: Input validation border color for warning severity.
lt_lt: Įvesties patvirtinimo rėmelio spalva, skirta įspėjimo griežtumui.

# inputValidationWarningForeground
source: Input validation foreground color for warning severity.
lt_lt: Įvesties patvirtinimo įvesties įspėjimo griežtumo pirmojo fono spalva.

# invalidItemForeground
source: List/Tree foreground color for invalid items, for example an unresolved root in explorer.
lt_lt: Sąrašo / medžio priekinio fono spalva negaliojantiems elementams, pvz., neišspręstai šakniai naršyklėje.

# keybindingLabelBackground
source: Keybinding label background color. The keybinding label is used to represent a keyboard shortcut.
lt_lt: Klavišų pririšimo etiketės fono spalva. Klavišų pririšimo etiketė naudojama klaviatūros spartaus klavišo kombinacijai atvaizduoti.

# keybindingLabelBorder
source: Keybinding label border color. The keybinding label is used to represent a keyboard shortcut.
lt_lt: Klavišų pririšimo etiketės apvado spalva. Klavišų pririšimo etiketė naudojama klaviatūros spartaus klavišo kombinacijai atvaizduoti.

# keybindingLabelBottomBorder
source: Keybinding label border bottom color. The keybinding label is used to represent a keyboard shortcut.
lt_lt: Klavišų pririšimo etiketės apvado apatinės dalies spalva. Klavišų pririšimo etiketė naudojama klaviatūros spartaus klavišo kombinacijai atvaizduoti.

# keybindingLabelForeground
source: Keybinding label foreground color. The keybinding label is used to represent a keyboard shortcut.
lt_lt: Klavišų pririšimo etiketės pirmojo plano spalva. Klavišų pririšimo etiketė naudojama klaviatūros spartaus klavišo kombinacijai atvaizduoti.

# listActiveSelectionBackground
source: List/Tree background color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Pasirinkto elemento fono spalva, kai sąrašas / medis yra aktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listActiveSelectionForeground
source: List/Tree foreground color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio pirmojo plano spalva pasirinktam elementui, kai sąrašas / medis yra aktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listActiveSelectionIconForeground
source: List/Tree icon foreground color for the selected item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio piktogramos pirmojo plano spalva, skirta pasirinktam elementui, kai sąrašas / medis yra aktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listDeemphasizedForeground
source: List/Tree foreground color for items that are deemphasized.
lt_lt: Sąrašo / medžio pirmojo plano spalva elementams, kurie yra išskirtini

# listDropBackground
source: List/Tree drag and drop background when moving items around using the mouse.
lt_lt: Sąrašo / medžio vilkimo ir nuleidimo fonas, kai elementus perkeliate pele.

# listErrorForeground
source: Foreground color of list items containing errors.
lt_lt: Sąrašo elementų, kuriuose yra klaidų, pirmojo plano spalva.

# listFilterMatchHighlight
source: Background color of the filtered match.
lt_lt: Išfiltruoto atitikmens fono spalva.

# listFilterMatchHighlightBorder
source: Border color of the filtered match.
lt_lt: Filtruojamo atitikmens ribos spalva.

# listFilterWidgetBackground
source: Background color of the type filter widget in lists and trees.
lt_lt: Sąrašuose ir medžiuose esančio tipo filtro valdiklio fono spalva.

# listFilterWidgetNoMatchesOutline
source: Outline color of the type filter widget in lists and trees, when there are no matches.
lt_lt: Sąrašuose ir medžiuose esančio tipo filtro valdiklio kontūro spalva, kai nėra atitikmenų.

# listFilterWidgetOutline
source: Outline color of the type filter widget in lists and trees.
lt_lt: Sąrašuose ir medžiuose esančio tipo filtro valdiklio kontūro spalva.

# listFocusBackground
source: List/Tree background color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio fono spalva, skirta fokusuotam elementui, kai sąrašas / medis yra aktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listFocusForeground
source: List/Tree foreground color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio pirmojo plano spalva, skirta fokusuotam elementui, kai sąrašas / medis yra aktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listFocusHighlightForeground
source: List/Tree foreground color of the match highlights on actively focused items when searching inside the list/tree.
lt_lt: Sąrašo / medžio pirmojo plano spalva, kuria paryškinami aktyviai fokusuojamų elementų atitikmenys, kai ieškoma sąrašo / medžio viduje.

# listFocusOutline
source: List/Tree outline color for the focused item when the list/tree is active. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio kontūro spalva, skirta sufokusuotam elementui, kai sąrašas / medis yra aktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listHoverBackground
source: List/Tree background when hovering over items using the mouse.
lt_lt: Sąrašo / medžio fonas, kai užvedus pelę ant elementų.

# listHoverForeground
source: List/Tree foreground when hovering over items using the mouse.
lt_lt: Sąrašo / medžio pirmas planas, kai pelės žymekliu užvedama ant elementų.

# listInactiveFocusBackground
source: List/Tree background color for the focused item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio fono spalva, skirta fokusuotam elementui, kai sąrašas / medis yra neaktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listInactiveFocusOutline
source: List/Tree outline color for the focused item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio kontūro spalva, skirta fokusuotam elementui, kai sąrašas / medis yra neaktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listInactiveSelectionBackground
source: List/Tree background color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio fono spalva pasirinktam elementui, kai sąrašas / medis yra neaktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listInactiveSelectionForeground
source: List/Tree foreground color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Sąrašo / medžio pirmojo plano spalva pasirinktam elementui, kai sąrašas / medis yra neaktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listInactiveSelectionIconForeground
source: List/Tree icon foreground color for the selected item when the list/tree is inactive. An active list/tree has keyboard focus, an inactive does not.
lt_lt: Pasirinkto elemento sąrašo / medžio piktogramos pirmojo plano spalva, kai sąrašas / medis yra neaktyvus. Aktyvus sąrašas / medis turi klaviatūros fokusą, neaktyvus - ne.

# listWarningForeground
source: Foreground color of list items containing warnings.
lt_lt: Sąrašo elementų, kuriuose yra įspėjimų, pirmojo plano spalva.

# menuBackground
source: Background color of menu items.
lt_lt: Meniu elementų fono spalva.

# menuBorder
source: Border color of menus.
lt_lt: Meniu ribų spalva.

# menuForeground
source: Foreground color of menu items.
lt_lt: Meniu elementų pirmojo plano spalva.

# menuSelectionBackground
source: Background color of the selected menu item in menus.
lt_lt: Pasirinkto meniu elemento fono spalva.

# menuSelectionBorder
source: Border color of the selected menu item in menus.
lt_lt: Meniu pasirinkto meniu elemento ribos spalva.

# menuSelectionForeground
source: Foreground color of the selected menu item in menus.
lt_lt: Pasirinkto meniu elemento pirmojo plano spalva.

# menuSeparatorBackground
source: Color of a separator menu item in menus.
lt_lt: Meniu atskiriamojo meniu elemento spalva.

# mergeBorder
source: Border color on headers and the splitter in inline merge-conflicts.
lt_lt: Apvado spalva antraštėse ir dalytuve, kai yra eilutės sujungimo konfliktų.

# mergeCommonContentBackground
source: Common ancestor content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Bendro protėvio turinio fonas eilutės sujungimo konfliktuose. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# mergeCommonHeaderBackground
source: Common ancestor header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Bendro protėvio antraštės fonas eilutės sujungimo konfliktuose. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# mergeCurrentContentBackground
source: Current content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Dabartinis turinio fonas eilutės sujungimo konfliktuose. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# mergeCurrentHeaderBackground
source: Current header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Dabartinis antraštės fonas eilutės sujungimo konfliktuose. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# mergeIncomingContentBackground
source: Incoming content background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Įeinančio turinio fonas eilutės sujungimo konfliktuose. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# mergeIncomingHeaderBackground
source: Incoming header background in inline merge-conflicts. The color must not be opaque so as not to hide underlying decorations.
lt_lt: Įeinančios antraštės fonas eilutės sujungimo konfliktuose. Spalva neturi būti nepermatoma, kad nepaslėptų po ja esančių dekoracijų.

# minimapBackground
source: Minimap background color.
lt_lt: Minimalaus žemėlapio fono spalva.

# minimapError
source: Minimap marker color for errors.
lt_lt: Minimalaus žemėlapio klaidų žymeklio spalva.

# minimapFindMatchHighlight
source: Minimap marker color for find matches.
lt_lt: Minimaliojo žemėlapio žymeklio spalva, kai ieškoma atitikmenų.

# minimapSelectionHighlight
source: Minimap marker color for the editor selection.
lt_lt: Minimap žymeklio spalva redaktoriaus pasirinkimui.

# minimapSliderActiveBackground
source: Minimap slider background color when clicked on.
lt_lt: Minimalaus žemėlapio slankiklio fono spalva, kai spustelėjama.

# minimapSliderBackground
source: Minimap slider background color.
lt_lt: Minimalaus žemėlapio slankiklio fono spalva.

# minimapSliderHoverBackground
source: Minimap slider background color when hovering.
lt_lt: Minimalaus žemėlapio slankiklio fono spalva, kai užvedamas.

# overviewRuleWarning
source: Minimap marker color for warnings.
lt_lt: Minimalaus žemėlapio įspėjimų žymeklio spalva.

# overviewRulerCommonContentForeground
source: Common ancestor overview ruler foreground for inline merge-conflicts.
lt_lt: Bendro protėvio apžvalgos liniuotė pirmame plane, skirta eilutės sujungimo konfliktams.
